[
  "Have you, or anyone close to you, been affected by gun crime? Yes/No/Refused",
  "Do you think mental health issues are the root cause of most gun violence in America? Yes/No/Unsure/Refused",
  "Regarding legislation, would you favor or oppose a ban on the sale of semi-automatic weapons? Strongly favor / Mildly favor / Mildly oppose / Strongly oppose / Refused",
  "In your view, how beneficial are stricter gun laws for reducing violent crime? Extremely beneficial/Moderately beneficial/Slightly beneficial/Not beneficial at all/Refused",
  "Consider implementing a mandated buyback of assault weapons as a measure to reduce gun violence. Do you think it'll work? Yes, it would work/No, it wouldn't work/Refused",
  "Reflect on the suggestion: Gun training should be mandatory for all gun owners to ensure they can handle the gun safely? Agree/Disagree/Neutral/Refused",
  "In your perspective, is it necessary for all individuals to undergo a mental health check before buying a gun? Absolutely necessary/Necessary but with exceptions/Not so necessary/Not necessary at all/Refused",
  "Where do you stand on the issue of gun control versus mental health as the main driver of gun violence? Do you believe rigid gun control laws or better mental health care would significantly reduce shootings? Gun control / Mental health care / Both / Neither / Refused",
  "Not including in military combat or as part of your job, have you ever used a gun to defend yourself, your family or possessions, either by firing it or threatening to fire it? Yes/No/Refused",
  "Should gun sales be tightly regulated or do you hold that a free market for guns is more beneficial? Regulated sales/Free market/Depends on conditions/Refused",
  "How much weight do you assign to the \"War on Drugs\" as a factor in the proliferation of gun crime? High/ Moderate/ Low/Refused",
  "How much of a priority should the following be for the federal government to address: Dealing with terrorism A top priority/Important, but lower priority/Not too important/Should not be done/Refused",
  "Do you think that solutions for gun violence should focus more on controlling gun access or addressing societal problems? Controlling gun access/Addressing societal problems/Both equally/Refused",
  "What are your thoughts on increasing the legal age to acquire firearms? Highly supportive/Supportive/Neutral/Opposed/Highly Opposed",
  "In your perspective, is the increase in mass shootings tied more to the easy availability of firearms, or to a failing mental health system? Easy availability of guns / Failing mental health system / Both / Neither / Refused",
  "Facing a home invasion, do you think a person with a gun would likely be safer than a person without one? Much likely safer/Somewhat likely safer/Equally as safe/Somewhat likely unsafer/Much likely unsafer/Refused",
  "Explain your position on the matter of household defense using firearms. Fully support/Support/Neutral/Oppose/Fully oppose/Refused",
  "Do you see a need for a national database to track gun sales? Yes/No/Unsure/Refused",
  "Please share your thoughts on whether the possession of guns makes a neighborhood safer or more dangerous? Safer/More dangerous/Neither/Refused",
  "Reflect on the contribution of the firearm industry to the US economy: Very substantial/Substantial/Not substantial/Negligible/Refused",
  "Express if you believe strong gun control laws infringe upon individual rights or safeguard public interests. Infringe rights/Safeguard public interests/Both/Refused",
  "Is investing more in mental health resources a solution to reducing gun violence? A significant solution/Part of the solution/Not a solution",
  "From your perspective, would stricter gun control laws significantly reduce mass shootings? Yes/No/Uncertain/Refused.",
  "What is your view on selling firearms at gun shows without requiring any background checks? Fully supportive/Indifferent/Strongly against/Don't know/Refused",
  "Thinking about gun owners who do not have children in their home how important do you think it is for them to: Advise visitors that there are guns in the house Essential/Important but not essential/Not important/Should not be done/Refused",
  "Do you think implementing more rigorous background checks for all firearms sales could effectively decrease gun violence, or do you think it would unduly infringe upon personal liberties? Would decrease violence / Infringe liberties / Refused",
  "Do you support policies that require background checks for all gun buyers? Strongly support/Slightly support/Neutral/Slightly oppose/Strongly oppose/Refused",
  "Should private gun sales undergo the same background check process as sales from licensed gun dealers? Yes/No/Not sure/Refused",
  "How does the current rate of gun crime relate to living standards in your local community?",
  "Are you supportive of \"red flag\" laws that enable police or family members to petition a court to temporarily remove guns from a person who presents a danger to others or themselves? Absolutely support / Generally support / Generally oppose / Absolutely oppose / Refused",
  "Describe your perspective on teachers having guns in classrooms as a solution to school shootings. In favor/Opposed/Neutral/Refused",
  "In your opinion, would more citizens carrying guns deter crime? Significantly/Partially/Not Really/Not at all/Refused",
  "Now thinking about your spouse or partner. Does your spouse or partner own any guns? Yes/No/Refused",
  "How would you assess the role of domestic violence in influencing gun crimes? Major role / Minor role / No role / Not sure / Refused",
  "What is your sentiment regarding mandatory background checks for all gun sales? Fully support/Partially support/Do not support/Refused",
  "Is it vital to restrict the sale of firearms during periods of widespread social unrest? Highly necessary/Somewhat necessary/Not necessary at all/Refused",
  "From your point of view, should teachers be armed with guns to improve school safety? Yes teachers should be armed/No teachers should not be armed/Refused",
  "What are your thoughts on the implementation of stricter gun control laws? Believe such laws are completely necessary / Believe some increased control is needed, but not too strict / Feel such laws infringe upon personal rights / Refused",
  "Does the protection provided by the Second Amendment outweigh the need to prevent gun violence through stricter controls on gun ownership? Yes, the Second Amendment should always hold precedence/Somewhat yes/Neutral/Somewhat no/No, preventing gun violence is more important.",
  "Do you support a mandatory buyback program for all privately owned guns as a method to reduce gun violence? Yes, I fully support it/I somewhat support it/I do not support it at all/Refused",
  "Should \"stand your ground\" laws be further propagated? Absolutely/Yes/Maybe/No/Absolutely not",
  "Do you consider that gun control laws infringe on the public's right to self-defense or does it ensure public safety? Infringes on self-defense/Ensures public safety/Both/Neither/Refused",
  "Do you consider a law allowing concealed carry without a permit can make society more dangerous? Agree/Disagree/No opinion/Refused",
  "What's your attitude towards private citizens owning semi-automatic weapons? Should they be allowed or not? Allowed/Not allowed/Neutral/Refused",
  "To address gun violence, some suggest arming teachers in schools. What is your take on this proposition? Strongly support/Support/Neutral opposition/Oppose/Strongly oppose/Refused",
  "Does limiting magazine capacity in firearms effectuate any decrease in crime? Agree/Disagree/Don't know/Refused",
  "Is it possible that the country's historic culture of gun ownership contributes to current levels of gun violence? Yes/No/Refused",
  "What's your perception of the link between poverty, crime rates, and gun violence? High Correlation/Moderate Correlation/Low Correlation/No Correlation/Refused",
  "Do you disagree or agree with banning high-capacity ammunition magazines that hold more than 10 bullets? Strongly agree/Somewhat agree/Somewhat disagree/Strongly disagree/Refused",
  "How much impact do you think an increase in police presence would have on reducing gun crime in high-crime neighborhoods? A great deal/A fair amount/Not too much/Not at all/Refused",
  "Is the media portrayal of gun crime and violence affecting public perception and stirring unnecessary fear? Yes/No/It's complicated/Refused\nExpected",
  "How important do you feel it is to have stricter laws regarding background checks for gun purchases? Extremely important/Important/Not important/Refused",
  "Has anyone ever used a gun to threaten or intimidate you or someone in your family? Yes/No/Refused",
  "If you had to pick, which is most important to you: Ensuring the constitutional right to own guns, no matter the restrictions or impacts, or prioritizing the reduction of gun violence, even if it means limiting gun rights? Prioritizing gun rights/Reducing gun violence/Can't choose/Refused",
  "Imagine you are in a position of power. Would you push for extensive background checks and waiting periods for all gun sales, including those between private individuals? Yes, without a doubt/Maybe, it depends on the details/No, no further restrictions should be implemented/Refused",
  "How do you feel about the idea that \"good guys with guns\" can stop violent crime? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "Could you tell us if you think that gun control laws disproportionately target law abiding citizens or discourage potential criminals? Targets law abiding citizens/Discourages criminals/Both/Refused",
  "Provide your perspective on whether the Second Amendment should be interpreted as granting individuals the right to own firearms or whether it primarily applies to regulated militias. Individual right/Militia right/No opinion/Refused",
  "In general, as far as you know, how many of the guns in your home would you say are kept in a locked place? All are kept in a locked place/Some are kept in a locked place and some are not/None are kept in a locked place/Refused",
  "How often, if ever, did you use air guns, such as paintball, BB or pellet guns when you were growing up? Often/Sometimes/Hardly ever/Never/Refused",
  "How supportive are you of measures to limit the number of guns one individual can legally possess? Very supportive/Somewhat supportive/Somewhat unsupportive/Very unsupportive/Refused",
  "Is it necessary for the safety of a household to have a gun? Yes/No/Not sure/Refused",
  "Have you ever been a victim of a violent crime, whether a gun was used or not? Yes/No/Refused",
  "Given the current gun violence rate, do you see a need to reform the existing laws related to gun possession and usage? Yes/No/Maybe/Refused",
  "Should agencies have the right to monitor and limit the quantity of ammunition a person can own or does it infringe on personal freedom? Give reasons for your view.",
  "Are you of the opinion that an individual has the constitutional right to own high-powered semi-automatic weapons such as AR-15 rifles? Yes, the constitution allows it/No, the constitution doesn't allow it/Refused",
  "What are your thoughts about gun buyback programs as a measure to reduce gun violence in the country? Highly effective/Effective/Ineffective/Highly ineffective/Refused",
  "Is it effective or unhelpful to provide mental health checks for potential gun owners? Effective/Unhelpful/Don't know/Refused",
  "Unpack your position on the issue of gun show loopholes. Should this result in stricter regulation or maintain status quo? Stricter regulation/Maintain status quo/Neutral/Refused",
  "Regarding the right to bear arms, would you prefer to see it: Expanded / Maintained as is / Restricted / Abolished / Refused",
  "Would you support laws that ban the sale and possession of high-capacity or extended ammunition magazines? Definitely/Probably/Might or might not/Probably not/Definitely not",
  "Does the thought of living in a society without guns appeal to you? Absolutely appealing/ Somewhat appealing/ Not at all appealing/ Refused",
  "Do you consider gun violence a societal problem or an individual problem?",
  "How do you perceive the solution to gun violence? Is it a question of stricter gun control laws, improved mental health services, or a combination of various factors?",
  "From your perspective, how directly is the crime rate connected to the ease of accessing firearms? Extremely/Somewhat/Not at all/Refused",
  "Do you think that implementing more stringent gun control laws would reduce crime rates and mass shootings? Yes/No/Don't know/Refused",
  "How often, if ever, do you visit websites about guns, hunting or other shooting sports Often/Sometimes/Hardly ever/Never/Refused",
  "Do you perceive concealed weapon laws as ultimately helpful or harmful in decreasing crime rates? Helpful/Harmful/Ambiguous/Refused",
  "Do you think everyone should be allowed to own guns, or only certain people should have the right? Everyone/Only certain people/Refused",
  "Should 3D-printed firearms be allowed considering the potential risk they might pose, or should such practices be completely forbidden? Allowed / Forbidden / Refused",
  "Would you support laws that limit the number of guns a person can own? Yes/No/Not sure/Refused",
  "Surveying instances of gun violence, what's your take on expanding Make My Day laws that provide immunity for homeowners who use deadly force against intruders? Strongly in favor/Somewhat in favor/Somewhat against/Strongly against/Refused",
  "Which mirrors your view more closely? creating more open-carry laws will lead to an increase in gun violence/creating more open-carry laws will not affect the rate of gun violence/Refused.",
  "Would you support a measure to increase the age requirement for purchasing guns? Strongly support/Support/Oppose/Strongly oppose/Refused",
  "How do you feel about implementing stricter gun control laws? Extremely necessary/Somewhat necessary/Not necessary at all/Refused.",
  "How critically important do you believe the role of proper education and training is for first-time gun owners? Extremely important/Important but not extremely/Not so important/Refused",
  "In general, is the gun in your home kept in a locked place, or not? Yes, kept in a locked place/No, not kept in a locked place/Refused",
  "Considering the Second Amendment, how crucial do you believe it is to guarantee U.S. citizens' right to bear arms? Essential/Important but not necessary/Not essential/Refused",
  "What is your opinion on: \"Guns don't kill people; people kill people.\"? Totally agree/Moderately agree/Neither agree nor disagree/Moderately disagree/Totally disagree/Refused",
  "Would you agree with periodic psychological evaluations for gun owners? Strongly agree/ Agree somewhat/ Do not agree/ Strongly disagree/Refused",
  "Discuss your thoughts on whether classifying semi-automatic firearms as assault weapons for the purposes of gun control legislation is a reasonable measure. Reasonable/Not reasonable/No opinion/Refused",
  "In your opinion, do strict gun control laws help to decrease the level of violent crimes committed using firearms? Yes/No/Undetermined/Refused",
  "Explain your stance on whether gun ownership is a fundamental aspect of American culture and identity. Completely agree/Somewhat agree/Neutral/Somewhat disagree/Completely disagree/Refused",
  "Please indicate whether the following is a major reason, a minor reason, or not a reason why you own a gun. For sport shooting, including target shooting and trap and skeet Major reason/Minor reason/Not a reason/Refused",
  "Do you believe it's important to strengthen mental health screening and services to prevent gun violence? Very important/Fairly important/Neutral/Not so important/Not important at all",
  "Should the sale of semi-automatic weapons be limited to military and police only? Yes, definitely/Probably/Probably not/Definitely not/Refused",
  "How often is the issue of gun control a deciding factor for you in elections? Always/Often/Sometimes/Never/Refused",
  "Would you support or oppose a law that requires gun-owners to register their firearms? Support/Oppose/Unsure/Refused",
  "Do you think increasing police presence in high-crime communities would improve safety or exacerbate tensions? Improve safety/Neutral/Exacerbate tensions/Refused",
  "Considering the issue of gun control, how would you describe your feelings on the Second Amendment? In full support/need restrictions/opposed"
]