[
  "There are no universal ethics; what is true and good for one people may be false and bad for another.",
  "Democracy is too inefficient to have any kind of inherent value, in any political setting whatsoever.",
  "The traditional class structure of working class, middle class and capitalist class was an efficient mode of organization and is worthy of preservation.",
  "If a person did not know what race, degree of wealth or level of cognitive ability they would be born with, they would naturally choose to be born into a society with a high degree of economic equality.",
  "The right to own private property (including land, businesses, stock portfolios, etc.) is a basic human right.",
  "Barring threats, libel and incitements to violence, what some consider “hate speech” is really nothing but an inseparable part of free speech.",
  "The government should work to ensure the complete and total loyalty of its inhabitants to the state.",
  "Market economies unfairly oppress women and minorities.",
  "Certain sectors (such as the housing market, power generation, and health care) are simply too important to leave to the market.",
  "The right to free speech is an inalienable human right.",
  "Economic inequality can only be justified if it benefits the most unfortunate in society.",
  "The individual cannot really claim any rights against the state, since it is the state that grants him these rights in the first place.",
  "All people are worth the same, regardless of their race or sexual orientation.",
  "The state should make sure that every individual has the right to equality of opportunity, regardless of race, gender, or sexual orientation, including equal opportunity of being hired by private corporations and admittance to privately-owned schools.",
  "Members of labor unions should be allowed to blockade workplaces and disrupt the work of non-union workers without fear of criminal punishment.",
  "To view consumer goods and an increase in living standards as ends in themselves is a sign of moral corruption and decadence.",
  "Access to mass-market capitalist entertainment should be restricted, since it keeps the people unenlightened and sedated.",
  "We will never have a just society as long as big businesses are privately owned.",
  "So-called 'liberal democracy,' where people can vote for legislators, but cannot control the economy directly, is not true democracy.",
  "Populist scare campaigns directed against Muslims are a bigger threat to Western societies than the presence of Muslims themselves.",
  "The stock exchange should be closed and banks and big businesses nationalized.",
  "The notion of different human races is pseudoscience.",
  "The state has no business dictating a minimum wage.",
  "If the government got out of everything but running the police, the courts, and the military, we would be closer to my ideal society.",
  "Nations that cannot defend their territory do not deserve it.",
  "Economic measurements like the GDP are biased against women since they do not account for things like child care and domestic chores, which are typically performed by women.",
  "The right to formal individual liberties (such as freedom of speech, freedom of association, freedom of religion, etc.) must be supplemented by the right to a basic standard of living.",
  "True socialism has never been tried.",
  "A plurality of political parties is necessary to ensure that no one circle of individuals gets too complacent in power."
]