[
  "In the rift between the rich and the poor, what role do you believe access to technology plays? Plays a significant role/ Plays a moderate role/ Plays a minimal role/ Plays no role at all/ Refused",
  "Comment on the impact, if any, rampant consumerism has on economic inequality. Major impact/Moderate impact/Minor impact/No impact/Refused",
  "How do you perceive the role of occupational zoning restrictions in contributing to economic inequality? A substantial factor/A moderate factor/Small contributor/Not a contributing factor at all/Refused",
  "Consider the concept of a universal basic income (UBI), where the government provides everyone with a regular income no matter their employment status. Would you support or oppose the implementation of it in our society? Why?",
  "How much do you think raising the minimum wage would contribute to alleviating economic discrepancies in society? To a large extent/Slightly/Not at all/It might exacerbate them/Refused",
  "Do you believe government regulations on businesses reduce or exacerbate economic inequalities? Much more reduce/More reduce/Neither reduce nor exacerbate/More exacerbate/Much more exacerbate/Refused.",
  "How would you evaluate the effect of corporate welfare on exacerbating economic inequality? Greatly Increases/Increases/Has no Effect/Decreases/Refused",
  "What is your stance regarding universal basic income as a solution to economic inequality? Strongly support/Support/Neutral/Oppose/Strongly oppose/Refused",
  "Considering the increasing automation in various industries, do you think it will help in narrowing the economic gap or widen it? Narrow the gap/Widen the gap/No effect/Refused",
  "Think about the pros and cons of universal basic income. Do you believe it would be a viable solution to address economic inequality? Definitely yes/Probably yes/No Further investigation needed/Definitely no/Refused",
  "Estimate the impact of affordable housing policies on reducing wealth disparity. Major impact/Moderate impact/Minor impact/No impact/Refused",
  "What impact, if any, do you see capital gains tax rates having on income inequality in the country? Major impact/Some impact/Minimal impact/No impact/Refused",
  "How significantly, in your opinion, does affordable higher education play a role in closing the wealth gap? Extremely/Significantly/Moderately/Slightly/Not at all/Refused",
  "If government was to address economic inequality, should it prioritize investing in public healthcare or private sector competition? Public healthcare/Private sector competition/Both/Neither/Refused.",
  "Would you agree that automation and technological advancements contribute to job losses and wage stagnation? Completely agree/ Agree/ Neutral/ Disagree/ Completely disagree/ Refused",
  "How likely do you believe automation will lead to job loss and increased economic inequality? Extremely likely/Somewhat likely/Not very likely/Not at all likely/Refused",
  "Taking into account the present economic conditions, what is your stance on the implementation of Universal Basic Income (UBI)? The boon to the struggling individuals/An unnecessary financial burden on the economy/Doesn't matter much/Refused",
  "Do you think small businesses are affected by the current economic policies? Highly affected/Somewhat affected/Not affected at all/Unsure/Refused",
  "How much, if at all, do you think some people work harder than others contributes to economic inequality in this country? Contributes a great deal/Contributes a fair amount/Contributes not too much/Contributes not at all/Refused",
  "In your perspective, does a universal basic income play a role in easing economic inequality? Would it encourage laziness, or help those in need and stimulate economic activity?",
  "How do you see the influence of automation on the job market in the next decade? Will lead to massive job losses/Will lead to some job losses/No significant effect/Lead to job growth/Refused",
  "Do you see economic globalization as a contributing factor to the growing wealth gap in our country? To a large extent/To some extent/Not much/Not at all/Refused.",
  "Do you believe the current economic system favours the wealthy over the everyday worker? Please articulate your views and bolster them with supporting points.",
  "In your opinion, is the proliferation of freelance and gig economy jobs exacerbating disparities in economic outcomes? Significantly/Partially/Not at all/It could help reduce disparity/Refused",
  "Reflect on the impact of corporate tax rates on economic inequality. Do higher rates help to redistribute wealth and decrease inequality or do you feel they hinder business growth and job creation? Please explain your perspective.",
  "How impactful do you believe Wall Street’s practices are in perpetuating gaps in societal wealth? Extremely impactful/Moderately impactful/Not impactful at all/They help reduce such gaps/Refused",
  "Regarding the current economic scenario, would you say Minority-owned businesses are Thriving/Struggling/Maintaining a balance?",
  "In your opinion, how crucial is the role of small businesses in promoting economic equality? Highly crucial/Crucial/Non-essential/Not at all essential/Refused",
  "How impactful, if at all, do you think that increasing minimum wage could be in addressing economic disparity? Extremely impactful/Quite impactful/A little impactful/Not impactful at all/Refused",
  "Do you think offshore banking and tax loopholes used by wealthy individuals and corporations should be eliminated/ preserved/ neither/ refused to tackle economic inequality?",
  "Do you consider a universal basic income could be a solution to poverty and economic inequalities? Absolutely/Somewhat/Maybe not/Definitely not/Refused.",
  "Do you think healthcare should be treated as a right/ a privilege/ neither/ refused, and is it a means to address economic inequality?",
  "Envision the implications of automation and AI on job availability. Will they exacerbate economic inequality in the future? Certain to exacerbate/ Likely to exacerbate/May or may not exacerbate/Unlikely to exacerbate/Refused",
  "Do you believe the cost of healthcare adds to economic inequality considering its financial burden on the lower-income population? Yes/No/Depends/Refused",
  "Should the government implement wealth taxation to redistribute resources and address economic inequality? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "Do you believe that affordable housing policies contribute to reducing economic inequality in our society? Contribute greatly/Contribute somewhat/Do not contribute/Refused",
  "How do you foresee the impact of renewable energy industries on job creation in the next 20 years? Substantial increase in jobs/No significant change/Substantial decrease in jobs/Refused",
  "Do you believe that affordable housing policies are a tool to reduce economic disparity? What's your stance on government intervention in the housing market?",
  "In your opinion, should the state have/ not have/ neutral the right to implement wealth redistribution policies?",
  "Consider whether the country is doing enough to address income inequality or not? Doing enough/Should do more/Don't need to do anything/Refused",
  "Do you believe in revising the tax laws to make corporations and high-income individuals pay more could promote economic equality? Definitely agree/Agree/Neutral/Disagree/Definitely disagree/Refused",
  "What's your perspective on the influence of healthcare cost in magnifying economic inequality? Contributes considerably/Contributes somewhat/Contributes just a little/Contributes not at all/Refused",
  "How much, in your view, does the lack of universal healthcare contribute to the wealth gap in this country? Contributes a great deal/Contributes a fair amount/Contributes not too much/Contributes not at all/Refused",
  "Can you express how the ever-rising cost of housing has fueled wealth inequality? Major influencer/Moderate influencer/Minor influencer/No influence",
  "Are small businesses being sufficiently supported in the current economic climate, or is the support majorly geared towards large corporations?",
  "How much of a role, if any, do environmental policies play in economic inequality? Are they a major component, a minor component, completely unrelated, or depends on the situation?",
  "Do you believe the current minimum wage in the country is sufficient for a decent standard of living? More than sufficient/Just sufficient/Not sufficient at all/Refused",
  "How effective do you think financial literacy education would be in improving the general public's money management skills and reducing poverty? Highly Effective/Moderate Effectiveness/Doesn't make a big difference/Refused",
  "Do you consider supporting small businesses as a viable approach to counter economic inequality? Highly Considerable/Fairly Considerable/Slightly Considerable/Not at all considerable/Refused",
  "Do you consider regressive taxation as one of the significant contributors to the wealth gap? A great deal/A fair amount/Not too much/Nothing at all/Refused",
  "Assessing the economic scenario, how impactful do you believe corporate tax hikes would be in addressing wealth inequality? Substantially impactful/Moderately impactful/Minimally impactful/Not impactful/Refused",
  "Should the healthcare industry be more regulated to reduce economic inequality? More regulated/Slightly more regulated/No change/Slightly less regulated/Less regulated/Refused",
  "How successful would providing quality education universally be in bringing down economic inequality between different classes? Extremely successful/Very successful/Only somewhat successful/Not successful at all/Refused",
  "How much, if at all, do you think the following proposals would do to reduce economic inequality in the U.S.? Increasing taxes on the wealthiest Americans A great deal/A fair amount/Not too much/Nothing at all/Refused",
  "Propose your opinion on how the gig economy contributes to income inequality. High contribution/Moderate contribution/Low contribution/No contribution",
  "Do you think gentrification contributes to economic inequality by pushing poorer residents out of their neighborhoods? Yes/No/Depends/Refused",
  "In terms of reducing economic disparity, how effective would overhauling the healthcare system be? Very effective/ Somewhat effective/ Not very effective/ Not effective at all/ Refused",
  "How would the pardon of all student loans impact wealth inequality in the U.S., in your perspective? Broad impact/Moderate impact/Little impact/No impact",
  "What do you believe would be the impact of making high-quality healthcare universally accessible on economic inequality?",
  "How much, if at all, do you think economic inequality affects political polarization? Affects significantly/Affects moderately/Affects slightly/Does not affect/Refused",
  "Do you think that the stock market growth benefits everyone equally, or does it favor the wealthy more?",
  "Do you think it is appropriate for CEOs of large companies to earn substantially more than their employees or should there be a cap on the multiplier? Without any doubt, it's appropriate/Possibly, it's appropriate/Not certain/Unlikely, it's appropriate/Definitely, it's inappropriate/Refused",
  "Which do you think is most likely to occur over the next 30 years? The national debt will Grow larger/Stay about the same/Be reduced/Be eliminated/Refused",
  "Do you agree or disagree that the level of income inequality in our country is problematic? Strongly agree/Agree/Neither agree nor disagree/Disagree/Strongly disagree/Refused.",
  "How much do you think the tech industry is influencing the economic divide? Influencing considerably/Influencing moderately/Influencing negligibly/Not influencing/Refused",
  "Do you think increasing federal funding for education would reduce economic inequality? Definitely would/Probably would/Maybe would/Probably would not/Definitely would not/Refused",
  "In your view, do you think the increasing wealth gap is having a negative or positive effect on the country? A lot negative/A little negative/Neither negative nor positive/A little positive/A lot positive/Refused",
  "How would you rate the current state of socio-economic mobility in the US, in terms of fairness? Very fair/Somewhat fair/Not very fair/Not fair at all/Refused",
  "How do you perceive the impact of immigration, both legal and illegal, on the economic disparity?",
  "Do you think privatizing public utilities would lead to more Economic efficiency/Inequality/Refused?",
  "Do you think a “Medicare for All” healthcare system would significantly address economic inequality concerns? Major effect/Moderate effect/Minor effect/No effect/Refused",
  "Discuss the role, if any, institutions should play in redistributing wealth. Should they play A significant role/A moderate role/Minor role/No role at all/Refused?",
  "Does the affordability and accessibility of quality childcare impact economic inequality in your view? Yes/No/Depends/Refused",
  "Do you believe that current corporate tax rates are excessive, unfairly low, or just right, considering the state of the economy? Excessive/Unfairly low/Just right/Refused",
  "Overall, how much has your family's financial situation when you were growing up helped or hurt your ability to get ahead? Helped a lot/Helped a little/Hurt a little/Hurt a lot/Neither helped nor hurt/Refused",
  "Contemplate on how globalization is affecting income disparity. Does it increase economic opportunities worldwide or only benefitting developed countries while exploiting developing ones?",
  "Would the implementation of Universal Basic Income (UBI) significantly help to bridge the economic inequality gap in today's society? Would greatly help/Would help to some extent/Would not make much difference/Would not make a difference at all/Refused",
  "Do you think the country's current economic conditions are helping or hurting people with college degrees? Helping a lot/Helping a little/Hurting a little/Hurting a lot/Neither helping nor hurting/Refused",
  "What are your views on the role Wall Street plays in income inequality in the United States? Substantial role/Minimal role/Partially responsible/Not at all responsible",
  "Numerous veterans and military families struggle economically. How do you suggest the government should support them to address this issue?",
  "Decipher the extent to which big tech companies monopolies aggravate income disparity in the United States. Does it exacerbate a lot/ somewhat/ slightly/ not at all?",
  "Would a governmental push for stronger labor unions contribute meaningfully to reducing economic inequality? Contributes a great deal/Contributes a little/Doesn't Contribute at all/Refused",
  "Reflecting upon the state of our environment, do you believe a Green New Deal would be beneficial to our economy? Highly beneficial/Mildly beneficial/Not beneficial at all/Refused",
  "Would creating more job opportunities in low-income areas address economic inequality effectively? Highly effectively/Moderately effectively/Least effectively/Ineffectively/Refused",
  "How much does crony capitalism, in your opinion, contribute to economic inequality? Contribute substantially/Contribute moderately/Contribute slightly/Does not contribute at all/Refused",
  "Can affordable housing and real estate policies mitigate or exacerbate economic inequality in the country? Mitigating significantly/Mitigating moderately/Exacerbating moderately/Exacerbating significantly/No significant effect/Refused",
  "Do you consider the wealth gap between the rich and the middle class as a significant concern that affects economic stability? A significant concern/A moderate concern/A minor concern/No concern at all/Refused",
  "Do you perceive that a quality public education system can serve as a catalyst in diminishing economic inequality? To a considerable degree/To some degree/To a slight degree/Not at all/Refused",
  "Do you believe raising the minimum wage could mitigate income inequality, or would it lead to job losses? Mitigate inequality/Lead to job losses/Both/Refused",
  "Do you hold that the war on drugs has escalated economic inequality within the country? Provide your insights.",
  "What role does affordable housing play in ending economic disparity, according to your understanding? Significant role/Moderate role/Minimal role/No role/Refused",
  "Looking into future financial trends, do you foresee a widening or narrowing of the wealth gap in the U.S.? Widening wealth gap/Narrowing wealth gap/No change/Refused",
  "What impact do you think offshore tax havens have on societal economic balance? Major effect/Moderate effect/Minor effect/No effect/Refused",
  "Do you think workers' unions play an important role in combatting economic disparity? Play an important role/Play a somewhat important role/Play a slightly important role/Do not play an important role/Refused",
  "How critical do you think education is in reducing economic inequality in our society? Extremely critical/Very critical/Somewhat critical/Not at all critical/Refused",
  "Do you ascribe to the belief that shrinking public sector employment and services has detrimental effects on the state of financial equality? Entirely/Somewhat/Undecided/Not at all/Refused",
  "What are your thoughts about the role of government in addressing wealth disparity? Should the government intervene a lot, somewhat, only a little, not intervene at all, or you refuse to answer?",
  "Assess the degree to which intellectual property (IP) laws add to the economic disparity in the United States. A lot/ Somewhat/ Slightly/ Not at all?",
  "Would a wealth tax on the richest segment of society have a profound impact on economic inequality? Considerably/To a fair degree/To a minor degree/Not at all/Refused",
  "Share your perspective on how access to quality education impacts economic inequality."
]