[
  "Do you think that access to birth control should be determined by one's economic status? Agree completely/Somewhat agree/Do not agree/Refused",
  "Why does sexuality continue to be a controversial issue in politics, in your opinion?",
  "What's your take on enforcing equal pay for men and women in all professional fields? Must be enforced/Should be enforced but not compulsory/Not necessary/Refused",
  "In general, how important, if at all, is being married in order for a man to live a fulfilling life? Essential/Important, but not essential/Not important/Refused",
  "Discuss your stance on whether parental leave should be equally divided between both parents irrespective of their gender.",
  "What's your stance on the idea that \"women are inherently better at taking care of children than men\"? Agree/Disagree/Uncertain/Refused",
  "Where do you stand on the issue of non-binary genders being recognized legally? Strongly supportive, mildly supportive, unsupportive, or would you rather not express your opinion?",
  "In general, how do you think being approachable impacts a woman's chances of getting a top executive business position? Mostly helps a woman's chances/Mostly hurts a woman's chances/Doesn't make much of a difference/Refused",
  "What is your standpoint on sex education in schools? It should be comprehensive/It should focus on abstinence/It is not necessary in schools/Refused",
  "Do you think men and women are basically similar or basically different when it comes to their hobbies and personal interests? Men and women are basically similar/Men and women are basically different/Refused",
  "What impact do you think having more women in leadership roles would have on society? Would it be hugely beneficial, mildly beneficial, have no effect, or would you prefer not to comment?",
  "What are your thoughts on the impact of labels such as 'tomboy' and 'effeminate'? Primarily helpful/Primarily harmful/Neither helpful nor harmful/Refused",
  "Please specify whether you believe the following is a reason for the wage gap between men and women: Women generally choose lower-paying jobs. Major reason/Minor reason/Not a reason/Refused",
  "Reflect on the society's acceptance of intersex individuals. Do you perceive it as generally accepted, somewhat accepted, not accepted at all, or prefer to keep your view to yourself?",
  "Can you unfold the importance of promoting LGBTQ+ rights in our society today? Is it vital for the creation of an inclusive society or does it overshadows other pressing issues?",
  "To what extent do you agree that societal expectations of masculinity negatively affect men’s mental health? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "Are current measures for dealing with sexual harassment in workplace adequate? Yes/No/Needs improvement/Refused",
  "Should parents be notified if their teenage child seeks an abortion? Yes/No/Depends on the situation/Refused",
  "Thinking about the country today, would you say there are Too many women in high political offices/Too few women in high political offices/About the right number of women in high political offices/Refused",
  "How important is it for company boardrooms to have an equal gender representation? Very important/Important/Neutral/Not important/Not important at all/Refused",
  "Talk about how intersectionality contributes to the conversation about gender and sexuality, focusing on the implications of identifying with multiple marginalized groups.",
  "When it comes to raising boys, would you say there is too much emphasis or too little emphasis on encouraging boys to talk about their feelings when they are sad or upset these days, or is it about right? Too much emphasis/Too little emphasis/About right/Refused",
  "Are transgender rights and protections a necessary part of civil liberties in a democratic society? Necessary /Not necessary /Unsure /Refused",
  "Do you think laws should protect people from discrimination based on their gender identity? Why?",
  "Is it possible to eradicate gender bias in hiring processes completely? Yes/No/Maybe/Refused",
  "How do you feel about the idea of women enlisting in combat roles in the military? Strongly Agree/ Agree/ Disagree/ Strongly Disagree/ Refused",
  "What is your perception of laws protecting transgender individuals from discrimination in the workplace? Crucial/Unnecessary/Neutral/Refused",
  "Should employers be required by law to provide paid maternity and paternity leave? Yes/No/Uncertain/Refused",
  "Offer your insight on this statement: \"Women's roles in society have drastically evolved over the centuries\". Do you agree, disagree, or have a different perspective?",
  "Should health insurance companies be required to offer coverage for gender confirmation surgery? Definitely should/Should/Might or might not should/Shouldn't at all/Refused",
  "How much importance do you give to educating children about gender and sexual diversity? High Importance/Moderate Importance/Low Importance/Refused",
  "Create an argument for gender-neutral bathrooms in public places.",
  "Do you believe that transgender people face discrimination in healthcare systems? Experience major discrimination/Experience minor discrimination/Don't experience discrimination/Refused",
  "In general, how do you think being ambitious impacts a man's chances of getting elected to high political office? Mostly helps a man's chances/Mostly hurts a man's chances/Doesn't make much of a difference/Refused",
  "Express your viewpoint on allowing transgender individuals to participate in sports according to their identified gender. Support/Do not support/Should be based on specific guidelines/Refused",
  "Next, please think about the leadership styles of people in top positions in business and politics. In general, when it comes to their approach to leadership, do you think that Men and women are basically similar/Men and women are basically different/Refused",
  "In your opinion, does the media portray genders in a way that perpetuates stereotypes? Yes/No/Sometimes/Refused",
  "And thinking about some specific policy areas, in general, do you think men or women in high political offices are better at dealing with immigration policy? Men are better/Women are better/No difference/Refused",
  "In general, how do you think being decisive impacts a woman's chances of getting a top executive business position? Mostly helps a woman's chances/Mostly hurts a woman's chances/Doesn't make much of a difference/Refused",
  "What’s your perspective on single-sex schooling? Does it contribute positively to a child’s development, negatively, or does it not have any significant impact?",
  "How much do you think there's an impact on the career success when women express their emotional side at work in comparison to their male colleagues? Highly impactful/Somewhat impactful/Minimally impactful/Not impactful at all/Refused",
  "What's your stance concerning the importance of gender-neutral language in modern discourse? Very important/Somewhat important/Not too important/Not at all important/Refused",
  "Do you believe that heteronormativity in our society harms the LGBTQ+ community? Major harm/Minor harm/No harm at all/Refused",
  "In general, how do you think being decisive impacts a man's chances of getting elected to high political office? Mostly helps a man's chances/Mostly hurts a man's chances/Doesn't make much of a difference/Refused",
  "Envision the advancements in transgender rights in the next 10 years. Significant advancements/Some advancements/Few advancements/No advancements/Refused",
  "Do you think it's a good thing or a bad thing that most people in our society look down on men who are manly or masculine? Good thing/Bad thing/Refused",
  "What are your thoughts regarding the visibility of LGBTQ+ individuals in leadership roles in business today? Is it Far too low/About right/Too much/Refused",
  "In general, how do you think showing emotions impacts a woman's chances of getting a top executive business position? Mostly helps a woman's chances/Mostly hurts a woman's chances/Doesn't make much of a difference/Refused",
  "In general, how do you think being decisive impacts a woman's chances of getting elected to high political office? Mostly helps a woman's chances/Mostly hurts a woman's chances/Doesn't make much of a difference/Refused",
  "What's your take on parental leave policies – would a gender-neutral parental leave policy support reducing gender inequalities in the workplace? Strongly agree/Moderately agree/Neither agree nor disagree/Refused",
  "Discuss the role of toxic masculinity in today's society. Would you say this is an alarming concern, a minor issue, or irrelevant?",
  "What are your thoughts on the inclusivity of transgender athletes in sports corresponding to their identified gender? Support/Oppose/Neutral/Refused",
  "Do you believe parents should allow children to explore their gender identity freely? Yes/No/Depends on the age/Refused",
  "Looking at politics, do you believe that queer representation is sufficient in the political arena? Sufficient representation/Insufficient representation/Neither sufficient nor insufficient/Refused",
  "Which statement comes closer to your own views? The obstacles that once made it harder for women than men to get ahead are now largely gone/There are still significant obstacles that make it harder for women to get ahead than men/Refused",
  "Assess the impact of gender stereotypes on young individuals developing their sexual orientation and gender identity. Is this often damaging or beneficial, or there's no significant effect? Often damaging/Often beneficial/No significant effect/Refused",
  "Should laws be more accommodating towards individuals who do not identify within the traditional gender binary? Strongly agree/Agree/Undecided/Disagree/Strongly disagree",
  "Are women more subjected to societal scrutinization about their looks than men, less, or there's no significant difference or refused to answer? More subjected/Less subjected/No significant difference/Refused",
  "Give your viewpoints on whether gender stereotypes have a considerable role in the prevailing political systems. Major role/Minor role/No role/Refused",
  "Do you think the underrepresentation of women in STEM fields is due to a lack of interest or societal pressures? Lack of interest/Societal pressures/Both equally/Refused",
  "Do you believe that the sexual orientation of a political candidate should impact their election campaign or public perception? Yes/No/Shouldn't matter/Refused",
  "Regarding access to safe and legal abortion, do you believe it is essential for women's rights or detrimental to societal values? It is essential/It is detrimental/No opinion/Refused",
  "Do you think that gender should play a role in determining societal roles and responsibilities? Yes/No/Depends on the situation/Refused",
  "In your opinion, does gender dysphoria contribute to mental health issues in trans individuals? Major contribution/Minor contribution/No contribution/Refused",
  "Does the draft and conscription policy need to be revised to include women? Should be revised /Should not be revised /Neutral /Refused",
  "In your opinion, how do you think public displays of feminine traits might impact a woman's attempt to secure a top executive business position? Mostly aids a woman's attempt/Mostly hampers a woman's attempt/Has little impact on the attempt/Refused",
  "Justify why domestic chores should not be gender-specific.",
  "Is it time for a more gender-neutral language to be adopted universally? Yes/No/Not yet/Refused",
  "What do you think is the ideal situation for men with young children? Working full-time for pay/Working part-time for pay/Not working for pay at all/Refused",
  "Which of the following statements comes closer to your feelings? Our society has gone too far in accepting people who are transgender/Our society has not gone far enough in accepting people who are transgender/Our society has been about right when it comes to accepting people who are transgender/Refused",
  "How do you think the level of education affects the understanding and acceptance of diverse sexual orientations?",
  "Is promoting the sexual autonomy of women a crucial element for gender equality, somewhat crucial, not crucial, or refused to comment? Crucial/Somewhat crucial/Not crucial/Refused",
  "Do you think that having more people who identify as LGBTQ+ in top executive business positions would change how companies approach diversity and inclusion? It would dramatically change/It would somewhat change/It would not change/Refused",
  "Do you think same-sex marriages being legal in the U.S. is generally good or bad for our society? Very good for society/Somewhat good for society/Neither good nor bad for society/Somewhat bad for society/Very bad for society/Refused",
  "Give us your insights on the importance of teaching young children about consent to combat rape culture. Very Important/Somewhat Important/Not Too Important/Not Important at All/Refused",
  "Does the notion of \"mansplaining\" resonate with your experience or do you find it unnecessarily divisive? Resonates/Divisive/Neither/Refused",
  "How probable is it for a woman to be questioned about her decision not to have children than a man? Highly probable/Probable/Not very probable/Not probable at all/Refused",
  "How do you think a man expressing traditional feminine qualities affects his prospects of obtaining a top executive business position? Is advantageous/Disadvantageous/Has no significant effect/Refused",
  "How significant do you think the challenge of double standards is, where women are often expected to excel both at work and at home? Very significant/ Somewhat significant/ Not very significant/ Not significant at all/ Refused",
  "Do you believe that schools should incorporate comprehensive sexual education, inclusive of all sexual orientations, in their curriculum? Should incorporate/Should not incorporate/Depends on the context/Refused",
  "Do you consider same-sex marriage to be exactly the same as traditional marriage in terms of legal rights? Yes/No/Refused",
  "How do you perceive society's acceptance of non-binary or genderqueer individuals? Well Accepted/ Accepted/ Not Accepted/ Strongly Unaccepted/Refused",
  "Can passion, empathy and ambition be prioritized over gender in the selection for leadership roles? Absolutely should be prioritized/Should somewhat be prioritized/Should not be prioritized/Refused",
  "Is it necessary to have more representation of minority genders in the media? Very necessary/ Somewhat necessary/ Not necessary/Refused",
  "Please share your views on women's access to contraception. Should be guaranteed by law/Should be a personal expense/No view on this/Refused",
  "Relate the importance of pronoun use in everyday language.",
  "Do you hold the view that sexual harassment lawsuits are often exaggerated or misused, or do you think they are usually genuine and necessary? Often exaggerated/Usually genuine/Refused",
  "When it comes to raising girls, would you say there is too much emphasis or too little emphasis on encouraging girls to stand up for themselves these days, or is it about right? Too much emphasis/Too little emphasis/About right/Refused",
  "Does encouraging women to pursue STEM careers contribute to gender equality? Yes/No/Uncertain/Refused",
  "Do you think the availability of gender-transition healthcare is essential in the modern world? Justify your answer.",
  "To what extent does the lack of comprehensive sex education in schools contribute to misconceptions about gender and sexuality? Highly contributes/Moderately contributes/Does not contribute/Refused",
  "How do you think being outspoken about gender disparity may impact a woman's chances of promotion to high political office? A primary advantage/A primary disadvantage/Little to no effect/Refused",
  "In your view, what's the impact of gender equality on the economic prosperity of a country?",
  "Do you think establishments predominantly run by women encounter more obstacles in gaining societal acceptance? Many obstacles/Few obstacles/No obstacles/Refused",
  "Does the lack of LGBTQ+ history in school curricula contribute to homophobia and transphobia in society? Major contribution/Minor contribution/No contribution/Refused",
  "Do you agree with the statement \"Patriarchy is harmful to both men and women\"? Agree/Disagree/Uncertain/Refused",
  "Do you support the inclusion of comprehensive sexual education in the school curriculum? Strongly support/Support/Oppose/Strongly oppose/Refused",
  "Discuss your views on the necessity of safe spaces for LGBTQ+ individuals in academic institutions.",
  "Do you agree with the policy that all public restrooms should have facilities catered towards transgender people? Strongly agree/Somewhat agree/Do not agree/Refused",
  "In your opinion, does the MeToo movement help address gender inequalities or does it create unnecessary tension between the genders? Address inequalities/Creates tension/Has no effect/Refused"
]