[
  "Ponder on mandatory detention for all illegal border crossers. Where do you place it on the priority list for immigration enforcement? Top of the list/Middle of the list/End of the list/Not on the list",
  "Describe the potential benefits and drawbacks of implementing a merit-based immigration system.",
  "Would you advocate for programs that promote cultural assimilation of immigrants? Yes/No/No opinion",
  "In order to foster a sense of inclusivity, does the U.S. need to loosen or tighten the current immigration policies? Loosen Significantly, Loosen Somewhat, Maintain Current Level, Tighten Somewhat, Tighten Significantly",
  "Do you think undocumented workers should be given a path to legalize their status if they pay taxes, learn English, and have an otherwise clean criminal record? Yes/No/Depends on circumstances/Refused",
  "Considering the current political climate, do you think the United States should Increase/Decrease/Maintain at current levels/Refuse the amount of refugees it admits from conflict zones?",
  "How crucial is proficiency in English for immigrants seeking citizenship, in your opinion? Is it integral, somewhat important, not very important, or unimportant?",
  "Considering the current state of affairs, would you say that the Dream Act is necessary for the future prosperity of the United States?",
  "Reflecting on the matter of immigration, how important do you believe the need for a comprehensive reform on existing immigration policies should be? Critical, extremely important, moderately important, mildly important, not important",
  "Should states have the power to enforce immigration laws or should this be solely a federal responsibility?",
  "In your opinion, are the existing immigration laws and policies of the country adequate and fair, or do they need a complete overhaul?",
  "Justify if citizenship should be automatically granted to children born in the United States to unauthorized immigrant parents.",
  "Assess whether immigrants who have served in the U.S. military should be given some preference in becoming U.S. citizens.",
  "Do you think that immigration reform should include stricter penalties for businesses that knowingly hire undocumented workers? Should it be of paramount importance, considered important, marginally important, or not important at all?",
  "Should usage of the English language be a required criterion for immigration? Underline your viewpoints with concrete reasons.",
  "Should the U.S. accept a more significant number of refugees? Highly Favorable, Moderately Favorable, Neutral, Moderately Unfavorable, Highly Unfavorable",
  "Can you discuss how immigration can shape our relations with countries around the world?",
  "Do you back up the notion of giving a path to citizenship to illegal immigrants who have resided in the US for many years and have established families? Strongly endorse, mildly endorse, mildly oppose, or strongly oppose?",
  "How would you rate the contribution of immigrants to the United States' cultural diversity? Exceptional, very high, high, moderate, low",
  "Please share your thoughts on the impact of immigrants on U.S cultural diversity. Do they contribute greatly, contribute moderately, contribute a bit, do not contribute, or detract?",
  "What is your opinion on the idea that the government should offer temporary visas for agricultural work, especially in regions with seasonal crops?",
  "Do family ties of immigrants already living in the US significantly affect their relatives' immigration process, in your view? Should they have an upper hand? Yes, No, or Maybe?",
  "Construct an argument on whether sanctuary cities, that limit cooperation with the national government's effort to enforce immigration law, protect or endanger their residents?",
  "In your opinion, should the country prioritize family-based immigration policies or switch to a more skills-based admission system? Share your perspective along with reasoning.",
  "In terms of economic contribution, how do you value the role of immigrant entrepreneurs in the United States? Highly valuable/Valuable/Little value/No value at all/Refused",
  "Thinking about the issue of immigration, how important of a goal should Increasing security a long the United States-Mexico border to reduce illegal crossings be for immigration policy in the United States? Very important, somewhat important, not too important, not at all important",
  "Considering the issue of undocumented immigrants, how much emphasis should be given to workplace enforcement to reduce illegal hiring? A ton, some, very little, none at all, refused.",
  "Do you consider the act of providing sanctuary cities to undocumented immigrants in the U.S as ethical? Highly Ethical, Moderately Ethical, Neither Ethical nor Unethical, Moderately Unethical, Highly Unethical",
  "Would you consider it justifiable to separate immigrant families at the border as a deterrent for illegal immigration?",
  "Do you think that immigrants, whether legal or illegal, are more likely to be law-abiding citizens/More likely to get involved in criminal activity/Neither of these/Refused",
  "How important would you say it is for the United States to erect a physical barrier, like a wall, on its southern border to prevent illegal border crossings?",
  "What importance would you attribute to English language proficiency among immigrants? Is it Essential, Very important, Moderately important, Not so Important, Not at all important?",
  "How important do you think it is to provide a path to citizenship for DACA recipients, often referred to as Dreamers? Please explain why.",
  "Is the current allocation of H-1B visas sufficient or should it be increased? Please, provide a well thought out response.",
  "How much common ground is there between the policy positions of Republicans and Democrats in Washington on Immigration issues? ",
  "Concerning refugee policies, should the US government increase its refugee quota, maintain its current level, reduce the quota, or eliminate it entirely?",
  "Consider the potential economic impact. How crucial is it to grant more work visas to immigrants? Extremely crucial/ Fairly crucial/Not too crucial/Not at all crucial/Refused",
  "Imagine you are advising the president on immigration policy. What factors would you highlight as crucial to consider in this context?",
  "Is the idea of building a border wall to prevent illegal immigration practical/rational, or is it a reactionary measure that won't solve the issue at its root? Practical and rational/Reactionary and won't solve root issues/Neither/Both/Refused",
  "How important, in your opinion, are the English language requirements set for legal immigrants? Is this an efficient tool for integrating immigrants into the American society or does it hinder the migration process unnecessarily?",
  "What actions should be taken for children that were brought to the United States illegally by their parents? Provide your perspective.",
  "Do you affirm the idea that by tightening our immigration laws and border security, the U.S will see a decrease in crime rate/A spike in crime rate/No significant change in crime rate/Refused",
  "Concerning the concept of building a border wall, do you agree it is an Effective/Ineffective/Not completely effective nor ineffective/Unnecessary/Refused solution to curbing illegal immigration?",
  "What are your thoughts on the impact of the refugee resettlement program on local communities? Is it beneficial, neutral, detrimental or you are unsure?",
  "Share your perspective on English language requirements for immigrants. Should proficiency be a crucial determinant of citizenship or is it a form of discrimination?",
  "Do you think that Immigration reform should be a top priority for the U.S. government in the coming years?",
  "Explain your outlook towards tightening or relaxing visa rules for immigrants.",
  "In your view, should the federal government decrease funding for detention centers that house illegal migrants? Provide a rationale for your view.",
  "How vital do you think immigrants are to the U.S economy? Are they crucial contributors, insignificant players, or do they pose a burden?",
  "State your view on this: Immigrants, regardless of their legal status, increase the country's crime rates/Decrease the country's crime rates/Have no effect on crime rates/Refused",
  "Do you think there is a correlation between levels of immigration and crime rates in United States?",
  "What is your stance on the federal government's role in intervening to achieve comprehensive immigration reform, minimal, significant or redundant?",
  "What is your opinion on expanding the Visa Lottery that randomly awards green cards to individuals from countries with low immigration rates to the U.S.? Expand/Maintain current level/Reduce/Eliminate/Refused",
  "What do you think about immigrants being able to start their own businesses? Encourage/Discourage/Neutral",
  "Should the government take stricter action to prevent employers from hiring illegal immigrants? Definitely, probably, don't know, probably not, or definitely not?",
  "How necessary do you believe it is to construct a physical barrier along the border to curb immigration, and what alternatives would you suggest?",
  "Do you think that English proficiency should be a requirement for gaining citizenship? It should be absolutely necessary, somewhat necessary, not very relevant, or totally irrelevant?",
  "Ponder the current political spectrum - where does your stance fit in terms of US immigration policy? Is it more liberal, centrist, conservative, or non-partisan?",
  "Express your views on the revocation of the Deferred Action for Childhood Arrivals (DACA) policy. Support/Oppose/Neutral/Refused",
  "What's your take on this: Strengthening the legal rights of undocumented immigrants - Strongly agree, somewhat agree, neutral, somewhat disagree, strongly disagree.",
  "Would you support more stringent procedures and background checks for immigrants trying to enter the country legally? Yes/No/Undecided",
  "Regarding the issue of immigration, is it crucial for authorities to provide sanctuary to refugees and asylum seekers? Absolutely necessary, somewhat necessary, moderately necessary, not at all necessary",
  "Is birthright citizenship, whereby any child born on U.S. soil is granted citizenship, a policy you would support or not?",
  "What is your stance on the Temporary Protected Status (TPS) offered to certain immigrants who cannot return to their countries due to natural disasters or political unrest?",
  "Do you believe immigration policies should prioritize family reunification or skills and employment-based criteria? Family reunification/ Skills and employment-based/Equal priority/Refused",
  "Would increasing the intake of skilled migrants be more beneficial for the U.S. economy as compared to unskilled migrants?",
  "In your opinion, should the 'Dreamers' be granted citizenship or be deported? Please include the reasons for your stance.",
  "How do you perceive the contribution of immigrants to the American economy? Are they a drain or boost, in your opinion?",
  "Should the U.S. government play more of a role in assisting immigrants with the naturalization process?",
  "What's your perspective on restrictions imposed on legal immigration based on national security concerns? Would you rank it extremely justified, moderately justifiable, somehow unnecessary, or completely unjust?",
  "Do you believe refugees should go through a stricter vetting process than other immigrants? Yes/No/Same standard for everyone",
  "Do you trust that the U.S should adopt a more open immigration policy? Certainly should, Rather should, Neutral, Rather should not, Certainly should not.",
  "Do you think DACA (Deferred Action for Childhood Arrivals) is a fair policy? Yes/No/Somewhat/Not sure/Refused.",
  "In your opinion, should the U.S. government deport all immigrants who are living in the country illegally or should it develop a path to citizenship for them? Give a comprehensive response.",
  "How do you feel about asylum seekers included in immigration regulations? Do you believe they should be incorporated as a humanitarian act or handled separately because they pose different issues?",
  "Mull over the condition that everyone who enters the country illegally should be deported regardless of their circumstances. Do you favor this viewpoint? Strongly agree, Mildly agree, Uncertain, Mildly disagree, Strongly disagree.",
  "If you were deciding what the federal government should do to improve the quality of life for future generations, what priority would you give to who come here legally? Allowing more immigrants into the U.S. A top priority/An important, but not a top priority/A lower priority/Should not be done/Refused",
  "If you were to advise the current administration, how much of a crackdown should there be on employers who hire illegal immigrants? A great extent/A good amount/A little/Not at all/Refused",
  "In terms of humanitarian priorities, how do you rank providing aid to refugees as part of U.S immigration policy? Top priority/Some priority/Low priority/No priority/Refused",
  "Offer your position on requiring immigrants to learn English as a mandatory criterion for gaining residency or citizenship?",
  "What's your stand on providing subsidized healthcare services in the U.S. to unauthorized immigrants? Strongly support/Support/Neutral/Oppose/Strongly oppose/Refused",
  "As nations, we coexist globally. In your view, do you consider adopting open borders to all immigrants as a beneficial strategy or a potential threat? A potential benefit to the ecosystem/A potential threat to security/Neutral stance/Refused.",
  "Explain your stance on this proposition: The U.S. should adopt a merit-based immigration system, prioritizing immigrants who can offer particular skills or demonstrate advanced education.",
  "Between the two, which do you see as more beneficial: encouraging high-skilled immigration or promoting family reunification?",
  "How would you evaluate the impact of undocumented immigrants on public resources? A strain on resources/Contributors to the system/Minimal impact/Refused.",
  "Do you believe stringent immigration laws negatively or positively impact the U.S’s international reputation? Positively, neutral, negatively, I don't know.",
  "Imagine having a decisive say in foreign policy matters. Would you advocate for the deportation of undocumented immigrants with criminal records?",
  "How much significance does the topic of immigration carry when you are choosing political candidates to support? Is it a critical issue for you, or do you prioritize other matters?",
  "Reflecting on your political views, how important is the role of immigration in shaping the nation’s cultural diversity to you? Very important, somewhat important, not very important, or not at all important?",
  "What's your opinion on prioritizing immigrants with higher education and those who can contribute economically over others? Is it highly necessary, somewhat important, slightly irrelevant, or highly unfair?",
  "Think about the United States’ practice of birthright citizenship, where anyone born in the country is automatically granted citizenship. Should this policy continue, be modified, or entirely abolished?",
  "Immigrants often hold essential, low-wage jobs. Do you see that as societal exploitation or proof that they take jobs natives won’t do?",
  "Do you think the enforcement of stricter immigration laws will primarily lead to increased safety for citizens, or do you think it might cause further division and hostility?",
  "What do you think about the U.S. government's policy of separating children from their parents at the border? Do you find it highly unacceptable, somewhat acceptable as an immigration deterrent, necessary to enforce immigration laws, or no comment?",
  "Outline the potential effects on the economy if a pathway to citizenship for undocumented immigrants was offered. Would it help stimulate growth, cause an economic downturn, or have no significant impact?",
  "Where do you stand on the policy of separating children from their parents if their families are caught crossing the border illegally?",
  "Do you perceive chain immigration as a process that keeps families together or a practice that should be limited to facilitate assimilation? Keeps families together/Should be limited to facilitate assimilation/Neither/Both/Refused",
  "To what extent should immigrants be expected to assimilate into American culture as a condition of citizenship?",
  "If given authority, how would you ensure that the immigration system supports U.S. businesses while protecting the rights and conditions of all workers?",
  "Imagine the potential conflict between national security and the rights of immigrants. In addressing this, should the federal government lean more toward national security or protecting the rights of immigrants? Lean more toward national security/Lean more toward protecting immigrants' rights/Balance equally between both/Refused"
]