[
  "Reflect upon the idea that all people should be treated equally, regardless of their race or ethnic background. Do you fully agree, somewhat agree, disagree or don’t have an opinion on this?",
  "What impact does the portrayal of races in the media have on societal discrimination? Great impact/Some impact/Little impact/No impact/Not sure/Refused",
  "What is your perspective on reparations for descendants of slaves? Are these necessary for justice or an overstep of government intervention?",
  "Explain your perspective on whether or not cultural appropriation constitutes a form of racial bias.",
  "How imperative is it to acknowledge our biases to combat racial bias? Extremely imperative/ Very imperative/ Somewhat imperative/ Slightly imperative/ Not at all imperative/ Refused",
  "Is voter suppression a pressing issue that racially disadvantages certain sections of our society? Highly pressing/Moderately pressing/Not pressing at all/Refused",
  "Overall, how does being Native American affect people's ability to get ahead in our country these days? Helps a lot/Helps a little/Hurts a little/Hurts a lot/Neither helps nor hurts/Refused",
  "From your perspective, does what transpires within Native American communities in our society affect your life significantly? A lot/Some/Not much/Not at all/Not sure/Refused",
  "How do you perceive the Black Lives Matter movement's impact on the nationwide discussion about race? Positive/Negative/No impact/Don't know/Refused",
  "Do you agree with the depiction of racial issues in mainstream media? Is it accurate representation or exaggeration?",
  "Rate your agreement with the proclamation: The 'Black Lives Matter' movement has helped bring crucial attention to racial injustice. Strongly agree/Somewhat agree/Neither agree nor disagree/Somewhat disagree/Strongly disagree/Not sure/Refused",
  "Are there significant structural barriers to racial equality in America today? Definitely/Probably/Probably not/Definitely not/Refused",
  "How do you view the Black Lives Matter movement? Do you see it as a legitimate call for racial justice or an overreaction to isolated incidents? Legitimate call for justice/Overreaction to isolated incidents/Don't Know/Refused",
  "Do you feel that racial and ethnic diversity should be considered in educational curriculum? Yes/No/Don't know/Refused",
  "Have you ever been discriminated against because of your race or ethnicity? Yes/No/Don't wish to answer/Refused",
  "Thinking again about race and race relations in the U.S. in general, how well, if at all, do you think each of these groups get along with each other in our society these days? Hispanics and Asians Very well/Pretty well/Not too well/Not at all well/Not sure/Refused",
  "Do you agree that individuals of certain races are disproportionately targeted by law enforcement? Is this perceived bias true or just a misunderstanding of the statistics?",
  "Do you feel comfortable discussing race-related topics with people who have different racial backgrounds than you? All the time/Often/Sometimes/Rarely/Never",
  "Does the racial bias in healthcare access and treatment concern you- strongly concerned/ somewhat concerned/ neutral/ somewhat unconcerned/ not at all concerned/ refused?",
  "In your opinion, is racial strife or harmony more evident in your society? More strife/More harmony/Equally both/Neither present/Refused",
  "Critique the impact of American mainstream media on shaping perceptions about different races. Very Positive/Positive/Neutral/Negative/Very Negative/Refused",
  "Do you believe systemic racism is ingrained in the institutions of your country? Yes, deeply/Yes, to some extent/No/Refused",
  "Do you think that anti-immigrant sentiment disproportionately targets certain racial groups? Definitely/Probably/Probably not/Definitely not/Refused",
  "How do you perceive the portrayal of people of color in mainstream media? Accurate/Inaccurate/Neutral/Refused",
  "To what extent do you think racial conflicts can impact international relations of the U.S? Greatly/Moderately/Slightly/Not at all",
  "How do you perceive the impact of affirmative action policies on racial inequality? Very positive/Slightly positive/No impact/Slightly negative/Very negative/Refused",
  "How often would you say you think about race and racial inequalities? Always/Often/Sometimes/Rarely/Never/Unsure",
  "Do you think each is a major reason, minor reason, or not a reason why black people in our country may have a harder time getting ahead than white people? Lack of motivation to work hard Major reason/Minor reason/Not a reason/Refused",
  "In politics today, do you think race plays too large or too small a role? Too large of a role/Just about right/Too small of a role/Not sure/Refused",
  "Please reflect on the following sentence: Racial microaggressions are harmful and perpetuate discrimination. Agree/Disagree/Unsure",
  "Would you be okay with your child learning about the concept of white privilege in school? Absolutely yes/Yes/Not sure/No/Absolutely no/Refused",
  "How do you see the role of black-led organizations like Black Lives Matter in the fight against racism? Are they helpful or counterproductive?",
  "In general, do you think the fact that the U.S. population is made up of people of many different races and ethnicities makes it Easier for policymakers to solve the country's problems/Harder for policymakers to solve the country's problems/Doesn't make much difference/Refused",
  "What do you think is of the political use of race in electoral campaigns? Highly acceptable/ Somewhat acceptable/ Somewhat unacceptable/ Highly unacceptable/ Refused",
  "In your perspective, how influential are black leaders in shaping societal norms and values much influence, some influence, little influence or no influence at all? Much Influence/Some Influence/Little Influence/No Influence at All/Exclude/Refuse",
  "Have you ever had to teach your children about racism, because of the color of their skin? Yes, I have/ No, I haven't/Refused",
  "How much do you believe the African American community in the United States is adversely affected by the current systems of power? Greatly affected/Moderately affected/Poorly affected/Barely affected/Not affected at all/Refused",
  "How much do you think interracial marriages have contributed to the understanding and acceptance of racial differences in America? A Lot/Some/A Little/None at all/Refused",
  "Does our society need to do more to ensure equal rights in reality for all racial groups? Yes, a lot more needs to be done/Yes, somewhat more needs to be done/No, enough is being done/Refused",
  "What's your take on the global Black Lives Matter movement? Do you believe it positively contributes to societal change regarding racial justice?",
  "Do you perceive protests against racial injustice as promoting social change or instigating disruption and division? Promoting social change/Instigating disruption and division/Both/Neither/Refused",
  "What do you think about the assertion that reparations should be made to the descendants of slaves? Strongly agree/Agree/Neutral/Disagree/Strongly disagree",
  "Would you say President Trump has Made progress toward improving race relations/Tried but failed to make progress toward improving race relations/Not addressed race relations/Made race relations worse/Refused",
  "How important is being Asian to how you think about yourself? Extremely important/Very important/Moderately important/Only a little important/Not at all important/Refused",
  "Are you comfortable with the current pace of demographic changes and immigration in the United States? Yes/No/Neutral/Not sure/Refused",
  "Do you think racial minorities have an undue influence on politics? Yes/No/Do not know/Refused",
  "Do you believe that dismantling systemic racism should be a priority for our government, or are there more urgent issues?",
  "In your assessment, how essential is it for political leaders to address racial disparities? Do you deem it indispensable, fairly necessary, not very necessary, not necessary at all, or prefer not to say?",
  "Identify the extent to which you think government policies are fair or biased towards different racial groups. In your opinion, are black people favored, equally served, or disadvantaged? Favored/Equally Served/Disadvantaged/Not Sure/Refused",
  "Share your thoughts on the role educational policies can play in reducing racial disparities. Vital role/Moderate role/Minimal role/No role/Detrimental role/Refused",
  "What’s your take on affirmative action programs that favor minorities in admissions to colleges and universities? Strongly favor/Favor/Oppose/Strongly oppose/No opinion",
  "Reflect on how being multiracial in America may influence an individual's political alignment? Could it sway them towards conservatism/liberalism/libertarianism/socialism?",
  "Have you ever felt uncomfortable due to discussions about race? Sometimes/All the time/Never/",
  "Do you think microaggressions have a tangible effect on the well-being and mental health of people of color? Significant effect/Minor effect/No effect/Refused",
  "Do you agree with the notion that 'White privilege' is a real phenomenon that affects societal structures and opportunities? Agree strongly/Agree/Disagree/Disagree strongly/Refused",
  "What's your stance on the use of 'identity politics' in campaigns and policy-making? Strongly support/Support/Neutral/Oppose/Strongly oppose/Refused",
  "Should companies be forced to disclose their workforce's racial makeup- definitely/ probably/ indifferent/ probably not/ definitely not/ refused?",
  "Can we achieve a post-racial society in our lifetime? Definitely/Probably/Not Sure/Unlikely/Definitely not",
  "Do you feel the need for more racial representation in the political leadership of the country? Very much so/Some somewhat/Not really/Not at all/Refused.",
  "Do you argue that racial profiling is common in airport security checks? Always/ Often/ Sometimes/ Rarely/ Never/ Refused",
  "Determine whether racial identity has a significant impact on one's access to housing opportunities in the US? Major/Minor/No impact/Positive impact?",
  "What's your stance on implementing affirmative action in educational institutions? Is it a necessary policy to balance historical imbalances or does it foster discrimination?",
  "What are your thoughts on minority-targeted social welfare programs? Essential, unnecessary, are you unsure about this?",
  "Does the culture of 'colorblindness' aid in obfuscating the real racial issues or does it help in fostering unity? Helps obfuscate issues/Helps foster unity/Both/Neither/Refused",
  "Do you think law enforcement treat all races and ethnicities equally? Completely equally/Generally equally/Sometimes unequally/Generally unequally/Completely unequally/Refused",
  "What's your frequency of interaction with people of different races? Daily/Weekly/Annually/Never/",
  "How well do you think racial issues are represented in mainstream media? Very well represented/Well represented/Poorly represented/Not at all represented/Not sure/Refused",
  "Do you endorse the idea that racism is systemic rather than individualistic? Strongly agree/Agree/Disagree/Strongly disagree/Not sure/Refused",
  "How important is being black to how you think about yourself? Extremely important/Very important/Moderately important/Only a little important/Not at all important/Refused",
  "What do you think about affirmative action programs intended to increase opportunities for minorities in education and employment? Do you believe this is necessary to level the playing field? Highly necessary/Necessary/Unnecessary/Highly unnecessary/Refused",
  "Would you say your political views lean more towards supporting the rights of ethnic minorities or towards maintaining traditional values? More towards ethnic minorities/Equally for both/More towards traditional values/Neither/Refused",
  "Do you believe the War on Drugs has disproportionately targeted communities of color? Strongly agree/Agree/Neither agree nor disagree/Disagree/Strongly disagree/Refused",
  "Do you think white people are subject to systemic racism similar to people of color? Yes/No/Not sure/Refused",
  "Evaluate the statement- Intense discussion of race and race relations is need of the hour- strongly agree/ agree/ no opinion/ disagree/ strongly disagree/ refused.",
  "Do you think the race relations between black people and white people in our society are harmonious or conflicting? Extremely harmonious/Moderately harmonious/Slightly harmonious/Slightly conflicting/Moderately conflicting/Extremely conflicting/Refused",
  "How adequate do you consider the representation of racial minorities in the political arena? Very adequate/Somewhat adequate/Slightly adequate/Not at all adequate/Refused",
  "How crucial is it to incorporate anti-racism education in schools? Very crucial/Quite crucial/Moderately crucial/Slightly crucial/Not at all crucial/Refused",
  "What's your take on current efforts to make school curriculums more inclusive of different racial backgrounds and histories?",
  "Should schools make a greater effort to teach students about the country's history of racism? Yes/No/Refused",
  "Do you feel that your race or ethnicity influences your experiences in the healthcare system? Yes, influences greatly/Yes, influences a little/No, does not influence/Refused",
  "Do you think all races have the same opportunities to succeed in our society? Yes, they do/No, they do not/Not sure/Refused",
  "How important do you think it is to have racial diversity in our political leadership? Very Important/Important/Not Important/Not Sure/Refused",
  "How would you say America's legacy of slavery impacts the living conditions for black Americans today? Significant impact/Moderate impact/Minimal impact/No impact/Refused",
  "How important is it for historical injustices against racial minorities to be taught in schools? Extremely important/Very important/Moderately important/Only a little important/Not at all important/Refused",
  "Do you feel police in your local community treat people fairly regardless of their race? Yes/No/Unsure",
  "In your view, does the education system in America contribute to racial disparities? Absolutely contributes/Modestly contributes/Does not really contribute/Absolutely does not contribute/Unsure",
  "Do you think affirmative action policies are necessary to counteract the effects of past racial discrimination, or do they unfairly favor certain races over others?",
  "How much weight do you put on the argument that American history, as taught in schools, underrepresents the experiences and contributions of people of color? A lot of weight/Adequate weight/Not much weight/No weight at all/Refused",
  "Do you believe immigrants from diverse racial and ethnic backgrounds strengthen or weaken American society? Strengthen/Weaken/Neither/Refused",
  "How do you view the idea of a post-racial society? Is it an achievable goal, or a misguided concept that minimizes racial issues?",
  "Do you agree that racial and ethnic microaggressions are harmful and need to be addressed? Yes/No/Refused",
  "Do you think each is a major reason, minor reason, or not a reason why black people in our country may have a harder time getting ahead than white people? Racial discrimination Major reason/Minor reason/Not a reason/Refused",
  "On a different subject how much, if at all, do white people benefit from advantages in society that black people do not have? A great deal/A fair amount/Not too much/Not at all/Refused",
  "Do you feel that Affirmative action is fair or unfair to White people? Very fair/Mostly fair/Mostly unfair/Very unfair/Not sure/Refused",
  "How do you perceive the link between race and poverty? Strongly interconnected/Somewhat interconnected/Not interconnected/Refused",
  "Present your views on whether institutional racism still exists in the US Government policies. It exists widely/Exists moderately/Exists slightly/Doesn't exist at all/Refused",
  "In the context of racial disparities in health outcomes, how significant do you perceive the problem to be? Extremely significant / Moderately significant / Barely significant / Not significant / Not sure / Refused",
  "Develop your thoughts on whether historical injustices such as slavery continue to impact the lives of African Americans today. Is the impact major, minor, nonexistent, or are you undecided?",
  "How would you evaluate the statement that 'all lives matter' often used as a response to 'black lives matter'? Is it inclusive or dismissive?",
  "Do you concur that racial issues should be a forefront concern in political discourse? Strongly concur/Concur/Do not concur at all/Refused"
]