[
  "Do you think stringent regulations on pharmaceutical companies indirectly hurt consumers by inhibiting medical innovation?",
  "When you hear that a science practitioner has received financial incentives from an industry group related to their work, does this make you Trust the recommendation more/Trust the recommendation less/Makes no difference either way/Refused",
  "When confronted with statistics on global warming, do you tend to trust the data or question its accuracy? Trust/Question/Unsure/Refused",
  "Should the government impose restrictive measures on meat consumption to reduce greenhouse gas emissions? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "Would cutting funding for climate change research to focus on economic growth make you support or oppose a political candidate proposing this? Support/Oppose/No change/Refused",
  "How do you regard the promotion of alternative sources of energy like wind and solar power? Supportive/Opposed/Refused",
  "Should governments prioritize mammoth scientific projects like particle colliders providing less immediate benefits versus practical, applied research? Prioritize mammoth projects/Prioritize applied research/Equal focus/No opinion",
  "Overall, do you think professional misconduct by dietitians is A very big problem/A moderately big problem/A small problem/Not a problem at all/Refused",
  "Does the concept of geoengineering to combat climate change appeal to you or do you see it as a potential danger?",
  "Do you think space exploration should be prioritised over pressing issues on Earth? Always/Sometimes/Rarely/Never/Refused",
  "Indicate whether you support or oppose fracking for natural gas and oil. Support fracking/Oppose fracking/Have mixed feelings/Refused",
  "Where do you stands on the issue of climate change? Do you believe it is largely caused by human activities, a natural phenomenon, or something else?",
  "How do you view the issue of digital privacy in our increasingly connected world? Major concern/Minor concern/Not a concern",
  "Consider the financial investment in space exploration. Would you describe it as excessive, necessary, or not enough? Excessive/Necessary/Not enough/No opinion",
  "How would you characterize your trust in technology companies working on artificial intelligence? High/ Moderate/ Low/ Refused",
  "Should countries worldwide align their policies to make Mars colonization a joint, global venture? Yes/No",
  "Do you think genetic engineering of animals to increase their production of specific proteins that will lead to more nutritious meat would be An appropriate use of technology/Taking technology too far/Refused",
  "In terms of environmental impact, how do you rate the plastic industry? Highly detrimental/Somewhat detrimental/Not detrimental at all/Refused",
  "What's your view on implementing a universal basic income for all, anticipating a future where AI and automation will replace many jobs? It's imperative to do so/It's not a feasible solution/It’s a possibility that requires more analysis/Refused",
  "What are your thoughts on regulatory bodies that supervise scientific experiments? Should they have full autonomy, or should public opinion factor into scientific regulations?",
  "Is it crucial to include climate change education in school curriculums, or should it be left to personal research and discretion? Include in school curriculum/Leave to personal research/Mixed views/Refused",
  "How much confidence, if any, do you have in medical scientists to act in the best interests of the public? A great deal of confidence/A fair amount of confidence/Not too much confidence/No confidence at all/Refused",
  "Do you broadly endorse the use of animals for scientific testing and research or oppose it due to ethical reasons? Endorse animal use/Broadly oppose due to ethical concerns/Mixed views/Refused",
  "What is your viewpoint on teaching evolution in schools? Support/Oppose/Refused",
  "What do you think about the government using science to guide policy decisions, even if it contradicts popular opinion? Should definitely guide/Should probably guide/Should probably not guide/Should definitely not guide/Refused",
  "In the case of climate change, what are your thoughts on government intervention? Necessary and urgent/Important but not urgent/Unnecessary intervention/Refused.",
  "Should funding for space exploration be increased? Yes/No",
  "Should the cloning of human beings for organ donation be permitted on ethical grounds, or is this a misuse of scientific knowledge?",
  "Do you think investing in the development of hydrogen as a clean energy source is a good idea? Yes/No",
  "Should governments around the world contribute to a global fund for climate change mitigation, given that it affects everyone on Earth? Yes, it's a shared responsibility/No, every country should handle its own climate initiatives/Refused",
  "In your opinion, how critical is the need for stronger regulations on the biotechnology industry? Extremely critical/Very critical/Moderately critical/Slightly critical/Not critical at all/Refused",
  "What is your opinion on claims that organic farming is better for the environment than conventional farming? Completely agree/Mostly agree/Mostly disagree/Completely disagree/Refused",
  "Analyze the introduction of genetically modified crops and their effects on the agriculture industry. Is this considered A significant stride towards efficiency/Potentially harmful for natural biodiversity/Favorable but needs more controls/Refused",
  "Does the idea of Human-Centric AI, that respect and prioritize human concerns, resonate with your perspective on AI ethics?",
  "What's your belief about green energy as an alternative to fossil fuels: Are fossil fuels still necessary/Can we fully replace them with renewables/I have mixed feelings about this/Refused",
  "How do you view the future of renewable energy? Positive and promising/Grim and unpromising/Neither promising nor unpromising/Refused",
  "How would you assess the current focus given to STEM subjects in schools? Is the priority too high, too low or just right?",
  "How do you view climate change? Should it be classified as a global emergency that demands urgent action, or is it a gradual process that can be managed over time?",
  "Do you believe that the scientific community should have political influence? Should have influence/Should not have influence/Refused",
  "In a society facing frequent natural disasters, would you promote the need for stronger buildings or a more comprehensive early warning system? Stronger buildings/Equal emphasis on both/Early warning system/Refused",
  "How do you rate your trust in scientific consensus over controversial topics such as climate change or vaccines? Complete trust/Somewhat trust/Little trust/No trust/Refused",
  "What do you think about the idea of colonizing other planets as a solution to overpopulation on Earth? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "Do you agree with the concept of technological singularity, wherein artificial intelligence surpasses human intelligence, benefitting humankind or leading to unforeseeable negative consequences?",
  "Thinking about dietitians, how often would you say they are transparent about potential conflicts of interest with industry groups in their work All or most of the time/Some of the time/Only a little of the time/None of the time/Refused",
  "Address the use of robotics in healthcare, particularly in surgeries. Do you interpret this as A step towards efficient medicine/Possible risk of removing the human touch/A promising advancement needing safeguards/Refused",
  "Some argue that nuclear power is a necessary part of the energy mix in our fight against climate change. What's your stance?",
  "Do you believe that man-made structures have a significant contribution to global dust pollution: Agree/Disagree/Neither or both/Refused",
  "How much faith do you have in technology to solve our environmental problems? Complete faith/Considerable faith/Some faith/No faith at all/Refused",
  "How much do you believe that current environmental regulations hinder economic development? Always/Often/Sometimes/Rarely/Never/Refused",
  "Is what you know about nutrition research scientists because you have heard or read about this in the news Yes, have heard or read about this in the news/No, have not heard or read about this in the news/Refused",
  "Where do you stand on investing in renewable energy resources as an alternative to fossil fuels? Support/Oppose/Unsure",
  "What is your view related to the concept of human evolution? Fully accept/Mostly accept/Neither accept nor refuse/Mostly refuse/Fully refuse",
  "When you think about the use of AI in making significant decisions such as hiring, do you consider it to be Promising/ Worrying/ Has potential but needs safeguards/ Refused",
  "How important do you think it is for schools to teach climate change education? Very important/Somewhat important/Not important at all/Refused",
  "What are your views on teaching evolutionary science in public schools? Should it be Taught as only accepted theory/Taught along with other theories like intelligent design/Not be taught at all?",
  "How do you perceive nuclear power as a means of resolving energy requirements? Favorable/Not favorable/Refused",
  "How much confidence do you place in the findings of climate scientists? A lot/Some/Not much at all/Refused",
  "Regarding the controversial topic of cloning, do you find it more threatening or promising for the progress of science? More threatening/More promising/Both in equal measure/Neither of the two/Refused",
  "In addressing carbon emissions, do you favor government interventions or market-driven solutions? Favor government interventions/Favor market-driven solutions/Favor a mix of both/Not sure/Refused",
  "Do you principally trust the scientific consensus on vaccine safety and efficacy, or do you uphold personal beliefs and rights against mandatory vaccinations? Trust scientific consensus/Uphold personal beliefs and rights/Mixed views/Refused",
  "Should public schools be required to teach evolution as a central theme of biology? Required/Not required/Refused",
  "Consider the concept of vaccinations and public health. Are vaccinations critical for public health? Definitely critical/Probably critical/Probably not critical/Definitely not critical/Refused",
  "Do you believe Genetically Modified Foods (GMOs) pose a serious threat to human health or the environment, or do they offer more benefits than risks?",
  "Is your understanding of climate change influenced by the reports presented by environmental researchers? Yes, greatly influenced/Yes, somewhat influenced/No, not influenced/Refused",
  "When thinking about the benefits of GMO foods, do you consider them to be generally helpful or harmful? Helpful/Harmful/Neither both/Refused",
  "Can science and religion coexist harmoniously in society, in your opinion? Yes, can coexist/No, cannot coexist/Refused",
  "How strongly do you support the government investing more in scientific research and development? Strongly support/Support/Neither support nor oppose/Oppose/Strongly Oppose/Refused",
  "Should the focus predominantly be on the prevention rather than the treatment of diseases? Focus on prevention/Equal focus on both/Focus on treatment/Refused",
  "What are your thoughts on the ethical implications of using artificial intelligence in everyday life? Completely ethical/Somewhat ethical/Unethical/Refused",
  "Do you believe that the influence of human activity on climate change is considerably significant?",
  "Thinking about environmental health specialists, how often would you say they do a good job providing recommendations about how to address risks to human health from the environment All or most of the time/Some of the time/Only a little of the time/None of the time/Refused",
  "Would you consider fossil fuel industries Should continue/Should be phased out/Neutral in favour of renewable energy sources?",
  "What's your opinion on bio-engineered organ transplants? Mostly approving/Mostly disapproving/Neutral/Refused",
  "Do you view genetic engineering as a boon or bane to humanity? More of a Boon/Equally a Boon and Bane/More of a Bane/Refused",
  "Is your understanding of climate change based on scientific facts or popular opinion? Scientific facts/Popular opinion/Mixed/Unsure",
  "Consider a future where robots and AI have come to dominate the workforce. Who do you think should be responsible for the welfare of displaced workers? The government/The companies which use robots and AI/Nobody's responsibility/Refused",
  "What's your stance on teaching evolution in public schools: should it be mandatory; alternatively, should it be an option; or should it be banned altogether? Mandatory/Optional/Banned/Refused",
  "How likely is the following if gene editing to change a baby's genetic characteristics becomes widely available? Inequality will increase because this option will be available only for the wealthy Very likely/Fairly likely/Not too likely/Not at all likely/Refused",
  "Do you believe that space exploration should be prioritized over addressing domestic issues? Yes/No/Space exploration and domestic issues should equally share focus/Refused",
  "Are you in support of nuclear energy as a means to combat global warming? Fully support/Somewhat support/Somewhat oppose/Fully oppose/Refused",
  "On the topic of ocean pollution and single-use plastics, should laws banning these materials be implemented and enforced more strictly? Definitely should/Probably should/Probably should not/Definitely should not/Refused",
  "In your viewpoint, does advanced robotics and automation more likely lead to job creation or job losses in the future? Job creation/Job losses/Unsure",
  "Do you consider the teaching of evolution in schools as a necessary aspect of science education or against religious beliefs? Necessary aspect of science education/Against religious beliefs/Both/No opinion",
  "Does reliance on technology and artificial intelligence for decision-making and problem-solving scare you for the future? Leads to progress/Undermines human intelligence/Undecided",
  "Given your current understanding, do you believe that scientists working in nuclear research are more altruistic than opportunistic in their motivations? More altruistic/More opportunistic/Neutral/Refused",
  "Is what you know about medical research scientists because you know someone who does this Yes, know someone who does this/No, do not know someone who does this/Refused",
  "Do you consider space exploration to be a valuable use of resources? Valuable/Not valuable/Refused",
  "Do you support laws that mandate vaccination for preventable diseases? Support/Oppose/Refused",
  "How should renewable energy be prioritized compared to traditional fossil fuels? Renewable energy should be the priority/Traditional fossil fuels should continue to be used/Renewable energy and fossil fuels should be balanced/Refused",
  "How much of a priority should the following be for the federal government to address: Addressing climate change A top priority/Important, but lower priority/Not too important/Should not be done/Refused",
  "Do you believe it is possible for humans to reverse the conditions created by climate change with the help of technology? Absolutely possible/Not possible at all/Undecided/Refused?",
  "What is your opinion about teaching of intelligent design in science classrooms? Should be required/Should be optional/Should only teach evolution/Shouldn't be taught at all/Refused",
  "Do you foresee artificial intelligence posing a significant threat or benefit to humanity in the coming years? AI will pose a substantial threat/AI will confer considerable benefit/Neither or Both/Refused",
  "Do you believe the concept of evolution should be taught in public schools, irrespective of religious beliefs? Yes/No/It depends/Refused",
  "Discuss the role of nuclear energy in battling climate change. Is it considered a Necessary solution/One of many solutions/Too risky an approach/Refused",
  "When considering policies related to vaccination, should the government prioritize individual freedom or public health? Prioritize individual freedom/Prioritize public health/Both should be equal/Not sure/Refused",
  "What's your stance on funding for space exploration Increase significantly/Increase slightly/Keep the same/Decrease slightly/Decrease significantly/Refused",
  "Your perspective on the idea that using animals in scientific research is inevitable for advancing human health. Completely inevitable/Mostly inevitable/Not quite inevitable/Not at all inevitable/Refused",
  "If you were to discuss the future of artificial intelligence (AI), would you say it's going to be Beneficial/Detrimental/Neither/Refused?",
  "How do you regard evolution as a valid explanation for the variety and complexity of life on earth? Fully accept/ Mostly accept/ Skeptical/Refused"
]