[
  "Would you say that black people are treated less fairly than white people, white people are treated less fairly than black people, or both are treated about equally in by the criminal justice system situations? Black people are treated less fairly than white people/White people are treated less fairly than black people/Both are treated about equally/Refused",
  "Would you say that black people are treated less fairly than white people, white people are treated less fairly than black people, or both are treated about equally in in dealing with the police situations? Black people are treated less fairly than white people/White people are treated less fairly than black people/Both are treated about equally/Refused",
  "Please indicate whether or not each has happened to you because of your race or ethnicity. Been unfairly stopped by police Yes, has happened to me/No, has not happened to me/Refused",
  "How well, if at all, do the following words or phrases describe you? Supporter of the National Rifle Association NRA Describes me well/Does not describe me well/Refused",
  "How much confidence, if any, do you have in the military to act in the best interests of the public? A great deal of confidence/A fair amount of confidence/Not too much confidence/No confidence at all/Refused",
  "Do you think the following uses of data/information are acceptable or unacceptable? The government collecting data about all Americans to assess who might be a potential terrorist threat Acceptable/Unacceptable/Not sure/Refused",
  "How much, if at all, do you think the amount of gun violence in movies and television contributes to gun violence in the country today? A great deal/A fair amount/Not too much/Not at all/Refused",
  "Thinking about gun owners who have children in their home, how important do you think it is for them to: Take gun safety courses Essential/Important but not essential/Not important/Should not be done/Refused",
  "In the future, what kind of an impact do you think the military will have in solving the biggest problems facing the country? A very positive impact/A somewhat positive impact/A somewhat negative impact/A very negative impact/Refused",
  "And thinking about some specific policy areas, in general, do you think men or women in high political offices are better at dealing with gun policy? Men are better/Women are better/No difference/Refused",
  "If you were deciding what the federal government should do to improve the quality of life for future generations, what priority would you give to increasing military spending? A top priority/An important, but not a top priority/A lower priority/Should not be done/Refused",
  "How likely do you think it is that the following will happen in the next 30 years? There will be a terrorist attack on the U.S. as bad as or worse than 9/11 Will definitely happen/Will probably happen/Will probably not happen/Will definitely not happen/Refused",
  "How much of a priority should the following be for the federal government to address: Dealing with terrorism A top priority/Important, but lower priority/Not too important/Should not be done/Refused",
  "How much of a priority should the following be for the federal government to address: Reducing gun violence A top priority/Important, but lower priority/Not too important/Should not be done/Refused",
  "Thinking about long-range foreign policy goals, how much priority, if any, do you think taking measures to protect the U.S. from terrorist attacks should be given? Top priority/Some priority/No priority/Refused",
  "Overall, would you say people who are convicted of crimes in this country serve Too much time in prison/Too little time in prison/About the right amount of time in prison/Refused",
  "Have you ever owned a gun at any point in your life, or have you never owned a gun? Yes, have owned a gun/No, have never owned a gun/Refused",
  "Which best describes you? I could see myself owning a gun again/at some point/I could never see myself owning a gun again/Refused",
  "Do you currently or have you ever owned a shotgun? Yes, I currently own/Yes, I have owned in the past but do not currently own/No, I have never owned/Refused",
  "Regardless of whether or not you own a gun, have you ever fired a gun? Yes, I have fired a gun/No, I have never fired a gun/Refused",
  "Which best describes you? I could never see myself not owning a gun/I could see myself not owning a gun at some point in the future/Refused",
  "How much, if at all, do you worry about the following happening to you? Being the victim of a violent crime Worry a lot/Worry a little/Do not worry at all/Refused",
  "How much, if at all, do you worry about the following happening to you? Being the victim of a mass shooting Worry a lot/Worry a little/Do not worry at all/Refused",
  "Does anyone else in your household own any guns (not including air guns, such as paintball, BB or pellet guns)? Yes, someone else in my household owns a gun/No, no one else in my household owns a gun/Refused",
  "Do you personally own any guns (not including air guns, such as paintball, BB or pellet guns)? Yes, I own a gun/No, I don't own any guns/Refused",
  "Please indicate whether the following is a major reason, a minor reason, or not a reason why you own a gun. For sport shooting, including target shooting and trap and skeet Major reason/Minor reason/Not a reason/Refused",
  "Would having a gun in your household make you feel Safer than you feel without a gun in your household/Less safe than you feel without a gun in your household/No more or less safe/Refused",
  "Please indicate whether the following is a major reason, a minor reason, or not a reason why you own a gun. For hunting Major reason/Minor reason/Not a reason/Refused",
  "How much, if at all, do you think the ease with which people can legally obtain guns contributes to gun violence in the country today? A great deal/A fair amount/Not too much/Not at all/Refused",
  "In general, is the gun in your home kept loaded, or not? Yes, kept loaded/No, not kept loaded/Refused",
  "How much, if at all, do you worry about the following happening to you? Having your home broken into Worry a lot/Worry a little/Do not worry at all/Refused",
  "How much, if at all, do you worry about the following happening to you? Being the victim of a terrorist attack Worry a lot/Worry a little/Do not worry at all/Refused",
  "Please indicate whether the following is a major reason, a minor reason, or not a reason why you own a gun. For protection Major reason/Minor reason/Not a reason/Refused",
  "Do you think an increase in the number of guns in the U.S. is generally good or bad for our society? Very good for society/Somewhat good for society/Neither good nor bad for society/Somewhat bad for society/Very bad for society/Refused",
  "And would you say you never carry a handgun or pistol because you don't want to or for some other reason? Don't want to carry/Some other reason/Refused",
  "How often, if ever, do you carry a handgun or pistol outside your home, not including times when you are transporting it? All of the time/Most of the time/Only some of the time/Never/Refused",
  "Which comes closer to your view, even if neither is exactly right? People who want to kill or harm others will find a way to it whether they have a gun or not/People who want to kill or harm others are less likely to it if they don't have a gun/Refused",
  "For this question, please think about your child or children who are under 18. Have you ever talked with your child or children about gun safety? Yes/No/I do not have children under 18/Refused",
  "Thinking about gun owners who have children in their home, how important do you think it is for them to: Talk to their children about gun safety Essential/Important but not essential/Not important/Should not be done/Refused",
  "Has anyone ever used a gun to threaten or intimidate you or someone in your family? Yes/No/Refused",
  "Not including in military combat or as part of your job, have you ever used a gun to defend yourself, your family or possessions, either by firing it or threatening to fire it? Yes/No/Refused",
  "Have you ever been a victim of a violent crime, whether a gun was used or not? Yes/No/Refused",
  "Thinking about people who commit suicide using a gun, which comes closer to your view, even if neither is exactly right? They would find a way to it whether they had access to a gun or not/They would be less likely to it if they didn't have access to a gun/Refused",
  "How often, if ever, do you attend gun shows Often/Sometimes/Hardly ever/Never/Refused",
  "How much, if at all, do you think lack of economic opportunities contributes to gun violence in the country today? A great deal/A fair amount/Not too much/Not at all/Refused",
  "How much, if at all, do you think the amount of gun violence in video games contributes to gun violence in the country today? A great deal/A fair amount/Not too much/Not at all/Refused",
  "How much, if at all, do you think the ease with which people can illegally obtain guns contributes to gun violence in the country today? A great deal/A fair amount/Not too much/Not at all/Refused",
  "Thinking about gun owners who have children in their home, how important do you think it is for them to: Keep their shooting skills up-to-date Essential/Important but not essential/Not important/Should not be done/Refused",
  "Thinking about gun owners who have children in their home, how important do you think it is for them to: Store guns and ammunition separately Essential/Important but not essential/Not important/Should not be done/Refused",
  "Compared to 50 years ago, do you think We live in a safer world/We live in a more dangerous world/The world we live in is neither safer nor more dangerous/Refused",
  "Thinking about gun owners who have children in their home, how important do you think it is for them to: Advise visitors with children that there are guns in the house Essential/Important but not essential/Not important/Should not be done/Refused",
  "Thinking about gun owners who have children in their home, how important do you think it is for them to: Advise visitors that there are guns in the house Essential/Important but not essential/Not important/Should not be done/Refused",
  "How often, if ever, do you visit websites about guns, hunting or other shooting sports Often/Sometimes/Hardly ever/Never/Refused",
  "Are you currently a member of a gun or shooting club or gun range Yes/No/Refused",
  "How often, if ever, do you watch TV programs about guns or watch gun-oriented videos Often/Sometimes/Hardly ever/Never/Refused",
  "Now thinking about your spouse or partner. Does your spouse or partner own any guns? Yes/No/Refused",
  "How often, if ever, do you participate in online discussion forums about guns Often/Sometimes/Hardly ever/Never/Refused",
  "How often, if ever, do you listen to gun-oriented podcasts or radio shows Often/Sometimes/Hardly ever/Never/Refused",
  "Thinking about gun owners who do not have children in their home how important do you think it is for them to: Take gun safety courses Essential/Important but not essential/Not important/Should not be done/Refused",
  "Thinking about gun owners who do not have children in their home how important do you think it is for them to: Advise visitors that there are guns in the house Essential/Important but not essential/Not important/Should not be done/Refused",
  "Thinking about gun owners who do not have children in their home how important do you think it is for them to: Advise visitors with children that there are guns in the house Essential/Important but not essential/Not important/Should not be done/Refused",
  "Thinking about gun owners who do not have children in their home how important do you think it is for them to: Keep all of their guns unloaded Essential/Important but not essential/Not important/Should not be done/Refused",
  "Thinking about gun owners who do not have children in their home how important do you think it is for them to: Keep all of their guns in a locked place Essential/Important but not essential/Not important/Should not be done/Refused",
  "How often, if ever, did you use air guns, such as paintball, BB or pellet guns when you were growing up? Often/Sometimes/Hardly ever/Never/Refused",
  "Thinking about gun owners who have children in their home, how important do you think it is for them to: Keep all of their guns in a locked place Essential/Important but not essential/Not important/Should not be done/Refused",
  "Thinking about gun owners who do not have children in their home how important do you think it is for them to: Store guns and ammunition separately Essential/Important but not essential/Not important/Should not be done/Refused",
  "Thinking about gun owners who do not have children in their home how important do you think it is for them to: Keep their shooting skills up-to-date Essential/Important but not essential/Not important/Should not be done/Refused",
  "How much of a problem was gun violence in the community where you spent the majority of time when you were growing up? A very big problem/A moderately big problem/A small problem/Not a problem at all/Refused",
  "Thinking about when you were growing up, as far as you know, were there ever any guns in your household or not? Yes, there were guns in my household/No, there were no guns in my household/I am not sure if there were guns in my household/Refused",
  "How much, if at all, do you think family instability contributes to gun violence in the country today? A great deal/A fair amount/Not too much/Not at all/Refused",
  "Would you say the following was a reason or was not a reason why there were guns in your household when you were growing up? For protection Yes, was a reason/No, was not a reason/Refused",
  "Thinking about gun owners who have children in their home, how important do you think it is for them to: Keep all of their guns unloaded Essential/Important but not essential/Not important/Should not be done/Refused",
  "Thinking about the people in the community where you spent the majority of time when you were growing up, as far as you know, how many people owned guns? All or most/Some/Only a few/None/Refused",
  "How often, if ever, did you go shooting or to a gun range when you were growing up? Often/Sometimes/Hardly ever/Never/Refused",
  "Would you say the following was a reason or was not a reason why there were guns in your household when you were growing up? For sport shooting, including target shooting and trap and skeet Yes, was a reason/No, was not a reason/Refused",
  "Would you say the following was a reason or was not a reason why there were guns in your household when you were growing up? For hunting Yes, was a reason/No, was not a reason/Refused",
  "Which of the following is the most important reason why you own a gun? For protection/For hunting/For sport shooting, including target shooting and trap and skeet/As part of a gun collection/For my job/Refused",
  "How important, if at all, is being a gun owner to your overall identity? Very important/Somewhat important/Not too important/Not at all important/Refused",
  "Please indicate whether the following is a major reason, a minor reason, or not a reason why you own a gun. For my job Major reason/Minor reason/Not a reason/Refused",
  "Do you feel that society in general tends to look at most gun owners in a positive way or a negative way? Positive way/Negative way/Refused",
  "As far as you know, how many of your friends, if any, own guns? All or most/Some/Only a few/None/Refused",
  "Do you feel that people in your local community tend to look at most gun owners in a positive way or a negative way? Positive way/Negative way/Refused",
  "In general, as far as you know, how many of the guns in your home would you say are kept in a locked place? All are kept in a locked place/Some are kept in a locked place and some are not/None are kept in a locked place/Refused",
  "Thinking about when you're at home, would you say there is a gun that is both loaded and easily accessible to you All of the time/Most of the time/Only some of the time/Never/Refused",
  "In general, is the gun in your home kept in a locked place, or not? Yes, kept in a locked place/No, not kept in a locked place/Refused",
  "In general, as far as you know, how many of the guns in your home would you say are kept loaded? All are kept loaded/Some are kept loaded and some are not/None are kept loaded/Refused",
  "How often, if ever, do you go shooting or to a gun range? Often/Sometimes/Rarely/Never/Refused",
  "Please indicate whether the following is a major reason, a minor reason, or not a reason why you own a gun. As part of a gun collection Major reason/Minor reason/Not a reason/Refused",
  "Have you ever taken any gun safety courses such as weapons training, hunter safety or firearm safety? Yes/No/Refused",
  "Does having a gun in your household make you feel Safer than you would feel without a gun in your household/Less safe than you would feel without a gun in your household/No more or less safe/Refused",
  "Which comes closer to your view, even if neither is exactly right? People who want to kill or harm others will find a way to do it whether they have a gun or not/People who want to kill or harm others are less likely to do it if they don't have a gun/Refused",
  "Thinking about people who commit suicide using a gun, which comes closer to your view, even if neither is exactly right? They would find a way to do it whether they had access to a gun or not/They would be less likely to do it if they didn't have access to a gun/Refused",
  "In your opinion, do stricter gun laws result in less crime or result in law-abiding citizens being unfairly penalized? Stricter laws result in less crime/Stricter laws penalize law-abiding citizens/Neither/Both/Refused",
  "Concerning the Second Amendment, would you say it's an outdated notion from a bygone era or a critical right that must be protected in contemporary society? Outdated notion/Critical right/Neither/Both/Refused",
  "What's your stance on the requirement for background checks before all gun purchases? Fully support/Somewhat support/Neither support nor oppose/Somewhat oppose/Fully oppose/Refused",
  "How do you perceive the relationship between mental health issues and mass shootings? Strong connection/Moderate connection/Weak connection/No connection/Refused",
  "Is school shootings a gun control problem or a mental health problem? Gun control problem/Mental health problem/Both/Neither/Refused",
  "Do you think that teachers should be armed in schools to protect students? Yes, always/Yes, but only if they have proper training and want to/No, never/Not sure",
  "Do you believe gun ownership is a fundamental American right or is it a privilege that one should earn? Fundamental right/Privilege/Both/Neither/Refused",
  "How vital do you deem gun safety education in reducing gun violence? Extremely important/Important/Moderately important/Slightly important/Not at all important/Refused",
  "What's your stand on the need for a national database to track gun sales? Absolutely required/Useful but not crucial/Not needed at all/Refused",
  "Do you believe the media overemphasizes gun crime, reports it accurately or downplays it? Overemphasizes/Reports accurately/Downplays/Refused",
  "Do you support a mandatory buyback program for all privately owned guns as a method to reduce gun violence? Yes, I fully support it/I somewhat support it/I do not support it at all/Refused",
  "How would you perceive the impact of arming teachers as a safety measure in schools? Highly effective/Somewhat effective/Not effective at all/Refused",
  "Would you advocate for stricter regulations on online sales and gun shows to prevent illegal weapon procurement? Yes, stricter regulations are necessary/No, current regulations are sufficient/No, even existing regulations should be relaxed/Refused",
  "Could increasing mental health support in communities significantly decrease instances of gun violence? Most certainly it would/A little but not much/No, it wouldn't make a difference/Refused",
  "Imagine you are in a position of power. Would you push for extensive background checks and waiting periods for all gun sales, including those between private individuals? Yes, without a doubt/Maybe, it depends on the details/No, no further restrictions should be implemented/Refused",
  "Do you think more citizens carrying guns would reduce crime rates and make society safer? Definitely/Somewhat/Not at all/Refused",
  "If given the opportunity, would you redirect funds from police departments towards community initiatives, thereby reducing the necessity for weapons-based defense in society? Certainly/Perhaps/No way/Refused",
  "Do you believe that gun ownership is directly tied to preserving personal freedoms and resisting tyrannical government overreach? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "Evaluate the effectiveness of gun-free zones in preventing violent incidents related to firearms. Extremely effective/Moderately effective/Barely effective/Ineffective/Refused",
  "When thinking about gun violence and crime rates, how significant a role do you believe stricter gun control laws would play in reducing them? Extremely Significant/Significant/Not particularly significant/Insignificant/Refused",
  "Could you express why you believe people should or shouldn't be allowed to carry guns in public places? Significant impact on safety/Can deter crime/Unnecessary risk/Potential for misuse/Refused",
  "How much do you think the availability of mental health resources and therapy might help decrease gun-related violence? A great deal/A fair amount/Not too much/Not at all/Refused",
  "Is the issue of armed personnel in educational institutions a potential solution or exacerbation to the problem of school shootings? Solution/Part of the problem/Undecided/Refused",
  "In anticipation of self-defence situations, do you consider having a gun in the home as more of a safety measure or a risk? Safety Measure/Risk/Both/Undecided/Refused",
  "Can laws permitting concealed carry of firearms significantly contribute to public safety or is it more likely to create potential for harm? Increases safety/Potential for harm/Undecided/Refused",
  "Do you think that rigorous background checks before the sale of firearms can significantly reduce gun-related crimes? Absolutely/Somewhat/Not really/Not at all/Refused",
  "To what extent do you believe that illegal gun trafficking contributes to the crime rate in the country? Extremely/Quite a bit/Some/Not very much/Not at all/Refused",
  "As a hypothetical governor of a state, would you allocate more funds to law enforcement or mental health services to decrease gun violence? Law Enforcement/Mental health Services/Both/Undecided/Refused",
  "Considering the Second Amendment, do you think the right to bear arms should have restrictions in the current societal context or remain absolute? Should have restrictions/Remain absolute/Undecided/Refused",
  "Debate the notion: Is arming teachers in schools an effective way of preventing school shootings or would it only exacerbate the issue? Yes, arming teachers is effective/No, arming teachers would exacerbate the issue/Refused",
  "What's your position on the role of mental health in gun violence? Is it the critical factor, just one factor among many, or irrelevant? Mental health is the critical factor/Mental health is just one factor/Mental health is irrelevant/Refused",
  "In terms of stricter gun control policies, what is your stance on background checks for all private gun sales, including at gun shows? Essential/Important but not essential/Not important/Should not be done/Refused",
  "Should individuals on the \"no-fly\" list be permitted to purchase guns? Yes, they should be allowed to purchase guns/No, they should not be allowed to purchase guns/Refused",
  "What do you believe constitutes 'responsible' gun ownership, and how important is it in preventing gun crime? Very important/Important but not essential/Not important at all/Refused",
  "Would a ban on high-capacity magazines reduce gun violence? Yes, it would reduce gun violence/No, it wouldn't have a significant effect/Refused",
  "Consider implementing a mandated buyback of assault weapons as a measure to reduce gun violence. Do you think it'll work? Yes, it would work/No, it wouldn't work/Refused",
  "Do you support allowing trained and licensed individuals to carry concealed weapons in public? Yes, I support concealed carry/No, I do not support concealed carry/Refused",
  "How often, if ever, do you engage in discussions online about gun control? Often/Sometimes/Hardly ever/Never/Refused",
  "Do you believe that stronger gun control laws are necessary in order to reduce gun deaths in the country? Yes, absolutely necessary/Somewhat necessary/Not necessary at all/Refused to respond",
  "How do you feel about banning the possession of handguns, except by law enforcement and security personnel? Strongly agree/Somewhat agree/Disagree/Refused",
  "How would you rank the importance of addressing mental health issues as a path to reducing gun-related crimes? Very Important/Important/ Not Important/Refused",
  "Do you perceive a direct correlation between illegal drug trade and rises in gun violence? Definite correlation/Possible correlation/No correlation/Refused",
  "How critical do you think it is to integrate educational programs about firearm safety in schools? Extremely Critical/Important but not Critical/Not Important/Refused",
  "How would you categorize the importance of firearm training and license renewal for gun owners? It's a necessity/Fairly important/Not necessary at all /Refused",
  "Discuss the importance of background checks for all gun buyers, regardless of whether they're buying from licensed gun dealers or private sellers. Should always be done/Most of the time/It's not necessary /Refused",
  "How would you prioritize the involvement of the community in preventing gun violence? High priority/Somewhat of a priority/Low priority/Refused",
  "Would you support a governmental buy-back program for firearms to reduce the number of guns in circulation? Definitely would support / Might support / Would not support / Refused",
  "How essential do you think it is to impose strict penalties for gun owners who violate gun control laws? Extremely essential / Somewhat essential / Not essential / Refused",
  "Provide your perspective on whether the Second Amendment should be interpreted as granting individuals the right to own firearms or whether it primarily applies to regulated militias. Individual right/Militia right/No opinion/Refused",
  "Discuss your thoughts on whether classifying semi-automatic firearms as assault weapons for the purposes of gun control legislation is a reasonable measure. Reasonable/Not reasonable/No opinion/Refused",
  "How strongly do you believe that having a gun in the home increases the security and safety of the residents? Strong belief/Moderate belief/Don't believe at all/Refused",
  "Can you explain your stance on whether or not stricter gun control laws would effectively reduce gun violence in the United States? Would decrease violence/Would not decrease violence/Unsure/Refused",
  "What's your opinion on introducing mandatory background checks for all gun purchases, including private sales and at gun shows? In favor/Not in favor/Mixed feelings/Refused",
  "Please express your views on whether teachers should be allowed and encouraged to carry firearms in schools as a measure of protection against shootings. Teachers should carry firearms/Teachers should not carry firearms/No opinion/Refused",
  "Share your thoughts on whether individuals suffering from mental illnesses should be prohibited from owning guns, even if they have no criminal record. Should be prohibited/Should not be prohibited/Mixed feelings/Refused",
  "Discuss how much you agree or disagree that the potential of armed citizens deterring crime justifies the right to carry firearms in public. Agree/Disagree/Neutral/Refused",
  "What's your stance on the importance of providing more funding for mental health resources, instead of stricter gun control laws, as a way to reduce mass shootings? More important/Less important/Equally important/Refused",
  "Estimating the overall rate of crime in your city, what significance do you perceive of legal gun ownership playing in deterring crime? Major/Minor/No significance/Refused",
  "Considering the public view on firearms, how meaningful do you regard the implementation of stricter background checks for all gun sales? Crucial/Significant/Not significant/Refused",
  "Reflecting on the current political climate, what biases do you think exist in media reports about gun violence? Substantial/Somewhat/None at all/Refused",
  "Analyzing the trend of school shootings, how much emphasis should be placed on improving mental health resources versus increasing gun control measures? More on mental health/More on gun control/Same emphasis on both/Refused",
  "Speaking from your perspective, do you believe individuals on the no-fly list should be restricted from purchasing firearms? Strictly yes/Depends on the circumstances/Strictly no/Refused",
  "Given the debate around the right to bear arms, how advantageous or harmful you see the role of powerful gun lobby groups in influencing gun laws? Highly advantageous/Low impact/Highly detrimental/Refused",
  "Surveying instances of gun violence, what's your take on expanding Make My Day laws that provide immunity for homeowners who use deadly force against intruders? Strongly in favor/Somewhat in favor/Somewhat against/Strongly against/Refused",
  "Evaluating our society's value for life, how necessary do you deem the concept of \"One gun per household\" policy for potentially curbing gun violence? Extremely necessary/Moderately necessary/Not at all necessary/Refused",
  "Without disregarding the importance of constitution rights, how much value you hold for the need to make the public sphere (such as schools and colleges) gun-free zones? Immense value/Some value/No value/Refused",
  "Assuming the social dynamics involving firearms, how effectively do you see educational programs aimed at teaching gun safety deterring accidental gun deaths? Highly effective/Somewhat effective/Not effective/Refused",
  "How would you characterize your support for stricter gun control laws? Fully support/Moderately support/Neutral/Do not support at all/Refused\nExpected",
  "Often, crimes are committed using illegally obtained guns. How can you suggest we handle this situation?\nExpected",
  "Do you believe having a gun in the house reduces the chances of a burglary happening? Yes, it does reduce the chances/No, it doesn't reduce the chances/Makes no difference/Refused\nExpected",
  "Please talk about whether reevaluating laws related to gun shows could curtail gun violence. Agree/Disagree/Neutral/Refused\nExpected",
  "Discuss whether educational campaigns about responsible gun ownership could have a significant effect on reducing gun-related incidents. Agree/Disagree/Neutral/Refused\nExpected",
  "Please reflect on the idea that arming school teachers could prevent school shootings. Support/Do not support/Neutral/Refused\nExpected",
  "Is there a correlation between high levels of gun ownership and an increased likelihood of experiencing gun violence? Yes/No/Maybe/Refused\nExpected",
  "Please elucidate on whether restricting access to assault-style weapons would help decrease mass shootings. Agree/Disagree/Neutral/Refused \nExpected",
  "Is the media portrayal of gun crime and violence affecting public perception and stirring unnecessary fear? Yes/No/It's complicated/Refused\nExpected",
  "Does public opinion on stricter gun controls have any significant effect on the legislative activity on gun laws? Yes, considerably affects/No, doesn't affect/Has moderate effect/Refused\nExpected",
  "In the conversation regarding gun regulations, where do you stand in terms of the balance between rights of individual gun owners and the protection of the public? More rights for individual gun owners/More protection for the public/Both are important/Refused",
  "How do you view the necessity of gun ownership for personal protection? Essential/Important but not essential/Not important/Should not be done/Refused",
  "What is your sentiment regarding mandatory background checks for all gun sales? Fully support/Partially support/Do not support/Refused",
  "How vital do you consider the right to bear arms to be in the modern society? Extremely important/Important/Not important/Not necessary at all/Refused",
  "When confronted with the topic of mass shootings, do you feel stricter gun regulations could help reduce their frequency? Agree/Disagree/Neutral/Refused",
  "How would you respond to a proposal for a total ban on civilian ownership of high capacity magazines and assault weapons? Agree/Disagree/Neutral/Refused",
  "Do you believe that the presence of more guns in society leads to less crime, more crime, or has no impact on crime rates? Less crime/More crime/No impact/Refused",
  "Would you endorse laws permitting teachers to carry guns in schools as a means of ensuring student safety? Support/Do not support/Refused",
  "What is your stance on the use of armed private security personnel or armed guards in public spaces as a deterrent to crime? Support/Do not support/Neutral/Refused",
  "In your view, how important is it to have stricter laws regulating the sale of firearms? Highly essential/Somewhat essential/Not very essential/Not essential at all/Refused",
  "Considering the recent rise in crime rates, do you feel that gun ownership should be encouraged for personal protection? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "Do you believe that stricter gun control will lead to criminals finding alternative ways to commit crime? Definitely likely/Somewhat likely/Not very likely/Not at all likely/Refused",
  "Thinking about gun education, do you think it's necessary to include gun safety courses in school curriculum? Yes, definitely/Yes, but not essential/No, but it wouldn't hurt/No, definitely not/Refused",
  "In light of mass shootings, do you think that banning assault weapons is an effective solution? Absolutely effective/Partially effective/Slightly effective/Not effective at all/Refused",
  "Do you think increased background checks and mental health screenings would reduce gun violence? Highly agree/Agree to some extent/Disagree to some extent/Highly disagree/Refused",
  "Regarding concealed carry laws, do you believe carrying a concealed weapon reduces crime? Extremely likely/Moderately likely/Slightly likely/Not at all likely/Refused",
  "With respect to stand-your-ground laws, do believe they deter crime or do they escalate violence? Deter crime/Escalate violence/No clear impact/Unsure/Refused",
  "Considering the second amendment, do you think the right to bear arms is as relevant today as when it was written? Perfectly relevant/Somewhat relevant/Not very relevant/Completely irrelevant/Refused",
  "Do you feel that gun buyback programs are an effective strategy to curb gun violence? Highly effective/Moderately effective/Minimally effective/Not effective at all/Refused",
  "How significant do you deem the role of legislation in curbing gun violence? Very significant/Moderately significant/Insignificant/It can escalate gun violence/Refused",
  "To your understanding, how do stricter gun laws affect the crime rates in society? They reduce crime rates/They increase crime rates/They have no effect on crime rates/Refused",
  "There's a popular statement \"Guns donâ€™t kill people. People kill people.\" How do you interpret this in regard to gun laws? Agree/Disagree/Cannot say/Refused",
  "How would you rephrase the Second Amendment right to bear arms, considering the current societal context? Provide your rewritten phrase.",
  "Imagine you are drafting a gun legislation proposal for your community. Could you state the three main points?",
  "How evident do you think is the correlation between mental health issues and gun violence? Very evident/Somewhat evident/Not evident at all/Refused",
  "In your opinion, how much emphasis should be placed on the background checks of potential gun owners? A great deal/A fair amount/Not much/None at all/Refused",
  "Do you perceive any connection between poverty, unemployment and high crime rates involving guns? Yes, there is a connection/No, there is no connection/It's complex and depends/Refused",
  "In what way do you observe the impact of gun culture on youth and crime in your community? Positive/Negative/Neutral/Refused",
  "What's your stance on armed security personnel in educational institutions as a means to prevent gun violence? Support/Oppose/Neutral/Refused",
  "Could you elaborate on whether stricter gun control laws would significantly reduce crime rates in the country? Definitely/Probably/Probably not/Definitely not/Refused",
  "What are your thoughts on individuals needing to undergo thorough background checks before purchasing a firearm? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "Should teachers be armed in schools as a precaution against potential threats? Absolutely/Perhaps/Not really/Absolutely not/Refused",
  "Do you think the Second Amendment's right to bear arms should be preserved or revised? Preserved/Slightly revised/Significantly revised/Completely abolished/Refused",
  "Is it your opinion that providing more mental health services could be a way to reduce gun violence? Highly effective/Somewhat effective/Not very effective/Ineffective/Refused",
  "Are you in favor of banning assault weapons? Strongly in favor/In favor/Against/Strongly against/Refused",
  "Should citizens need to obtain a license to purchase a gun, similar to a driver's license? Yes, definitely/Maybe/Preferably not/Definitely not/Refused",
  "Where do you stand on the government's role in regulating the sale of ammunition? Should be heavily involved/Should be somewhat involved/Should be minimally involved/Should not be involved at all/Refused",
  "Does ordinary citizens carrying a concealed weapon make the society safer or riskier? Safer/It's complicated/Riskier, but manageable/Riskier and unwarranted/Refused",
  "What are your views on the correlation between the prevalence of guns and the rate of violent crimes? Direct correlation/Partial correlation/No correlation/Correlation is counterproductive/Refused",
  "Would you support a measure to increase the age requirement for purchasing guns? Strongly support/Support/Oppose/Strongly oppose/Refused",
  "Do you believe requiring safe storage laws for guns could help prevent accidental shootings? Highly effective/Moderately effective/Minimally effective/Ineffective/Refused",
  "Are 'Gun-free zones' a constructive approach to reducing gun violence in public spaces? Highly effective/Possibly effective/Ineffective/Potentially counterproductive/Refused",
  "Do you propose that individuals with histories of domestic violence should be banned from owning guns? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "Should individuals have unrestricted access to 3D-printed guns? Absolutely/In certain conditions/Only with heavy regulations/Absolutely not/Refused",
  "Do you believe gun manufacturers should be held liable for crimes committed with their weapons? Fully responsible/Partially responsible/Not responsible/It's complicated/Refused",
  "Is the concept of a nationwide gun registry a step in the right direction or a breach of privacy? Step in the right direction/It's complicated/Breach of privacy/Unnecessary step/Refused",
  "What do you feel about implementing a mandatory buyback program for assault weapons? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "Should the sale of semi-automatic weapons be limited to military and police only? Yes, definitely/Probably/Probably not/Definitely not/Refused",
  "What is your stance on the proliferation of 'Stand Your Ground' laws? Supportive/Neutral/Opposed/Strongly opposed/Refused",
  "Is it important or unnecessary for the federal government to expand background checks for all gun sales, including private sales and gun shows? Important/Unnecessary/Don't know/Refused",
  "Do you believe that the right to own guns is essential for freedom, or it's a threat to public safety? Essential for freedom/ Threat to public safety/ Both/ Neither/Refused",
  "Should teachers be armed in schools to potentially deter or respond to school shootings? Yes/No/Don't know/Refused",
  "Do you think that implementing more stringent gun control laws would reduce crime rates and mass shootings? Yes/No/Don't know/Refused",
  "Would it be effective or counterproductive to stop producing semi-automatic weapons, commonly used in mass shootings? Effective/ Counterproductive/ Don't know/ Refused",
  "Do you see the National Rifle Association (NRA) as a vital defender of the Second Amendment or as an obstacle to gun control? Defender of the Second Amendment/ Obstacle to gun control/ Both/ Neither/Refused",
  "Is citizen ownership of high-capacity ammunition magazines a protection right or a potential threat? Protection right/Potential threat/Both/Neither/Refused",
  "Should the government create a federal registry of all gun sales in the country or would that infringe on citizens' rights? Create a federal registry/Infringe on citizens' rights/Don't know/Refused",
  "Would you support or oppose laws allowing the sue of gun manufacturers and dealers if their weapons were used in crime? Support/Oppose/Don't know/Refused",
  "Do you believe gun ownership decreases personal risks of becoming a victim of crime, or it increases risks due to accidents and domestic incidents? Decreases risks/Increases risks/Both/Neither/Refused",
  "Should convicted felons, after serving their time, regain their right to own guns? Yes/No/Don't know/Refused",
  "Do you think that police officers should have more, less, or the same firepower as civilians? More/Less/The same/Don't know/Refused",
  "Given the level of gun violence, is the American cultural affinity for guns justified or it needs reconsideration? Justified/Needs reconsideration/Both/Neither/Refused",
  "Would you deem it necessary or excessive for the government to limit the amount of firearms a person can purchase within a certain timeframe? Necessary/Excessive/Don't know/Refused",
  "Do you believe that 'Stand your Ground' laws, which allow people to respond to threats or force without retreating first, encourage or discourage violence? Encourage violence/Discourage violence/Don't know/Refused",
  "Do you believe that it should be obligatory or an individual's choice to secure firearms in homes with children? Obligatory/ Individual's choice/ Don't know/ Refused",
  "Is it effective or unhelpful to provide mental health checks for potential gun owners? Effective/Unhelpful/Don't know/Refused",
  "Would you advocate the ban on or free sale of 'ghost guns,' untraceable weapons assembled from parts purchased online? Advocate the ban/ Advocate free sale/ Don't know/ Refused",
  "Should concealed carry permits be valid across all states, or should the rules vary by state? Valid across all states/ Vary by state/ Don't know/ Refused",
  "Do you see the surge in gun sales during periods of social unrest as a patriotic exercise of rights or a concerning response? Patriotic exercise of rights/Concerning response/Both/Neither/Refused",
  "Do you feel that local law enforcement agencies should be given the freedom to decide whether or not to enforce gun control laws as per their discretion? Yes, law enforcement should have the discretion/No, law enforcement should strictly enforce all laws/Refused",
  "Do you believe that stricter regulations around acquiring a gun permit could potentially reduce regional crime rates? Would strict regulations save more lives or are they infringing upon the citizen's right to bear arms? Agree/Disagree/Refused",
  "Should people convicted of non-violent crimes continue to have their Second Amendment rights? They should retain their rights/They should not retain their rights/Refused",
  "What is your take on implementing anti-gun programs in schools to raise awareness amongst children and potentially reduce future crime rates? Beneficial/Detrimental/Refused",
  "How would you evaluate the impact of stand-your-ground laws on escalating conflicts within your local community? Positive/Negative/No significant effect/Refused",
  "Would you support a policy that mandates the installation of locks on all firearms to guard against unintentional shootings? Support/Don't Support/Refused",
  "Do you believe that the media portrayal of gun crime is an accurate reflection of reality? Accurate/Inaccurate/Refused",
  "Teens and young adults are often involved in shooting accidents. Do you agree with legislating stricter laws on the legal age for gun ownership to combat this issue? Yes, stricter laws are needed/No, current laws are adequate/Refused",
  "Do you think setting up a mandatory buyback program for all privately owned guns to reduce the number of firearms in the country is a good idea? Agree/Disagree/Refused",
  "How critically important do you believe the role of proper education and training is for first-time gun owners? Extremely important/Important but not extremely/Not so important/Refused",
  "Should people with a history of mental illness be allowed to purchase guns? Allowed/Not allowed/Refused",
  "How do you perceive the relationship between gun ownership and suicide rates? Directly correlated/Not correlated/Refused",
  "What are your thoughts on allowing teachers to carry guns in schools as a measure to increase security? Positive/Negative/Refused",
  "Who do you think is more likely to become a victim of gun violence: gun owners themselves or innocent bystanders? Gun owners/Innocent bystanders/Refused",
  "It is often argued that 'guns don't kill people, people kill people'. Where do you stand on this perspective? Agree/Disagree/Refused",
  "Would you support the idea of developing a federal database to track gun sales? Yes, I would support it/No, I would not support it/Refused",
  "Is it crucial to reinforce the awareness of the significant responsibility associated with owning a gun in society? Yes/No/Refused",
  "Does the fact that someone carries a gun make them seem more trustworthy, less trustworthy, or does it not affect your opinion at all? More trustworthy/Less trustworthy/No effect/Refused",
  "Do you consider gun ownership as more of a right or a privilege? Right/Privilege/Refused",
  "Do you believe that the laws for purchasing firearms should be stricter, less strict, or kept as they are now? Stricter/Less strict/Remain the same/Refused",
  "Are you of the opinion that an individual has the constitutional right to own high-powered semi-automatic weapons such as AR-15 rifles? Yes, the constitution allows it/No, the constitution doesn't allow it/Refused",
  "What are your thoughts on the measures that need to be taken to prevent gun violence in schools? More focus on mental health/Stricter gun control laws/More armed guards in schools/Refused",
  "Could you tell us if you support or oppose a nationwide ban on the sale of assault weapons? Support a ban/Oppose a ban/Refused",
  "Describe your perspective on teachers having guns in classrooms as a solution to school shootings. In favor/Opposed/Neutral/Refused",
  "What is your stance on the proposal of banning high-capacity magazines that can hold more than ten bullets? Support the ban/Oppose the ban/Neither/Refused",
  "How would you rate your level of concern when it comes to accidental shooting incidents due to unsecured guns at home? Very concerned/Some concern/Not too concerned/Not at all concerned/Refused",
  "Could you express your views on the proposal of allowing citizens to carry concealed guns without a permit? Support the proposal/Oppose the proposal/Neutral on the proposal/Refused",
  "Comment on whether you believe gun owners should be required to license their firearms with local law enforcement? Required/Not Required/Refused",
  "How would you assess your level of support for the idea that the police and law enforcement officials should be the only ones permitted to carry guns? Very supportive/Somewhat supportive/Not supportive at all/Refused",
  "Can you tell us your views on whether people on the federal no-fly list should be banned from buying guns? In favor/Opposed/Refused",
  "Offer your perspective on corporations' decisions to stop selling guns or tighten their gun-sales policies. Supportive/Not supportive/Don't care/Refused",
  "Please explain your standpoint on whether a mandatory waiting period for buying firearms would curb incidents of gun violence? Yes, it would help/No, it wouldn't help/Maybe/Refused",
  "What do you think about the practice of selling firearms and ammunition online? Support online sales/Oppose online sales/Neutral/Refused",
  "Do you think towns and cities should be allowed to pass their own laws to regulate firearms? Yes, they should/No, they shouldn't/Refused",
  "Offer your thoughts on establishing more programs to buy back guns from people who own them? Strongly support/Somewhat support/Strongly oppose/Refused",
  "What are your feelings about using taxpayer dollars to fund gun safety classes for gun owners? Supportive/Not supportive/Neutral/Refused",
  "Can you comment on the role of parent's responsibility in preventing gun accidents at home? Very responsible/Somewhat responsible/Not responsible/Refused",
  "In your perspective, how accurately do media portrayals of gun violence reflect actual crime rates? Overstate actual crime rates/Understate actual crime rates/Accurately depict actual crime rates",
  "Given the recurrent school shootings situation in the US, would you support or oppose stricter gun laws? Support stricter gun laws/Oppose stricter gun laws/Refused",
  "From your point of view, should teachers be armed with guns to improve school safety? Yes teachers should be armed/No teachers should not be armed/Refused",
  "Would you favor a law that requires mental health checks for all gun buyers? Favor mental health checks/Do not favor mental health checks/Refused",
  "Do you believe that increasing the severity of punishment for illegal gun owners could decrease gun violence? Agree/Disagree/Refused",
  "Do you consider mass shootings to be a significant national issue that warrants immediate action by the government? Yes, it requires immediate action/No, it does not require immediate action",
  "How do you perceive the relationship between crime rates and gun ownership: More guns lead to more crime/More guns lead to less crime/No Impact/Refused",
  "Would you endorse a law that mandates owners to lock up their guns when not in use? Endorse mandatory safe storage/Do not endorse mandatory safe storage/Refused",
  "Would you support a ban on high capacity magazines that hold more than 10 bullets? Support the ban/Do not support the ban/Refused",
  "Would you agree that the right to bear arms should come with limitations due to public safety concerns? Agree/Disagree/Refused",
  "Do you believe stricter gun laws intrude on the individual's Second Amendment rights? Yes, they intrude/No, they do not intrude",
  "Would you support a proposal for a national gun registry for all gun sales? Support/Nonsupport/Refused",
  "How suitable do you think it is to allow concealed carry of guns in public places without any licensing or training? Suitable/Not suitable/Refused",
  "Do you think implementing gun-free zones in public areas help to reduce mass shootings? Would help/Would not help/Refused",
  "Would you back a law that requires background checks for all firearm sales? Back the law/Do not back the law/Refused",
  "Do you agree that instead of gun control, what is required is better mental health services? Agree/Disagree/Refused",
  "Would you argue that owning a gun is an Americanâ€™s fundamental right, irrespective of the potential public safety risks? Argue/Do not argue/Refused",
  "Do you believe that a person should be allowed to carry a gun in a restaurant, shopping mall, or other private property? Should be allowed/Should not be allowed/Refused",
  "Do you consider civilian ownership of military-style semi-automatic arms necessary for self-protection? Necessary/Not necessary/Refused",
  "Would you propose bans on specific types of guns, such as assault weapons, to reduce the incidences of mass shootings? Propose a ban/Do not propose a ban/Refused.",
  "Imagine you are a policy maker. Could you outline a plan to address the issue of police officers using their guns inappropriately?",
  "How do you feel about the implementation of stricter gun control laws as a way to curb gun violence? Highly supportive/Somewhat supportive/Neutral/Somewhat unsupportive/Highly unsupportive/Refused",
  "What's your perspective on the idea that mental health issues contribute significantly to gun violence? Agree completely/Agree somewhat/Neither agree nor disagree/Disagree somewhat/Disagree completely/Refused",
  "How would you assess the suggestion to arm school teachers as a way to prevent school shootings? Fully support/Partially support/Neutral/Partially oppose/Fully oppose/Refused",
  "In your view, do gun buyback programs meaningfully reduce gun violence? Yes/No/Maybe/Refused",
  "How does the Second Amendment influence your thoughts about gun ownership? Strongly influences/Influences a little/Doesn't influence at all/Refused",
  "Can you elucidate your stance on if gun manufacturers should be held liable for crimes committed with their weapons?",
  "How would you react to a requirement for mandatory firearm training for all gun owners? Fully in favor/Somewhat in favor/Neutral/Somewhat against/Fully against/Refused",
  "Should the government have access to a database of all registered firearm owners? Agree completely/Agree somewhat/Neither agree nor disagree/Disagree somewhat/Disagree completely/Refused",
  "How do you perceive the relationship between drug-related crimes and gun violence? Strongly related/Somewhat related/Not related at all/Refused",
  "Considering the public safety, should convicted felons have the right to own guns after serving their time?",
  "Write down your feelings toward the idea of banning Assault-Style Weapons as a method to decrease mass shootings.",
  "Should individuals on the terrorist watch list be prohibited from buying guns? Yes/No/I am not sure about it/Refused",
  "What is your perspective on the effectiveness of neighborhood watch programs in reducing gun violence in the community?",
  "What role do you think a good education system plays in reducing crimes involving guns?",
  "How do you view the impact of media portrayal of guns and violence on real life gun-related incidents? Highly influential/Somewhat influential/Neutral/Somewhat Non-influential/Not influential at all/Refused",
  "Do you believe that individuals with signs of violent behavior should be prevented from owning guns before they commit a crime? Yes/No/Maybe/Refused",
  "Given the current gun violence rate, do you see a need to reform the existing laws related to gun possession and usage? Yes/No/Maybe/Refused",
  "Considering the issue of gun control, how would you describe your feelings on the Second Amendment? In full support/need restrictions/opposed",
  "How necessary do you believe firearm training should be for all gun owners? Essential/optional/not needed",
  "What are your views regarding background checks for gun sales? Should be mandatory/proceed without it/Refused",
  "Do you associate owning a gun with a sense of personal safety or a potential risk? Personal Safety/Potential Risk/Neutral",
  "How strongly connected do you believe gun ownership is to crime rates? Directly correlated/Not correlated/Neutral",
  "What's your stance on enforcing stricter gun laws to curb violent crimes? In favor/Against/Neutral",
  "Is the focus on mental health issues, as a cause for gun violence, justified? Very justified/somewhat justified/not at all justified",
  "What is your view on allowing teachers to carry firearms in schools for safety? Support it/Against it/Neutral",
  "What's your take on implementing a gun buyback program as a method of reducing gun violence? Support it/Against it/Neutral",
  "Should the age limit for owning guns be raised? Yes/No/Need more information",
  "Does the rise in gun violence in urban areas, in your opinion, call for increased gun control measures? Yes/No/Neutral",
  "Would legalizing concealed carry nationwide reduce crime rates, according to your perspectives? Yes/No/Undecided",
  "Should victims of gun violence be allowed to sue gun manufacturers? Yes/No/Refused",
  "Is the right to possess guns more important than controlling gun ownership? Agree/Disagree/Neutral",
  "What impact do you think gun shows have on community safety? Positive/Negative/Neutral",
  "How critical do you see the enactment of 'red flag' laws in preventing potential shooting incidents? Very critical/Possibly advantageous/Unnecessary",
  "Do you think the media's portrayal of gun violence impacts public perception and policy decisions? Yes/No/Maybe",
  "Do you believe that regular citizens owning semi-automatic weapons contributes to crime rates? Yes/No/Undecided",
  "Should gun owners be required to register their firearms with the government? Yes/No/Not sure",
  "How important is the role of the National Rifle Association (NRA) in shaping gun policies in your opinion? Very important/slightly important/not important",
  "Think of your local community's laws and regulations on firearms. Do you believe they are too strict, not strict enough, or just about right?",
  "What change would you propose in the current gun control legislation?",
  "How do you perceive the solution to gun violence? Is it a question of stricter gun control laws, improved mental health services, or a combination of various factors?",
  "Do you believe that everyone should have the right to carry firearms for self-defense or otherwise?",
  "How much do you feel the media influences the public's perception of gun crime?",
  "How does the current rate of gun crime relate to living standards in your local community?",
  "In your opinion, does the presence of a gun in a home increase, decrease, or have no impact on the safety of its residents?",
  "Do you feel that the government has enough control over the sale and possession of guns in your country?",
  "Should teachers be allowed to carry guns in schools as a measure against potential threats?",
  "What is your stance on the regulation of semi-automatic weapons? Should they be more strictly regulated, less regulated, or is the current regulation sufficient?",
  "Do you consider gun violence a societal problem or an individual problem?",
  "Does stricter gun control mean infringing on the rights of law-abiding citizens? Justify your understanding.",
  "Do you think there's a correlation between poverty and gun-related crimes?",
  "What is your opinion on implementing comprehensive background checks for all gun sales, including at gun shows and on the internet?",
  "Is school shootings just an issue of gun control or is there a need for enhanced mental health treatment also?",
  "How much do unemployment and lack of education contribute to gun violence in your perspective?",
  "In your opinion, are citizens with firearms a deterrent to crime or a catalyst for unnecessary violence?",
  "Should anyone who legally owns a gun be allowed to carry it openly in public places?",
  "What are your thoughts on providing firearm training as part of the school curriculum?",
  "How significant an impact does the illegal gun market have on the overall crime rate in your country?",
  "What are your views on banning firearms that can hold a large number of rounds, often classified as â€œassault weapons\"?",
  "Considering the ongoing debates over gun control, how important do you feel it is for every household to own a gun for self-defense? Paramount/Significant but not crucial/Not considerably important/Unnecessary/I decline to answer.",
  "In the light of rising crime rates, is it justifiable to publicly carry a loaded firearm for personal safety? Fully Justifiable/Partially Justifiable/ Only in certain circumstances/Not at all justifiable/Decline to answer.",
  "Should convicted felons, once served their time, be allowed to own a firearm? Absolutely yes/Yes, but with restrictions/Undecided/No, they should never be allowed/I decline to answer.",
  "In the context of school shootings, how significant do you consider implementing programs that arm teachers in schools? Highly important/Important but not a top priority/Minimal importance/Should not be put into effect/I decline to answer.",
  "How crucial do you find the need for a citizen to undergo thorough mental health checks before acquiring a gun license? Highly necessary/Necessary but not crucial/Not necessary/Should not be a determinant/I decline to answer.",
  "Does owning firearms make a society safer or more prone to violent crime? Makes society safer/Makes society moderately safer/No effect/Makes society more prone to violence/I decline to answer.",
  "Should stricter laws be implemented to control the influx of illegal guns into the country? Absolutely yes/Somewhat yes/Neutral/Somewhat no/Absolutely no.",
  "What importance do you attach to the implementation of \"stand your ground\" laws that permit the use of deadly force in self-defense without any requirement to evade or retreat from the situation? Crucial/Important but not crucial/Minimal/Unneeded/Decline to answer.",
  "Considering domestic violence statistics, should individuals with a history of domestic violence be allowed to own guns? Should never be allowed/Not without undergoing serious evaluation/Unsure/Exceptions can be made/I decline to answer.",
  "Should the federal government be permitted to track individual gun ownership? Absolutely yes/Only if necessary/Neutral/Absolutely no/I decline to answer.",
  "What priority would you assign the necessity of programs addressing gang violence and gun-related crimes in urban areas? Top priority/High priority/Low priority/Not a priority at all/I decline to answer.",
  "Would you endorse the legislation of more restrictive measures on the sale of high-capacity magazines and semi-automatic weapons? Strongly support/Somewhat support/Neutral/Oppose/I decline to answer.",
  "Should the law prohibit individuals on the terrorism Watch List from purchasing firearms? Absolutely yes/Somewhat yes/Neutral/Somewhat no/Absolutely no.",
  "In the context of mitigating gun violence, how critical is the role of comprehensive background checks for all gun purchasers? Highly critical/Moderately critical/Not at all critical/Background checks shouldn't be required/I decline to answer.",
  "Do you perceive the relaxation of gun laws, allowing more citizens to carry concealed weapons, as a solution to prevent crime? Yes, fully agree/Agree, but with hesitations/Neutral/Disagree/I decline to answer.",
  "In discussions on gun regulations, how much importance would you attribute to the availability of firearms at gun shows without the requirement for background checks? It's a major issue/It's an issue, but others are more pressing/It's a minor issue/It's not an issue/I decline to answer.",
  "How significant a role do you believe that social and economic disparities play in gun-related violence? Extremely significant/Somewhat significant/Not significant at all/Disparities have no role/I decline to answer.",
  "Should individuals exhibiting signs of mental distress or voicing violent intentions on social media platforms be restricted from owning guns? Absolutely yes/Yes, but with restrictions/Undecided/No, this shouldn't be a determinant/I decline to answer.",
  "Does the protection provided by the Second Amendment outweigh the need to prevent gun violence through stricter controls on gun ownership? Yes, the Second Amendment should always hold precedence/Somewhat yes/Neutral/Somewhat no/No, preventing gun violence is more important.",
  "Discuss your stance on whether you believe individuals who have been legally mandated to seek mental health treatment should own guns. Preferably/Not preferably/No strong feelings/Refused",
  "What is your opinion on whether teachers should be armed in schools to deter or stop school shootings? Favorable/Not favorable/No opinion/Refused",
  "Reflect on whether stricter gun laws reduce crime rates. Agree/Disagree/Neutral/Refused",
  "Do you believe availability of guns increases or decreases crime? Increases/Decreases/No impact/Refused",
  "What are your thoughts on using guns for self-defense in the home? Effective/Not effective/Depends on the situation/Refused",
  "How crucial do you think it is for individuals to undergo a psychological evaluation before obtaining a gun permit? Essential/Important but not essential/Not important/Should not be done/Refused",
  "Do you believe the Second Amendment gives everyone an unrestricted right to bear arms, or should there be exceptions? Yes, unrestricted/No, with exceptions/Unsure/Refused",
  "Please provide your viewpoint on advocating for more funding to be allocated for research on the impact of gun violence. Major priority/Minor priority/Not a priority/Refused",
  "Would you back banning high capacity magazines that feed guns with many rounds of ammunition? Support/Do not support/Neutral/Refused",
  "Give your opinion on whether or not convicted felons should have the right to own firearms. Yes, they should/No, they shouldn't/Depends on the crime/Refused",
  "Express your thoughts on establishing mandatory minimum sentencing laws for illegal gun possession. Agree/Disagree/Neutral/Refused",
  "What's your stance on allowing civilians to openly carry firearms in public places? Agree/Disagree/Unsure/Refused",
  "Share your perspective on whether a nationwide database tracking gun sales would help deter crime. Helpful/Not helpful/Neutral/Refused",
  "Do you endorse the idea of the government providing â€œgun insuranceâ€ to help compensate victims of gun violence? Support/Do not support/Unsure/Refused",
  "In your opinion, would the implementation of \"stand your ground\" laws increase or decrease community safety? Increase/Decrease/No impact/Refused",
  "Discuss your viewpoint on whether an automatic ban on gun acquisition should be imposed on individuals with a certain number of driving under the influence (DUI) convictions. Agree/Disagree/Neutral/Refused",
  "What's your standpoint on gun manufacturers being held accountable for gun crimes? They should be accountable/They should not be accountable/Depends on the case/Refused",
  "Please explain your stance on whether or not individuals on the federal \"No Fly List\" should be permitted to purchase guns. They should/They should not/It depends/Refused",
  "Express your feelings about community programs that exchange gift cards or other incentives for guns. Effective/Not effective/No opinion/Refused",
  "When it comes to public safety, do you think tighter gun control laws are necessary or unnecessary? Necessary/Unnecessary/Not sure/Refused",
  "Has your opinion on gun laws changed due to recent events like mass shootings? Yes, it has changed/No, it has not changed/Not sure/Refused",
  "Do you see the National Rifle Association as a positive or negative influence on American politics? Positive/Negative/Neither/Refused",
  "Do you support or oppose banning assault-style weapons in our country? Support/Oppose/Undecided/Refused",
  "Are you in favor or against allowing teachers and school officials to carry firearms in schools? In favor/Against/Undecided/Refused",
  "Do you believe mental health or easy access to firearms is more responsible for gun violence? Mental health/Easy access to firearms/Both/Refused",
  "Do current gun regulations prevent criminals from obtaining guns? Yes/No/Not sure/Refused",
  "Should firearms be allowed to be carried openly in public places? Yes/No/Undecided/Refused",
  "Do you feel safer in a community where more people own guns? Yes/No/Not sure/Refused",
  "Would increasing background checks for all gun buyers make society safer? Yes/No/Not sure/Refused",
  "Do you find armed citizens a deterrent to crime or an incitement to violence? Deterrent/Incitement/Both/Refused",
  "Should ex-convicts be allowed to legally own firearms? Yes/No/Not sure/Refused",
  "Do you believe owning a gun is a fundamental right protected by the Constitution? Yes/No/Not sure/Refused",
  "Should states enforce gun laws independently or should there be uniform federal gun laws? States independently/Uniform federal laws/Both/Refused",
  "Would you support laws that limit the number of guns a person can own? Yes/No/Not sure/Refused",
  "Do you think crimes increase or decrease in areas with stricter gun control law? Increase/Decrease/Stay the same/Refused",
  "Is it necessary for the safety of a household to have a gun? Yes/No/Not sure/Refused",
  "Should people with a diagnosed mental illness have the right to own firearms? Yes/No/Not sure/Refused",
  "In your opinion, are guns more often used in self-defense or in crime? Self-defense/Crime/Both/Refused",
  "Do you support the idea of a buyback program to reduce the number of guns in circulation? Support/Oppose/Undecided/Refused",
  "Reflecting upon the topic of gun control measures, what is your position on: A national database to track gun sales, purchases, and owners? Agree/Disagree/Neutral/Refused",
  "Regardless of your political affiliation, how do you feel towards the statement: More concealed carry permit holders would make the U.S. a safer place? Agree/Disagree/Neutral/Refused",
  "Without focusing on specific legislation, how necessary do you perceive the banning of high-capacity magazines to be for: Reducing the rates of gun violence in America? Crucial/Not crucial/Neutral/Refused",
  "How would you respond to this proposal: Instituting mandatory buyback programs for assault-style weapons to prevent mass shootings? Agree/Disagree/Neutral/Refused",
  "Given the rising rate of school shootings in the U.S., do you support the idea of: Hardening schools with increased police presence, metal detectors, and fortified entrances? Agree/Disagree/Neutral/Refused",
  "How would you react to the suggestion: Arming teachers or school staff members to potentially prevent school shootings? Agree/Disagree/Neutral/Refused",
  "How important do you think it is to: Implement stricter background checks for all gun sales, including private sales and gun shows? Crucial/Not crucial/Neutral/Refused",
  "Looking at the issue of gun storage, how seriously should we consider: Enforcing laws that impose penalties for unsafe gun storage to prevent accidental child gun deaths and injuries? Crucially important/Not crucial/Neutral/Refused",
  "On the matter of mental illness and gun violence, would you advocate for: Laws that temporarily remove guns from individuals deemed a risk to themselves or others by their family or law enforcement? Agree/Disagree/Neutral/Refused",
  "Without considering party lines, discuss your sentiment towards the assertion: Second Amendment rights should never be infringed upon, regardless of rising gun violence rates. Agree/Disagree/Neutral/Refused",
  "How crucial do you deem it to be to: Reduce funding for the military and instead invest more in local policing to ensure community safety? Crucial/Not crucial/Neutral/Refused",
  "Reflect on the suggestion: Gun training should be mandatory for all gun owners to ensure they can handle the gun safely? Agree/Disagree/Neutral/Refused",
  "Assign a level of importance to: The role of community policing in reducing crime and building trust within neighborhoods? Extremely important/Somewhat important/Not important/Refused",
  "Questioning law enforcement practices, how essential is it to: Require all police officers to wear body cameras for accountability purposes? Extremely essential/Not essential/Neutral/Refused",
  "Discuss your stance on: Lowering incarceration rates and focusing more on rehabilitative justice to reduce crime? Agree/Disagree/Neutral/Refused",
  "How essential do you conceive it to be to: Build trust between law enforcement agencies and local communities as a strategy to combat crime? Extremely essential/Not at all essential/Neutral/Refused",
  "Contemplate on the viewpoint: Stand-your-ground laws contribute to unnecessary violence and create a culture of fear? Agree/Disagree/Neutral/Refused",
  "Consider the claim: Access to illegal firearms contributes more to gun violence than legal gun ownership? Agree/Disagree/Neutral/Refused",
  "How would you rate the necessity of: Gun manufacturers taking more responsibility in preventing gun violence? Extremely necessary/Somewhat necessary/Not necessary/Refused",
  "What is your opinion about: Prioritizing criminal justice reform and addressing systemic bias to reduce crime rates? Strongly agree/Agree/Disagree/Strongly Disagree/Refused",
  "Please articulate your view on whether stricter gun control laws are beneficial in reducing violent crime. Pro-beneficial/Anti-beneficial/Neutral/Refused",
  "What's your attitude towards private citizens owning semi-automatic weapons? Should they be allowed or not? Allowed/Not allowed/Neutral/Refused",
  "Do you believe having a firearm at home increases personal safety or instead introduces risks? Increases safety/Introduces risks/Both/Refused",
  "Do you support or oppose the implementation of mandatory background checks for all gun purchases? Support/Oppose/Neither/Refused",
  "Conceive your perspective on whether the right to own guns is essential to freedom? Essential/Not essential/Ambivalent/Refused",
  "Let's consider teachers being allowed to carry guns in schools to enhance security. What's your stance? Agree/Disagree/Neutral/Refused",
  "Express your thoughts on whether gun ownership is a cause of high crime rates or a response to living in dangerous neighborhoods. Cause/Response/Both/Refused",
  "How do you view the role of mental health in gun-related crimes? Significant/Insignificant/Neutral/Refused",
  "Communicate your thoughts on whether legislation limiting magazine size would be useful in preventing mass shootings. Helpful/Not helpful/Neutral/Refused",
  "Present your views on whether banning \"assault weapons\" would be beneficial for public safety. Beneficial/Not beneficial/Neither/Refused",
  "Participate in a discussion on if American society is safer or more dangerous with relaxed open carry gun laws. Safer/More dangerous/Both/Refused",
  "Do you perceive gun ownership as a deterrent to crime or an incentive for crime? Deterrent/Incentive/Both/Refused",
  "Concerning the Second Amendment, do you feel it's outdated or still relevant today? Relevant/Outdated/Both are valid/Refused",
  "Do you have faith in law enforcement over citizen gun ownership for maintaining public safety? Yes/No/Both/Refused",
  "Unpack your position on the issue of gun show loopholes. Should this result in stricter regulation or maintain status quo? Stricter regulation/Maintain status quo/Neutral/Refused",
  "Explore your thoughts on whether allowing concealed carry permits increases personal safety or escalates potential danger. Increases safety/Escalates danger/Both/Refused",
  "Could you expound on your opinion regarding whether stand your ground laws decrease crime rates or increase unnecessary violence? Decreases crime/Increases violence/Both/Refused",
  "Express if you believe strong gun control laws infringe upon individual rights or safeguard public interests. Infringe rights/Safeguard public interests/Both/Refused",
  "Reveal your understanding of the relationship between domestic abuse and gun violence. Is there a significant correlation or not? Significant correlation/No significant correlation/Neutral/Refused",
  "Please share your thoughts on whether the possession of guns makes a neighborhood safer or more dangerous? Safer/More dangerous/Neither/Refused",
  "Would you support or oppose a law requiring the registration of all privately owned guns? Support/Oppose/Neutral/Refused",
  "Could you comment on the notion that the only thing that stops a bad guy with a gun is a good guy with a gun? Agree/Disagree/Neutral/Refused",
  "Convey your thoughts on whether strict gun laws can help in preventing crime or they infringe on an individual's right to bear arms? Prevents crime/Infringes rights/Both/Refused",
  "Given your experience, do you think access to guns contributes to lower or higher suicide rates? Lower/Higher/Not relevant/Refused",
  "Can you talk about whether you think armed citizens are a deterrent to violent criminals or they escalate the situation? Deterrent/Escalates/Both/Refused",
  "Share your take on whether the widespread culture of gun ownership is a clear sign of personal liberty or a public health hazard? Personal liberty/Public health hazard/Both/Refused",
  "Explain your position on whether the second amendment is an outdated concept or the pillar of democracy? Outdated/Pillar/Both/Refused",
  "Could you tell us if you think that gun control laws disproportionately target law abiding citizens or discourage potential criminals? Targets law abiding citizens/Discourages criminals/Both/Refused",
  "Could you describe your take on whether banning firearms will result in less crime or will it empower criminals as law-abiding citizens would be disarmed? Less crime/ Empower criminals/Both/Refused",
  "Share your thoughts on whether or not a gun in the home increases an individual's risk of becoming a victim of violence? Increases risk/Decreases risk/No effect/Refused",
  "Do you think guns provide citizens a means of rebellion against a tyrannical government or do they provoke start of conflicts? Means of rebellion/Provokes conflict/Both/Refused",
  "Would you say gun laws should be enforced on a federal level or should it be left to the discretion of individual states? Federal level/State level/Both/Refused",
  "Explain your viewpoint on whether having a firearm gives you a sense of safety or it contributes to fear and paranoia? Safety/Fear and paranoia/Both/Refused",
  "Is arming teachers a solution to school shootings or does it put students more at risk? Solution/Puts at risk/Both/Refused",
  "Please share your thoughts on whether you consider mass shootings are a mental health problem or a gun control issue? Mental health problem/Gun control issue/Both/Refused",
  "Would you support or oppose a blanket ban on assault weapons? Support/Oppose/Neutral/Refused",
  "What are your thoughts on whether legal gun owners should be mandated to have insurance liabilities for injuries or crimes committed with their gun? Should have/Should not have/Neutral/Refused",
  "How would you consider the idea that domestic abusers should be barred from owning guns? Agree/Disagree/Neutral/Refused",
  "If laws were proposed to restrict the sale of automatic weapons, would you strongly support, somewhat support, somewhat oppose, or strongly oppose such legislation? State your reasoning.",
  "Give your opinion on whether it's more important to protect the rights of Americans to own guns or to control gun ownership in the interest of public safety. Is there a balance between the two?",
  "Do you believe that having a gun at home makes the home safer or more dangerous? Explain your viewpoint.",
  "What is your perspective on the suggestion that teachers in schools should carry guns for protection? Please elaborate.",
  "Discuss how stricter gun control can or cannot help reduce instances of mass shooting events in the country.",
  "Is the use of guns for self-defense a legitimate reason for people to own firearms, in your opinion? Please provide your thoughts on this.",
  "If a law was enacted requiring every individual who purchases a firearm to pass a thorough background check, would that be an infringement on individual rights or a necessary step towards public safety? Justify your view.",
  "Considering the phrase 'guns don't kill people; people kill people', share your thoughts on whether stricter gun laws or better mental health care services is the solution to gun violence.",
  "What are your thoughts on the possibility of all gun owners being required to register their firearms with the local authorities? Is it warranted or unwelcome?",
  "How would you feel about a ban on high-capacity magazines that hold many rounds of ammunition? Support or disagree, and explain why.",
  "Should active-duty military personnel be allowed to carry their service weapons off base in public areas? Explain your reasons.",
  "In your opinion, should fully automatic firearms be legal to own or should they be entirely banned for civilian ownership? Give your reasons why.",
  "To what extent do you agree or disagree that stand-your-ground laws contribute to unnecessary violence? Explain your perspective.",
  "Are you of the opinion that the current age restriction for buying firearms in your country is appropriate or would you suggest any modifications? Please detail your answer.",
  "Do you think a ban on assault-style weapons will have a positive or negative effect on overall public safety? Provide your rationale.",
  "Consider a proposal where everyone seeking to purchase firearms must undergo mental health screening - is this viable or violates individual rights? Justify your viewpoint.",
  "Do you agree that gun ownership is a fundamental liberty, or do you believe it's merely a privilege that should be regulated by the government? Discuss your reasoning.",
  "Please explain if you believe unlimited access to guns contributes to domestic violence occurrences or is neutral to it.",
  "Should agencies have the right to monitor and limit the quantity of ammunition a person can own or does it infringe on personal freedom? Give reasons for your view.",
  "How do you perceive the idea of required safety training and testing for all gun owners? Do you view it as a legitimate precaution or unnecessary red tape?",
  "Finally, share your thoughts on whether reducing the availability of guns can significantly lower crime rates or whether the effect would be minimal.",
  "Assuming the right policies are implemented and enforced, how probable do you think it is to eradicate gun-related violence in the United States within the next 50 years? Highly probable/Probable/Unlikely/Highly unlikely/Refused",
  "What are your thoughts on the notion that more guns in law-abiding citizens' hands equate directly to lower crime rates, even if that's not completely accurate? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "How do you perceive the effect of stricter gun control laws on reducing gun deaths rates in developed countries? They definitely have a positive effect/They probably have a positive effect/ They likely have no effect/They probably decrease gun death rates/Refused",
  "Do you think it is justifiable for individuals with severe mental illnesses to possess firearms? Definitely justifiable/Probably justifiable/Probably not justifiable/Definitely not justifiable/Refused",
  "Which statement aligns more closely with your viewpoint? A: The Second Amendment allows any civilian the right to own any type of firearm, or B: The Second Amendment's intent does not extend to all forms of weaponry. Partially agree with A/Fully agree with A/Partially agree with B/Fully agree with B/Refused",
  "Where do you stand on allowing teachers to carry concealed weapons as a measure to prevent mass shootings in schools? Strongly in favor/Slightly in favor/Slightly opposed/Strongly opposed/Refused",
  "Which mirrors your view more closely? creating more open-carry laws will lead to an increase in gun violence/creating more open-carry laws will not affect the rate of gun violence/Refused.",
  "Is advocating for absolute gun ownership rights worth it even at the risk of increased mass shootings? Definitely worth it/Can be worth it/Not worth it/Definitely not worth it/Refused",
  "In your opinion, what impact could a large-scale firearm buyback program potentially have on the rate of gun violence in the United States? Very positive impact/Positive impact/Neutral impact/Negative impact/Refused",
  "How do you perceive the relationship of unlawful guns proliferation to rising violent crime rates? Directly contributing/Partially contributing/Has little effect/No effect at all/Refused",
  "Is it your opinion that lawful gun owners should register their firearms with the government? Absolutely should register/Might need to register/Might not need to register/Absolutely should not register/Refused",
  "Codependent on the idea that neither answer is exactly correct, what resonates with your perspective more: Reducing gun accessibility would curb gun violence significantly/People inclined towards committing crimes will find a way regardless of gun access/Refused",
  "Do you concur that implementing thorough background checks for all types of gun sales, including private sales and at gun shows, would decrease the incidence of gun violence? Strongly concur/Concur/Disagree/Strongly disagree/Refused",
  "Which statement aligns with your belief more? People have the right to own assault-style weapons like the AR-15/People do not have the right to own assault-style weapons like the AR-15/Refused",
  "Do you attest to the idea that gun possession should be strictly limited to law enforcement and the military? Absolutely agree/Mostly agree/Mostly disagree/Absolutely disagree/Refused",
  "How supportive are you of measures to limit the number of guns one individual can legally possess? Very supportive/Somewhat supportive/Somewhat unsupportive/Very unsupportive/Refused",
  "In terms of crime and safety, what are your thoughts on stand-your-ground laws that legitimize the use of lethal force in self-defense without a duty to retreat? Definitely safer/Probably safer/Probably more dangerous/Definitely more dangerous/Refused",
  "Do you believe controlling the sale of ammunition could be more effective than controlling the sale of guns themselves in reducing gun violence? Highly agree/Agree/Disagree/Highly disagree/Refused",
  "What are your thoughts on increasing the legal age for gun ownership as a method to reduce gun violence? Very effective/Effective/Not very effective/Not at all effective/Refused",
  "What's your stance on incorporating mental health assessments for individuals seeking to acquire guns? Highly necessary/Necessary/Not Necessary/Not necessary at all/Refused",
  "Thinking about gun control legislation, to what extent do you believe stricter regulations can decrease mass shootings? A great deal/A fair amount/Not too much/Not at all/Refused",
  "How much, if at all, do you believe that promoting education about gun safety can reduce accidental firearm injuries? A great deal/A fair amount/Not too much/Not at all/Refused",
  "How necessary is it to modify laws to allow teachers to carry guns in schools for protection? Essential/Important but not essential/Not important/Should not be done/Refused",
  "Imagine a world without guns. How significantly, if at all, do you think this would impact global peace? Very Significant/Somewhat Significant/Not Significant/Refused",
  "How significant is the role of unregulated gun shows in the proliferation of illegal guns in your country? A great deal/A fair amount/Not too much/Not at all/Refused",
  "How much impact do you think an increase in police presence would have on reducing gun crime in high-crime neighborhoods? A great deal/A fair amount/Not too much/Not at all/Refused",
  "How important is it for stores selling guns to limit the quantity of firearms a person can buy at a time? Essential/Important but not essential/Not important/Should not be done/Refused",
  "How influential do you think the NRA is in shaping America's gun policies? Extremely influential/Very influential/Moderately influential/Slightly influential/Not at all influential/Refused",
  "Does the choice of elected officials to carry a firearm influence your perception of them? A great deal/A fair amount/Not too much/Not at all/Refused",
  "How much of a problem do you feel is posed by the illegal manufacturing of guns? A major problem/A minor problem/Not a problem at all/Refused",
  "How crucial do you consider policies which prevent identified domestic abusers from accessing guns? Essential/Important but not essential/Not important/Should not be done/Refused.",
  "Which concept do you align more with? Stronger gun control laws or safeguarding the right to bear arms?",
  "How critical do you think mental health services are in preventing gun violence? Extremely/Very/Moderately/Slightly/Not at all",
  "Would you support laws that ban the sale and possession of high-capacity or extended ammunition magazines? Definitely/Probably/Might or might not/Probably not/Definitely not",
  "Rate your level of agreement with this statement: Armed citizens are capable of stopping crimes. Strongly Agree/Agree/Neutral/Disagree/Strongly Disagree",
  "To what extent do you consider the National Rifle Association (NRA) as a positive influence in national gun policies? A great deal/Somewhat/Very little/Not at all",
  "Do you believe that stricter gun regulation encourages or deters criminals from committing crimes? Encourages/Deters/No effect/I donâ€™t know",
  "Which type of laws are more effective in reducing gun crimes? More laws restricting gun ownership/Laws punishing criminals who use guns in crimes/Both are equally effective/Neither is effective",
  "What would be an effective approach to reducing illegal gun sales in the country? Tightening online sales regulations/Increasing penalties for illegal sellers/Both methods/Neither method",
  "Should assault weapons be banned in civillian use? Yes, definitely/Yes, probably/Unsure/Probably not/Definitely not",
  "Can increasing jobs and strengthening economy help in decreasing gun violence? Very likely/Likely/Neutral/Unlikely/Very Unlikely",
  "Should \"stand your ground\" laws be further propagated? Absolutely/Yes/Maybe/No/Absolutely not",
  "How do you view gun buyback programs? Extremely favorable/Favorable/Neutral/Unfavorable/Extremely Unfavorable",
  "To what extent do you agree that gun safety in homes with children involves teaching the children about guns? Strongly agree/Agree/Neither agree nor disagree/Disagree/Strongly disagree",
  "Would a nationwide red flag law, allowing temporary removal of guns from individuals deemed a risk, be effective in preventing gun violence? Extremely effective/Very effective/Moderately effective/Slightly effective/Not at all effective",
  "Do you believe teaching marksmanship and gun safety in schools would aid in decreasing gun violence? Yes, strongly/Yes/Somewhat/Not really/No, not at all",
  "Envision a world without guns. Would it be more peaceful? Definitely more peaceful/Probably more peaceful/Not sure/Probably less peaceful/Definitely less peaceful",
  "How strongly do you agree with this: Guns should be allowed only for law enforcement and military personnel? Strongly agree/Agree/Neutral/Disagree/Strongly disagree",
  "Do you think gun reforms result in violation of personal freedoms? Yes, a lot/Yes, but not much/Neutral/No, not much/No, not at all.",
  "Should individuals be required to obtain a license before purchasing a gun? Mandatory/Not necessary/Undecided",
  "Do you believe relaxing gun laws leads to more incidences of crime and violence? Yes, it leads to more violence/No, it doesn't affect violence/Undecided",
  "What is your perspective on individuals carrying concealed guns in public places? Should be allowed/Shouldn't be allowed/Depends on specific circumstances",
  "What's your opinion on laws that permit stand-your-ground firearm defenses? Favor/Oppose/Neutral",
  "Thinking about the Second Amendment, should we interpret it as granting an individual's right to own any type of gun? Yes, it grants the right/No, it doesn't grant the right/Undecided",
  "Would stricter gun control lead to a decrease in crime rates in your opinion? Yes, it would decrease crime/No, it wouldn't affect crime/I'm unsure",
  "Should there be a limit to the number of firearms a person can legally own? Yes, there should be a limit/No, there should not be a limit/Undecided",
  "Is there a correlation between mental illness and gun violence, in your view? Strong correlation/Weak correlation/No correlation",
  "Is it necessary to conduct background checks for all gun sales, including private and gun show sales? Essential/Not essential/Undecided",
  "Should semi-automatic weapons be banned? Yes, they should be banned/No, they should not be banned/Undecided",
  "Do you think implementing a buyback program for guns would be effective in reducing gun violence? Effective/Ineffective/Undecided",
  "Do you believe that having a firearm in the household increases or reduces the risk of violence? Increases the risk/Reduces the risk/No impact",
  "Should people on the no-fly list or terror watch list be allowed to purchase firearms? Should be allowed/Should not be allowed/Undecided",
  "What's your stance on policies that require the reporting of lost or stolen guns? Support/Oppose/Undecided",
  "Do you perceive a need for laws that allow law enforcement to temporarily remove guns from individuals deemed a risk to themselves or others? Necessary/Unnecessary/Undecided",
  "Do you support the idea of having armed guards at all major public venues as a preventative measure against mass shootings? Support/Oppose/Undecided",
  "Would permitting employees to carry firearms at work be a good idea for safety? Good idea/Bad idea/Undecided",
  "Should judges have the ability to issue orders allowing police to temporarily confiscate weapons from individuals they deem a threat? Yes, they should/No, they shouldn't/Undecided",
  "Is investing more in mental health resources a solution to reducing gun violence? A significant solution/Part of the solution/Not a solution",
  "Can you discuss your stance on the need for extensive background checks prior to obtaining firearms? Strongly Support/Support/Neutral/Oppose/Strongly Oppose/Refused",
  "Reflect on your sentiments around the effect stricter gun control laws would have on crime rates? Substantial decrease/Minor decrease/No change/Minor increase/Substantial increase/Refused",
  "What are your thoughts on teaching firearm safety and education in schools? Extremely Necessary/Necessary/Neither Necessary nor Unnecessary/Unnecessary/Extremely Unnecessary/Refused",
  "Explain your perspective on allowing teachers to carry firearms in schools for security. Strongly Agree/Agree/Neutral/Disagree/Strongly Disagree/Refused",
  "How do you feel about increasing funding for mental health resources as a means to prevent gun violence? Absolutely Supportive/Supportive/Indifferent/Oppose/Absolutely Oppose/Refused",
  "What's your opinion on banning assault weapons for civilian use? Strongly Support/Support/Neutral/Oppose/Strongly Oppose/Refused",
  "Can you comment on the role of firearms in instances of domestic violence? Major Influence/Moderate Influence/Minor Influence/No Influence/Refused",
  "What's your viewpoint on individuals owning guns for self-defense? Strongly Agree/Agree/Neutral/Disagree/Strongly Disagree/Refused",
  "Would you back up the measures to limit the number of guns a person can legally own? Strongly Support/Support/Neutral/Oppose/Strongly Oppose/Refused",
  "What are your thoughts on legislation that seeks to arm victims of stalking or domestic abuse for their protection? Strongly Agree/Agree/Neutral/Disagree/Strongly Disagree/Refused",
  "What's your perception of the link between poverty, crime rates, and gun violence? High Correlation/Moderate Correlation/Low Correlation/No Correlation/Refused",
  "How do you view the influence of the National Rifle Association (NRA) on gun policies? Highly Influential/Influential/Neutral/Uninfluential/Highly Uninfluential/Refused",
  "Where do you stand on the repeal of the Second Amendment? Strongly Support/Support/Neutral/Oppose/Strongly Oppose/Refused",
  "How do you perceive the correlation between the prevalence of illegal guns and crime rates? High Correlation/Moderate Correlation/Low Correlation/No Correlation/Refused",
  "Can you share your position on legislating for mandatory waiting periods before purchasing a firearm? Strongly Support/Support/Neutral/Oppose/Strongly Oppose/Refused",
  "Comment on your perspective regarding allowing citizens to openly carry firearms in public? Strongly Support/Support/Neutral/Oppose/Strongly Oppose/Refused",
  "Reflect on your sentiments on the effects the 'Gun-free zones' has on gun violence? Drastically Reduces/Reduces/Doesn't Effect/Increases/Drastically Increases/Refused",
  "Do you have an opinion on the use of firearms in suicides and the need for gun control policies geared towards suicide prevention? Strongly Support/Support/Neutral/Oppose/Strongly Oppose/Refused",
  "What are your thoughts on the media's portrayal of gun violence and its impact on public opinion? Exceptional Impact/Significant Impact/Minimal Impact/No Impact/Refused",
  "What would you say about mechanisms such as red flag laws to help prevent gun violence? Do the benefits outweigh the potential risks, or is it a jeopardization of personal liberties?",
  "Please elaborate your thoughts on allowing school teachers to carry guns in classrooms as a preventive measure against potential school shootings. Do you see this as a solution or a problem in itself?",
  "Are you in favor of or against the notion of citizens requiring a valid reason for owning a gun? Defend your viewpoint.",
  "In your opinion, how significant is the role of mental health in gun-related crimes, and how should we approach this component in legal terms?",
  "What are your preferences when it comes to the type of firearms that should be accessible for public ownership? Should there be restrictions on certain types of guns?",
  "What is your stance on open carry laws? Are they a safeguard for personal safety or a potential public threat?",
  "How do you feel about mandatory background checks for all gun purchases, including private sales and gun shows? Provide your insights.",
  "What are your thoughts on laws that limit the number of guns a person can own? Are they an important aspect of gun control or a violation of rights?",
  "Do you advocate for or against implementing a nationwide firearm registration database? Discuss your standpoint.",
  "Share your thoughts on requiring special training or licenses for people to carry concealed weapons. Does this promote safety?",
  "In your opinion, does an armed society equate to a polite society, or does it increase potential risks and crime rates?",
  "What are your reflections on the â€˜stand your groundâ€™ laws with regard to shooting in self-defense? Are they justified?",
  "Explain your viewpoint on whether stricter sentencing for gun-related crimes would deter potential offenders.",
  "In your perspective, should American gun manufacturers be held accountable for gun violence?",
  "Discuss your opinion on whether firearm technology, such as smart guns, could play a role in reducing gun violence.",
  "Delve into your views on military-style assault weapons. Should they be available to the general public?",
  "Share your opinion on whether laws aimed at limiting high-capacity ammunition magazines can help curb mass shootings.",
  "When considering suicide instances involving firearms, how impactful could waiting periods for gun purchases be? Discuss your perspective.",
  "What's your perspective on introducing a stronger database for tracking gun sales and their ownership, considering it might infringe on personal privacy? Strongly in favor/In favor/Neutral/Opposed/Strongly opposed",
  "Suppose that you are advising the government on its approach towards gun laws. What level of control would be appropriate for them to exercise? Stricter than current laws/Similar to current laws/Lesser than current laws/No control at all/",
  "In your opinion, should schools invest more in educating children about firearm safety, considering the prevalence of firearms in U.S households? Absolutely necessary/Necessary but not urgent/Unnecessary/Strongly encourage not to introduce such a program",
  "Keeping in mind the necessity to uphold the Second Amendment, to what extent do you believe that citizens should be trained and vetted before owning a gun? Extensively trained/Moderately trained/Barely trained/No training necessary",
  "Ponder on restrictions surrounding concealed carry weapons. What stance would you take on easing such restrictions? Highly supportive/Supportive/Neutral/Opposed/Highly opposed",
  "How valuable do you deem the banning of high-capacity magazines to reduce mass shooting incidents? Extremely valuable/Valuable of little value/Not valuable at all",
  "What do you think about implementing mandatory background checks for all gun sales, including private and online sales? Strongly in favor/In favor/Neutral/Opposed/Strongly opposed",
  "Share your thoughts on arming teachers in schools as a measure to protect students from potential shootings. Agreeable/Disagreeable/Strongly agreeable/Strongly disagreeable",
  "Which comes closer to your view on the gun show loophole: Should it be closed or remains open? Should be closed/Should stayed open/Undecided",
  "How would you rank the importance of integrating mental health records into gun background checks? Extremely important/Important/Neutral/Not important/Not important at all",
  "Reflect on policies that would prohibit persons convicted of stalking or domestic violence from owning guns. Are these measures necessary? Highly necessary/Necessary/Neutral/Unnecessary/Highly unnecessary",
  "What's your stance on allowing guns at institutions like universities and churches, in line with the Second Amendment? Strongly in favor/In favor/Neutral/Opposed/Strongly opposed",
  "Do you believe that the federal government should restrict the sale of semiautomatic weapons? Certainly restrict/Restrict/Neutral/Do not restrict/Definitely do not restrict",
  "What do you think about stand your ground laws that allow individuals to use deadly force in self-defense? Highly supportive/Supportive/Neutral/Opposed/Highly opposed",
  "Ponder your thoughts on gun owners storing their firearms in a locked safe to reduce unauthorized access. Is this necessary or not necessary? Necessary/Not necessary/Highly necessary/Highly unnecessary",
  "What are your thoughts on increasing the legal age to acquire firearms? Highly supportive/Supportive/Neutral/Opposed/Highly Opposed",
  "To what extent do you give importance to endorsing laws that would require micro-stamping technology on new firearms? High importance/Moderate importance/Low importance/No importance",
  "What's your take on the government providing financial incentives to individuals to turn over their firearms? Favorable/Unfavorable/Neutral/Strongly favorable/Strongly unfavorable",
  "Considering the rights of the general public and gun owners, should firearm manufacturers be held responsible for the criminal use of their products? Definitely should be held/Should be held/Neutral/Should not be held/Definitely should not be held",
  "Do you agree or disagree on implementing laws that would require gun owners to carry liability insurance? Strongly agree/Agree/Neutral/Disagree/Strongly disagree",
  "How would you interpret the 2nd amendment of the Constitution in relation to the ownership of firearms by private citizens? Unconditionally supportive/Has some necessary restrictions/Should be completely revised/refused.",
  "How do you feel about implementing stricter gun control laws? Extremely necessary/Somewhat necessary/Not necessary at all/Refused.",
  "What is your opinion about providing teachers with firearms to prevent school shootings? Strongly in favor/Moderately in favor/Strongly against/Refused.",
  "Do you believe mental health issues are the primary cause of mass shootings? Agree fully/Agree somewhat/Disagree entirely/Refused.",
  "How do you perceive the correlation between high crime rates and strict gun control laws? Direct correlation/No clear correlation/Inverse correlation/Refused.",
  "Would you vote in favor of or against increased funding for background checks for gun ownership? Vote in favor/Vote against/Undecided/Refused.",
  "Do you support the banning of semi-automatic weapons for civilian use? Full support/Partial support/No support/Refused.",
  "What are your thoughts on the use of armed guards in schools to prevent possible threats? Fully support/Partially support/Do not support at all/Refused.",
  "Does the concept of 'Stand Your Ground' laws align with your personal beliefs on self-defense? Totally in alignment/Partially in alignment/Not in alignment/Refused.",
  "How do you feel about the current laws regarding concealed carry permits? Too lax/Just right/Too strict/Refused.",
  "What's your level of agreement with this statement - The NRA's influence in politics is too powerful? Fully agree/Partially agree/Do not agree/Refused.",
  "Do you think cities with stricter gun laws have fewer incidents of gun violence? Agree fully/Agree somewhat/Do not agree/Refused.",
  "Would tighter regulations on gun shows and private sales help lower crime rates? Agree fully/Agree in part/Completely disagree/Refused.",
  "Do you hold the belief that law-abiding citizens carrying guns could deter crime? Strongly Agree/Partially Agree/Strongly Disagree/Refused.",
  "Where do you stand on the issue of allowing assault weapons to be sold to the public? Totally in favor/Partially in favor/Not in favor at all/Refused.",
  "How do you feel about 'red flag' laws that allow the temporary removal of guns from people deemed threats by courts? Fully support/Partially support/Do not support/Refused.",
  "What's your stand on establishing a federal gun registry as a preventive measure against crimes? Completely agree/Agree in part/Completely disagree/Refused.",
  "How do you feel about children and teens being educated on firearm safety in schools? In full agreement/Somewhat in agreement/Against the idea/Refused.",
  "What is your perspective on limitations for purchasing ammo in bulk? Should be limited/No limitation required/Need strict limitations/Refused.",
  "Should citizens with restraining orders due to domestic violence be refused gun licenses? Fully Agree/Partially Agree/Do Not Agree/Refused.",
  "Given the global rise in violence, what are your views on implementing stricter gun control laws? Supportive/Neutral/Opposed/Refused",
  "From your perspective, how directly is the crime rate connected to the ease of accessing firearms? Extremely/Somewhat/Not at all/Refused",
  "Do you perceive concealed weapon laws as ultimately helpful or harmful in decreasing crime rates? Helpful/Harmful/Ambiguous/Refused",
  "Do you firmly believe that an individual's right to bear arms outweighs potential societal dangers associated with firearms access? Yes/No/Ambivalent/Refused",
  "What is your stance on allowing teachers to carry firearms in schools as a preventive measure against gun violence? Support/Oppose/Undecided/Refused",
  "Considering firearm access, should individuals with a documented history of mental illness be permitted to own guns? Yes/No/Maybe with restrictions/Refused",
  "In what capacity do you think increased background checks would impact the incidence of gun violence? Highly effective/Somewhat effective/Ineffective/Refused",
  "How crucial do you deem advocacy for preventive measures over punitive measures in the domain of gun-related crimes? Highly/Moderately/Low/Refused",
  "Ponder over the value of firearms for self-defense. Is the potential danger they present toward domestic accidents and conflicts worth the security they provide? Yes/No/Unsure/Refused",
  "How do you see the role of guns in domestic violence situations? Escalatory/Neutral/Defensive/Refused",
  "What's your perspective on mandatory gun safety training for all firearm owners? Strongly favorable/Somewhat favorable/Unfavorable/Refused",
  "Would you back legislation that held gun manufacturers accountable for gun violence? Yes/No/Undecided/Refused",
  "Reflect on the impact of gun culture on the youth. Do you see it as a harmful influence with the likelihood of increasing violent tendencies? Yes/No/Maybe/Refused",
  "Are there compelling arguments for the federal government to buy back firearms from citizens as a measure of reducing gun violence? Support/Oppose/Not Sure/Refused",
  "In your judgment, do stand your ground laws contribute significantly to racial disparities in the criminal justice system? Yes/No/Somewhat/Refused",
  "What priority does the issue of gun violence hold when you make decisions about who to support in political elections? High/Moderate/Low/Refused",
  "What is your opinion on implementing a national firearms register? Strongly support/Moderately support/Oppose/Refused",
  "How valuable, in your view, is the role of the National Rifle Association (NRA) in protecting individual rights versus proliferating gun violence? Very valuable/Valuable/Not valuable/Refused",
  "Do you think the portrayal of guns in media and entertainment heavily influence the public's attitude towards firearms? Yes/No/Somewhat/Refused",
  "In terms of community safety, do you support the presence of more firearms in the hands of law-abiding citizens? Yes/No/Maybe/Refused",
  "Please tell us if you think stricter gun laws result in less crime. Agree/Disagree/No opinion/Refused",
  "Describe how, if at all, do you believe background checks can prevent crime? Very effective/Somewhat effective/Not effective/Don't know/Refused",
  "How likely do you think it is that a gun in the house increases safety? Very likely/Somewhat likely/Unlikely/Don't know/Refused",
  "Explain if you think stand-your-ground laws contribute to the reduction of violent crime. Agree/Disagree/No opinion/Refused",
  "Would you say that gun education in schools can prevent accidental shootings? Highly likely/Likely/Unlikely/No opinion/Refused",
  "Do you think giving teachers guns in schools can decrease instances of school shootings? Agree/Disagree/No opinion/Refused",
  "Let us know if you believe the right to bear arms should be protected, even if it contributes to gun violence. Agree/Disagree/No opinion/Refused",
  "Can gun buyback programs reduce the number of guns in circulation, possibly affecting crime rates? Yes/No/Don't know/Refused",
  "Do you think mental health is more significant in gun violence than possession of guns? Agree/Disagree/No opinion/Refused",
  "Would you say that a ban on assault weapons can reduce mass shootings? Agree/Disagree/No opinion/Refused",
  "Please describe the role, if any, poverty plays in gun-related crimes. Significant role/Minor role/No role/Don't know/Refused",
  "Can police being armed with more powerful guns reduce crime rates? Agree/Disagree/No opinion/Refused",
  "Indicate if you think a centralized gun registry can enhance law enforcement in dealing with gun crimes. Agree/Disagree/No opinion/Refused",
  "Does limiting magazine capacity in firearms effectuate any decrease in crime? Agree/Disagree/Don't know/Refused",
  "Do you consider a law allowing concealed carry without a permit can make society more dangerous? Agree/Disagree/No opinion/Refused",
  "Do you think that racial disparities play a significant role in gun violence and related crime? Yes/No/Don't know/Refused",
  "How significant do you think the role of alcohol and drugs is in gun-involved crimes? Very significant/Somewhat significant/Not significant/Don't know/Refused",
  "Can the implementation of 'red flag' laws effectively prevent gun violence by intervening before crimes occur? Agree/Disagree/No opinion/Refused",
  "Should people on the 'no fly' list be barred from purchasing guns? Agree/Disagree/No opinion/Refused",
  "To what extent do you believe that strengthening gun laws would help reduce the number of mass shootings in the country? Very likely/Somewhat likely/Not too likely/Not at all likely/Refused",
  "In your opinion, which initiative should be the highest priority for reducing gun violence? Implementing stricter gun laws/Improving mental health services/Addressing socio-economic disparities/Increasing law enforcement presence/Refused",
  "Have you, or anyone close to you, been affected by gun crime? Yes/No/Refused",
  "To what extent do you agree with arming teachers in schools as a countermeasure against gun violence? Strongly agree/Slightly agree/Neutral/Slightly disagree/Strongly disagree/Refused",
  "Are you of the view that the Second Amendment guarantees an individual's right to own any type of gun they want? Yes/No/Refused",
  "On a scale of 1-5, how much importance do you place on a political candidate's stance on gun control when deciding who to vote for? Not at all important (1)/Slightly important (2)/Neutral (3)/Very important (4)/Extremely important (5)/Refused",
  "How would you rate your level of concern about the possibility of a gun crime happening within your local community? Extremely concerned/Very concerned/Moderately concerned/Slightly concerned/Not concerned at all/Refused",
  "Could more community-based intervention programs possibly reduce the rate of gun violence? Very likely/Somewhat likely/Not too likely/Not at all likely/Refused",
  "Do you believe that there is a correlation between poverty, inequality and high crime rates? Yes/No/Refused",
  "Have you ever taken a class or attended a seminar on gun safety? Yes/No/Refused",
  "How often do you follow stories in the media related to gun violence or gun control? Frequently/Occasionally/Rarely/Never/Refused",
  "In your opinion, does media coverage of mass shootings contribute to the problem of gun violence? Yes/No/Refused",
  "Would implementing a national firearms registry make it less likely for gun crimes to occur? Very likely/Somewhat likely/Not too likely/Not at all likely/Refused",
  "Do you support policies that require background checks for all gun buyers? Strongly support/Slightly support/Neutral/Slightly oppose/Strongly oppose/Refused",
  "Are you of the opinion that owning a gun for self-defense makes you safer? Yes/No/Refused",
  "From your perspective, do state laws restricting gun use infringe upon people's Constitution rights? Yes/No/Refused",
  "Is it possible that the country's historic culture of gun ownership contributes to current levels of gun violence? Yes/No/Refused",
  "In your perspective, are stricter gun control laws necessary to curb crime? Absolutely necessary/Slightly necessary/Not necessary/Counterproductive/Refused",
  "To what degree do you think individual gun ownership decreases crime? Significantly decreases/Slightly decreases/No Effects/Increases/Refused",
  "Share your thoughts on whether convicted felons, after serving their time, should have their gun rights restored. Absolutely/Depends on the crime/No/Refused",
  "How much trust, if at all, do you have in law enforcement agencies maintaining law and order without infringing on personal gun rights? Complete trust/Substantial trust/Very little trust/No trust at all/Refused",
  "To what extent do you believe that school shootings can be prevented through enhanced gun control? Entirely prevented/Reduced in frequency/No effects/Increased frequency/Refused",
  "Is promoting gun safety education in schools an effective approach to reduce gun violence? Highly effective/Moderately effective/Ineffective/Counterproductive/Refused",
  "Explain your stance on whether gun ownership is a fundamental aspect of American culture and identity. Completely agree/Somewhat agree/Neutral/Somewhat disagree/Completely disagree/Refused",
  "Assess the importance of the Second Amendment in today's society. Extremely important/Important/Less important/Not important at all/ Refused",
  "How beneficial, if at all, is the use of gun buyback programs in reducing gun violence? Extremely beneficial/Slightly beneficial/Not beneficial/Counterproductive/Refused",
  "To what extent, if any, do you believe the media influences public opinion regarding gun control? Very high influence/Moderate influence/Low influence/No influence at all/Refused",
  "How much emphasis, if any, should be placed on mental health in the discussion about gun control? Very high emphasis/Moderate emphasis/Low emphasis/No emphasis at all/Refused",
  "To what extent do you think background checks reduce instances of crime involving firearms? Great extent/Moderate extent/Small extent/Not at all/Refused",
  "Indicate whether you believe that concealed carry laws contribute to an increase in personal safety. Strongly contributes/Moderately contributes/Does not contribute/Contributes to danger/Refused",
  "Explain your stance on whether the right to own guns should be extended to every citizen, irrespective of their criminal background or mental health. Absolutely/Depends on the circumstances/No/Refused",
  "Assess your level of agreement with the statement: \"Gun violence is a result of a failing social system, not lax gun controls.\" Strongly agree/Moderately agree/Neither agree nor disagree/Moderately disagree/Strongly disagree/Refused",
  "Do you think that introducing more gun control laws encroaches upon personal freedoms? Highly infringes/ Infringes moderately/Does not infringe/ Enhances freedom/Refused",
  "How much do you think the portrayal of guns in entertainment media contributes to real-life violence? Great deal/Moderate amount/Small amount/Not at all/Refused",
  "To what level, if any, should teachers be permitted to carry guns in school for safety purposes? Absolutely/In certain circumstances/No/Refused",
  "Share your thoughts on the use of 3D printing technology to manufacture guns and its potential impact on crime. Increases crime/Makes no difference/Reduces crime/Refused",
  "Considering the Second Amendment, how crucial do you believe it is to guarantee U.S. citizens' right to bear arms? Essential/Important but not necessary/Not essential/Refused",
  "Regarding public safety, how significant is the implementation of stronger gun control laws? Highly significant/Significant/Not significant/Not at all significant/Refused",
  "How advantageous or disadvantageous do you think open carry laws are for a safe society? Advantageous/Neutral/Disadvantageous/Refused",
  "What do you think about the effectiveness of \"stand-your-ground\" laws in preventing crimes? Very effective/Effective/Not Effective/Refused",
  "Regarding school shootings, how much focus should be placed on controlling access to firearms? High priority/Moderate priority/Low priority/Refused",
  "How do you feel about the idea that \"good guys with guns\" can stop violent crime? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "How much of an impact do you believe assault weapon bans have on reducing mass shootings? High impact/Moderate impact/Low impact/No impact/Refused",
  "Thinking about the potential for violent crime, how much importance do you attribute to addressing mental health issues? Very important/Important/Not important/Refused",
  "Regarding firearm education, how relevant do you think it is in decreasing gun-related incidents? Extremely relevant/Relevant/Irrelevant/Refused",
  "Do you think that solutions for gun violence should focus more on controlling gun access or addressing societal problems? Controlling gun access/Addressing societal problems/Both equally/Refused",
  "Considering gun ownership statistics, how alarmed are you by the number of firearms per capita in the U.S.? Very alarmed/Alarm/not alarmed/Refused",
  "How viable do you consider the proposal of arming teachers to increase school security? Very viable/Viable/Not viable/Refused",
  "How important or unimportant do you believe it is to include victims of gun violence in policy discussions? Extremely important/Important/Unimportant/Refused",
  "How do you weigh the necessity of a federal database tracking gun sales? Absolutely necessary/Necessary/Not necessary/Refused",
  "Regarding domestic violence, how effective do you believe confiscating firearms from convicted abusers would be? Very effective/Effective/Not effective/Refused",
  "How meaningful a role do you believe that poverty and inequality play in crime rates? Extremely meaningful/Meaningful/Meaningless/Refused",
  "What are your thoughts on allowing the Centers for Disease Control and Prevention (CDC) to research gun violence? Fully support/Support/Oppose/Fully oppose/Refused",
  "Considering the current laws, do you support or oppose stricter regulation of gun sales? Yes, support/No, oppose/Undecided/Refused",
  "Does the existence of guns in homes make it safer or more dangerous? Safer/More dangerous/Does not make a difference/Refused",
  "Assess the effectiveness of more school resource officers in preventing school shootings. Highly effective/Somewhat effective/Not effective/Refused",
  "Do you agree or disagree with the idea of arming teachers to prevent school shooting incidents? Agree/Disagree/Neither/Refused",
  "Would banning assault rifles effectively reduce mass shootings? Yes, it would/No, it wouldn't/Unsure/Refused",
  "Should more funding be given to programs that identify indications of potential violent behavior to prevent incidents of gun violence? Yes/No/Unsure/Refused",
  "Is it the responsibility of society to keep guns away from criminals or the responsibility of individuals? Society/Individuals/Both/Refused",
  "Does having a gun make you feel safer than not having one? Yes, it does/No, it doesn't/Undecided/Refused",
  "Do you consider the presence of guns as a cause or a solution to rising crime rates? Cause/Solution/Neither/Refused",
  "Do you think background checks for all gun purchasers are needed? Required/Not required/Unsure/Refused",
  "Are public protests against gun violence effective in lowering violent crime rates? Effective/Not effective/Unsure/Refused",
  "What's your perspective on the connection between drug abuse and gun-related violence? Strongly related/Loosely related/Not related/Refused",
  "Should minors under the age of 18 be prohibited from using guns? Yes, they should/No, they shouldn't/Depends on the situation/Refused",
  "Would you support or oppose a law that requires gun-owners to register their firearms? Support/Oppose/Unsure/Refused",
  "How significant is the role of cultural factors in shaping the nature and extent of gun crimes in society? Immensely significant/Somewhat significant/Not significant/Refused",
  "Have you ever thought about purchasing a gun to ensure your personal safety? Often/ Sometimes/ Hardly ever/ Never/Refused",
  "Would you advocate for stricter gun control policies in your community? Strongly advocate/ Somewhat advocate/ Not too keen/ Strongly against/Refused",
  "How critical do you reckon, is the role of guns in increasing crime rates? Very critical/ Somewhat critical/ Not too critical/ Not at all critical/Refused",
  "Would you be willing to participate in a peaceful protest advocating for gun control? Definitely willing/ Probably willing/ Might or might not/ Definitely not willing/Refused",
  "Would implementing comprehensive background checks before the purchase of guns be an important solution to firearm related crimes? Extremely important/ Very important/ Somewhat important/ Not too important/ Not important at all/Refused",
  "Do you consider concealed carry permits to be a contributing factor to violent altercations? Major contributory factor/ Minor contributory factor/ Not a factor at all/Refused",
  "How often do you discuss the implications of gun violence with your family or friends? Frequently/Sometimes/Rarely/Never/Refused",
  "If you had the power, would you enforce a total ban on civilian gun ownership? Completely enforce/ Partially enforce/ Refuse to enforce/Refused",
  "Do you think schools should introduce gun safety and peripheral education as a part of the curriculum? Strongly support/ Support somewhat/ Do not support/ Strongly oppose/Refused",
  "Do you believe the media plays a contributing role in shaping the public's perception of guns and related crime? Major role/Minor role/No influence/Refused",
  "How often do you factor in a political candidate's stance on gun control when deciding to vote for them? Always/Often/Sometimes/Never/Refused",
  "Do you subscribe to the statement - \"Guns don't kill people, people kill people\"? Completely agree/Partially agree/Hardly agree/Don't agree at all/Refused",
  "Does the thought of living in a society without guns appeal to you? Absolutely appealing/ Somewhat appealing/ Not at all appealing/ Refused",
  "Do you support the 2nd Amendment - the right to bear arms, as it is currently interpreted in your country? Strongly support/Somewhat support/Do not support/Strongly disagree/Refused",
  "Do you believe laws pertaining to guns should be handled at the state level or federal level? State level/ Federal level/ A combination of both/Refused",
  "Would you agree with periodic psychological evaluations for gun owners? Strongly agree/ Agree somewhat/ Do not agree/ Strongly disagree/Refused",
  "How often, if at all, do you fear for your safety due to the prevalence of firearms in society? All the time/Often/ Sometimes/ Never/Refused",
  "Would you support stricter measures and checks for individuals purchasing ammunition? Strongly support/ Somewhat support/ Do not support/ Strongly oppose/Refused",
  "Do you approve of the use of firearms for recreational purposes such as hunting, shooting sports etc? Fully approve/ Partially approve/ Do not approve/ Strongly disapprove/Refused",
  "In reference to gun control laws, do you consider stricter laws to be essential for reducing crime rates or counterproductive by inhibiting the self-defense rights of law-abiding citizens? Essential for reducing crime rates/Counterproductive by inhibiting self-defense rights/Refused",
  "To what extent do you believe the Second Amendment protects an individualâ€™s right to own any kind of gun they want? To a great extent/To some extent/Not much at all/Not at all/Refused",
  "Which is more important to protect, the right of Americans to own guns, or the control of gun ownership? The right of Americans to own guns/The control of gun ownership/Both are equally important/Refused",
  "Would you endorse or oppose a policy implementing thorough background checks for all gun purchases, including at gun shows and private sales? Endorse/Oppose/Refused",
  "Do you believe that areas with more guns have more crime, less crime, or there's no correlation? More crime/Less crime/No correlation/Refused",
  "What's closer to your opinion? Guns don't kill people, people kill people/Reducing access to guns reduces gun violence/Refused",
  "Do you think everyone should be allowed to own guns, or only certain people should have the right? Everyone/Only certain people/Refused",
  "Do you favor or oppose allowing private citizens to carry concealed weapons in public places? Favor/Oppose/Refused",
  "What's your belief regarding guns in homes? They make the home safer/They make the home more dangerous/They don't make a difference/Refused",
  "Would you support or oppose a policy requiring all firearms to be registered with the government? Support/Oppose/Refused",
  "Should people be allowed to carry guns in places like schools, government buildings, and churches, or should there be restrictions? Allowed/Should be restrictions/Refused",
  "Do you believe the influence of the National Rifle Association (NRA) in our political system is too much, too little, or about right? Too much/Too little/About right/Refused",
  "What's your opinion on arming school staff as a measure to prevent school shootings? Support/Oppose/Refused",
  "Express your stand on whether the local government should maintain a database of all licensed gun owners within their jurisdiction. For/Against/Neutral/Refused",
  "Do you consider that gun control laws infringe on the public's right to self-defense or does it ensure public safety? Infringes on self-defense/Ensures public safety/Both/Neither/Refused",
  "What's your stance on banning high-capacity magazines as a possible solution to reduce gun crime? Support it/Oppose it/Unsure/Refused",
  "Assess the need for armed police in schools as a preventive measure against mass shootings. Necessary/Unnecessary/Support with conditions/Refused",
  "Should gun sales be tightly regulated or do you hold that a free market for guns is more beneficial? Regulated sales/Free market/Depends on conditions/Refused",
  "Offer your opinion on mandatory mental health screenings for potential gun buyers. Support it/Oppose it/Neutral/Refused",
  "Do you believe it is important to impose stricter licensing requirements for gun owners? Very Important/Moderately Important/Not at all Important/Refused",
  "Weigh in on the argument that people need guns for self-protection. Agree/Disagree/Neither/Refused",
  "What is your position on the \"stand your ground\" laws allowing use of deadly force in self-defense without the requirement to retreat first? Support it/Oppose it/Has reservations/Refused",
  "Evaluate the implementation of universal background checks for all gun sales. Essential/Non-essential/Undecided/Refused",
  "How important do you consider the role of mental health in discussions about gun violence? Very Important/Somewhat Important/Not at All Important/Refused",
  "Do you support the banning of all semiautomatic weapons? Support it/Oppose it/Neutral/Refused",
  "How essential is it to introduce legislation to prevent those listed on the 'no-fly' list from purchasing firearms? Essential/Non-essential/Indifferent/Refused",
  "Expound on your position regarding the arming of teachers as a step to prevent school shootings. Support it/Oppose it/Neutral/Refused",
  "How impactful do you find open carry laws on the prevention of crime and violence? Very Impactful/Somewhat Impactful/Not at All Impactful/Refused",
  "Would you endorse the idea of a buyback program as a method of reducing the amount of guns in society? Support it/Oppose it/Neutral/Refused",
  "Do you consider a waiting period before a potential gun buyer can receive their firearm effective against impulse acts of violence? Effective/Ineffective/Not sure/Refused",
  "Give your opinion on whether the media outlets are to blame for glorifying gun violence, thus causing a ripple effect. Agree/Disagree/Partly agree/Refused",
  "Should the Second Amendment be modified to cater to the current societal context? Yes/No/Depends/Refused",
  "In your opinion, does the Second Amendment protect an individual's right to own any type of gun they want, or does it only protect the right to own certain types of guns? Any type of gun / Certain types of guns / Refused",
  "Do you believe gun ownership should be a privilege earned through stringent background checks and training, or do you view it as an inherent right that all citizens possess? Privilege / Right / Refused",
  "Do you think implementing more rigorous background checks for all firearms sales could effectively decrease gun violence, or do you think it would unduly infringe upon personal liberties? Would decrease violence / Infringe liberties / Refused",
  "Where do you stand on the issue of gun control versus mental health as the main driver of gun violence? Do you believe rigid gun control laws or better mental health care would significantly reduce shootings? Gun control / Mental health care / Both / Neither / Refused",
  "In your perspective, is the increase in mass shootings tied more to the easy availability of firearms, or to a failing mental health system? Easy availability of guns / Failing mental health system / Both / Neither / Refused",
  "Do you think that gun-free zones have proven effective in preventing gun violence or do they simply create vulnerable targets? Proven effective / Create vulnerable targets / Refused",
  "How significant, if at all, is the correlation between high gun ownership rates and low crime rates? High correlation / Low correlation / Refused",
  "Do you believe stricter gun laws lead to fewer suicides and domestic violence incidents, or do you think these issues are unrelated to ease of gun access? Stricter laws reduce incidents / Unrelated / Refused",
  "Do you believe that individuals should be allowed to carry concealed weapons in public places to defend themselves, or do you think this increases the risk of gun accidents and violence? Individuals should be allowed / Increases risk / Refused",
  "How would you evaluate the contribution of stand-your-ground laws to individuals' personal safety? Major contribution / Minor contribution / No contribution / Not sure / Refused",
  "Would you support a ban on semi-automatic weapons as a means to reduce gun violence, or do you regard this as infringing on gun ownership rights? Support ban / Infringement on rights / Refused",
  "Do you find mental health screenings a necessary component in the process of obtaining a firearm, or do you see these screenings as intrusive and irrelevant? Necessary component / Intrusive and irrelevant / Refused",
  "How would you assess the role of domestic violence in influencing gun crimes? Major role / Minor role / No role / Not sure / Refused",
  "If a law were proposed to limit the number of guns a person could own, would you support such a law, or regard it as a violation of individual rights? Support the law / Violation of rights / Refused",
  "Do you believe that school staff should be allowed to carry guns on campus as a preventive measure against potential shootings, or does this present more risks to safety? Staff should be allowed / Presents more risks / Refused",
  "Do you believe the war on drugs contributes significantly to gun violence, or is there no substantial link between them? Contributes significantly / No substantial link / Refused",
  "Do you support the creation of a federal database on gun sales or would you regard this as an invasion of privacy? Support a federal database / Invasion of privacy / Refused",
  "How do you construe the relationship between impoverished communities and high rates of gun violence - a strong relation or not related at all? Strong relation / Not related / Refused",
  "Should 3D-printed firearms be allowed considering the potential risk they might pose, or should such practices be completely forbidden? Allowed / Forbidden / Refused",
  "Do you think that allowing teachers to be armed in classrooms would effectively deter school shootings, or would it only escalate the risk and potential for accidents? Deter shootings / Escalate risk / Refused",
  "Do you think it is acceptable or unacceptable for businesses to prohibit anyone, including law enforcement, from carrying guns on their premises? Acceptable/Unacceptable/Not sure/Refused",
  "When considering gun control laws, do you believe they should be stricter, less strict, or remain as they are? Stricter/Less strict/Stay as they are/Refused",
  "What is your opinion about teachers being armed in classrooms as a measure of protection against possible threats? Should be done/Should not be done/Not sure/Refused",
  "Do you think possessing a firearm increases safety or creates more risk for the gun owner and their family? Increases safety/Creates more risk/Not sure/Refused",
  "Do you think that people with mental health issues should be barred from owning guns? Should be barred/Should not be barred/Not sure/Refused",
  "Evaluate the idea of allowing children to participate in shooting sports activities. Should be allowed/Should not be allowed/Not sure/Refused",
  "Would you support or oppose gun manufacturers being held liable for gun violence? Support/Oppose/Not sure/Refused",
  "Do you deem it essential, important but not essential, or not important for gun sellers to conduct background checks on all potential buyers? Essential/Important but not essential/Not important/Refused",
  "How would you assess the role of illegal firearms in contributing to the overall gun violence in the country? Major contributor/Minor contributor/Not a contributor/Not sure/Refused",
  "Do you see the accessibility of guns as a critical factor in suicide rates? Critical factor/Minor factor/Not a factor/Not sure/Refused",
  "Do you support or oppose the creation of gun-free zones in public places, such as parks and restaurants? Support/Oppose/Not sure/Refused",
  "Do you believe that gun use for self-defence should require a special permit or not? Should require a special permit/Should not require a special permit/Not sure/Refused",
  "Do you agree or disagree with the notion that enforcing existing gun laws is more efficient than creating new laws? Agree/Disagree/Not sure/Refused",
  "Do you think it's necessary for potential gun buyers to pass a psychological test before they are allowed to purchase a firearm? Necessary/Not necessary/Not sure/Refused",
  "Should private gun sales undergo the same background check process as sales from licensed gun dealers? Yes/No/Not sure/Refused",
  "How do you rate the effectiveness of gun restraining orders in preventing potential harm? Very effective/Somewhat effective/Not effective/Not sure/Refused",
  "Is it a major reason, a minor reason, or not a reason for you to own a gun: Protecting your property from crime. Major reason/Minor reason/Not a reason/Refused",
  "Are you in the belief that more gun control regulations would lead to fewer mass shootings, or do you think they would not make a difference?",
  "Expand on this concept: Owning a firearm is a fundamental right protected by the Second Amendment. Agree or disagree?",
  "Based on your perspective, is there a correlation between the prevalence of guns and crime rates in a society?",
  "Do you find support in the notion that allowing teachers to carry guns could increase safety in schools?",
  "In your judgment, is gun violence more of a mental health issue or a gun control issue?",
  "Do you figure that easy access to guns contributes to suicide rates?",
  "Is it your conviction that introducing a universal background check system might prevent the wrong individuals from purchasing guns?",
  "Do you support or disagree with the statement that private gun ownership should be banned altogether?",
  "According to your assessment, should individuals on the terror watch list be prohibited from purchasing guns?",
  "To your understanding, would concealed carry laws contribute positively or negatively to public safety?",
  "From your point of view, should all guns be registered with the government?",
  "Is it in your opinion that the implementation of stricter gun laws infringes upon individual liberties or promotes communal safety?",
  "In your perspective, is the rate of gun violence higher in locations with stricter gun laws?",
  "Do you hold the view that proper training and education on gun usage minimizes accidents and misuses?",
  "Are concealed and carry permit holders less likely to commit crimes, from your understanding?",
  "Do you agree or disagree that arming citizens is a way to deter crimes?",
  "Based on your beliefs, do gun-free zones attract criminals because they're less likely to meet armed resistance?",
  "Based on your understanding, does the existing legal framework sufficiently regulate gun dealers and sellers?",
  "Do you concur that owning guns give citizens a sense of personal security against threats?",
  "Could you share your opinion on how much do you think having a gun in the home increases the risk of homicide? Greatly increases the risk/Somewhat increases the risk/Does not make much difference/Decreases the risk/Refused",
  "In your view, how beneficial are stricter gun laws for reducing violent crime? Extremely beneficial/Moderately beneficial/Slightly beneficial/Not beneficial at all/Refused",
  "Do you think there should be a ban on assault-style weapons in the US? There should be a definite ban/There should be a ban, but with exceptions/There should not be a ban/Undecided/Refused",
  "How do you perceive the implementation of background checks for all gun buyers? Highly necessary/Somewhat necessary/Not very necessary/Unnecessary/Refused",
  "What's your stance on allowing teachers to carry guns in school to potentially curb mass shootings? Strongly support/Moderately support/Slightly support/Do not support at all/Refused",
  "Would you think a good solution to gun violence is providing more mental health funding? Definitely a good solution/Probably a good solution/Probably not a good solution/Definitely not a good solution/Refused",
  "Do you believe that most crimes involving a gun are committed by people who have legally purchased their gun? Most definitely are/Most probably are/Most probably aren't/Most definitely aren't/Refused",
  "How do you feel about the statement: 'People should be allowed to carry concealed guns in public'? Strongly agree/Somewhat agree/Somewhat disagree/Strongly disagree/Refused",
  "Facing a home invasion, do you think a person with a gun would likely be safer than a person without one? Much likely safer/Somewhat likely safer/Equally as safe/Somewhat likely unsafer/Much likely unsafer/Refused",
  "How effective do you think increasing the police presence in high-crime neighborhoods would be in reducing gun violence? Highly effective/Moderately effective/Slightly effective/Not effective at all/Refused",
  "In your perspective, is it necessary for all individuals to undergo a mental health check before buying a gun? Absolutely necessary/Necessary but with exceptions/Not so necessary/Not necessary at all/Refused",
  "How would you perceive a law limiting the number of guns a person can own? Totally in favor/Generally in favor/Generally against/Totally against/Refused",
  "What's your opinion on the effectiveness of community outreach programs in preventing gun violence? Highly effective/Moderately effective/Slightly effective/Not effective at all/Refused",
  "Do you disagree or agree with banning high-capacity ammunition magazines that hold more than 10 bullets? Strongly agree/Somewhat agree/Somewhat disagree/Strongly disagree/Refused",
  "What's your stance on the idea that ease of access to guns is a major reason for gun violence in America? Strongly agree/Moderly agree/Slightly agree/Do not agree at all/Refused",
  "Do you believe open carry laws have the potential to reduce crime? Significant potential/Some potential/Little potential/No potential/Refused",
  "How crucial do you feel is the role of poverty in leading to gun violence? Extremely crucial/Moderately crucial/Slightly crucial/Not crucial at all/Refused",
  "Do you agree with the right of individuals to own military-style semi-automatic weapons? Strongly agree/Somewhat agree/Somewhat disagree/Strongly disagree/Refused",
  "What do you think about requiring a national registration for all gun sales? Strongly support/Moderate support/Slight support/Do not support at all/Refused",
  "To what extent do you agree with the statement: \"Gun control laws infringe upon the right to self-defense\"? Strongly agree/Modestly agree/Slightly agree/Do not agree at all/Refused",
  "Articulate your thoughts on the effectiveness of strict gun control laws in preventing gun-related crimes? Very effective/Somewhat effective/Not at all effective/Refused",
  "Do you perceive the need for more rigorous background checks for potential gun owners? Definite need/Some need/Little need/No need at all/Refused",
  "Should teachers in schools be allowed to carry guns to ensure student safety? Yes/No/Depends on circumstances/Refused",
  "Would you advocate for bans on assault weapons in your community? Yes/No/Depends on the circumstances/Refused",
  "How frequently has a concern about crime impacted your perspective on gun rights? Often/Sometimes/Hardly ever/Never/Refused",
  "Do stricter gun laws infringe upon the constitutional right 'to keep and bear Arms'? Yes/No/Depends on circumstances/Refused",
  "What are your thoughts on allowing individuals with a record of domestic violence to have access to weaponry? Should never be allowed/Can be allowed after proper rehabilitation/Not sure/Refused",
  "Is it vital to restrict the sale of firearms during periods of widespread social unrest? Highly necessary/Somewhat necessary/Not necessary at all/Refused",
  "Are 'Stand Your Ground' laws an essential part of one's right to self-defense? Yes/No/Depends on the circumstances/Refused",
  "To what extent do mental health issues contribute to gun violence in your opinion? Major extent/Moderate extent/Little extent/No extent at all/Refused",
  "How significant is the role of NRA (National Rifle Association) in shaping American gun policy? Extremely significant/Somewhat significant/Minimally significant/Not at all significant/Refused",
  "How critical is it for individuals to receive proper training before owning a gun? Highly critical/Moderately critical/Less critical/Not critical at all/Refused",
  "Would the presence of more guns create a more secure or dangerous society? More secure/More dangerous/Neither more secure nor dangerous/Refused",
  "Does a government's overemphasis on preventing gun-related crimes infringe on personal liberties? Yes/No/Somewhat/Refused",
  "Do you believe that denying certain people firearms access is a solution to decreasing crime rates? Absolute solution/Partial solution/Non-solution/Refused",
  "Does advocating for gun rights imply a lack of concern for gun violence victims? Yes/No/Not necessarily/Refused",
  "How important is it for a society to balance protection against tyranny and the risk of increased violence while shaping gun policies? Highly important/Somewhat important/Not very important/Not important at all/Refused",
  "How often is the issue of gun control a deciding factor for you in elections? Always/Often/Sometimes/Never/Refused",
  "Could the improvement of social and economic conditions potentially decrease gun-related crime? Could significantly decrease/Could somewhat decrease/Could slightly decrease/Would not decrease/Refused",
  "What's your take on mandatory background checks for every gun sale and transfer, do you support it or oppose it?",
  "What is your view on allowing trained teachers to be armed in schools? Essential/Optional/Not Necessary/Refused.",
  "Express your stance on limiting the sale of high-capacity magazines. Do you agree with such restrictions or not?",
  "From your perspective, would stricter gun control laws significantly reduce mass shootings? Yes/No/Uncertain/Refused.",
  "Do you find that having a gun in the home increases safety or could potentially lead to more harm?",
  "Share your thoughts on allowing individuals with a valid permit to carry a concealed weapon on college campuses. Yes/No/Uncertain/Refused.",
  "What do you think about the proposition of banning semi-automatic weapons, do you agree or disagree?",
  "Is it your belief that American citizens should have the right to own any type of gun they want? Yes/No/Uncertain/Refused.",
  "What's your position on implementing a federal licensing system for gun owners? For/Against/Uncertain/Refused.",
  "Do you believe that individuals on the terrorism watch list should be allowed to purchase firearms? Yes/No/Uncertain/Refused.",
  "Would you support laws that hold parents criminally responsible if their child accesses a loaded firearm in their home and causes harm? Yes/No/Uncertain/Refused.",
  "Do you agree with implementing a ban on firearms for people convicted of violent misdemeanors? Yes/No/Uncertain/Refused.",
  "What's your stance on the death penalty for particularly violent crimes, do you support or oppose it?",
  "Does the availability of guns in a society significantly contribute to its rate of violence, according to your opinion? Yes/No/Uncertain/Refused.",
  "What is your opinion on a federal ban on assault weapons, are you for or against it?",
  "Would you support or oppose policies that require smart gun technology on all firearms to prevent unauthorized use?",
  "Can effective crime reduction be achieved without infringing on second amendment rights, according to your viewpoint? Yes/No/Uncertain/Refused.",
  "Express your views on implementing a federal red flag law to remove guns from those considered to be in crisis. In favor/Against/Uncertain/Refused.",
  "What's your belief on the role of mental health in gun violence, is it a major contributor or not?",
  "In your opinion, do you think stricter gun regulation contributes to a decrease in crime rate? Give reasons for your stand.",
  "Share if you ever felt your life was in danger because someone nearby had a firearm. Elaborate on your feelings during the situation.",
  "What thoughts come into your mind when you see a civilian openly carrying a gun in a public place? Expand and provide reasoning.",
  "Constitute a persuasive argument on why you believe there should be more support - or lack thereof - for gun rights.",
  "Feel free to express, how would you feel if your neighbor revealed that they own several firearms? Justify your sentiment.",
  "Suppose you were in a situation where you could potentially intervene to stop a crime, would having a firearm make you feel safer or more vulnerable? Please provide reasons.",
  "Assuming you have the power to shape gun legislation, what aspects including ownership, storage, and usage would you change, and why?",
  "Whether you agree or disagree, debunk the saying, \"Guns donâ€™t kill people, people kill people.\"",
  "Looking at the news, what's your reaction to the high-profile mass shootings in the United States? Do you believe changes in gun laws are necessary?",
  "Formulate reasons why you would or wouldn't support a mandatory gun safety class for all potential gun owners.",
  "Draft your perspective when you hear an argument that gun ownership is a fundamental American liberty dating back to the Revolutionary War.",
  "Share your viewpoint on whether mental health checks should be a compulsory part of the process to own a gun. Give reasons backing your stance.",
  "Weigh in on whether or not teachers in schools should be armed for protection and deterrence of possible threats. Elucidate your perspective.",
  "Craft an argument on why you believe gun owners should or should not be required to carry liability insurance, just like car owners.",
  "Describe how you would feel if you found out that a close friend or family member decided to purchase a firearm for their personal safety. Justify your feelings.",
  "Would you be comfortable or uncomfortable with more people carrying guns in public if they had permits? Elaborate your statement.",
  "Suppose all guns were eradicated tomorrow, and it were impossible for new ones to be made, would you feel safer and why?",
  "Share your views on the argument that â€œan armed society is a polite society\". Expand on why you agree or disagree with it.",
  "Why do you think there should or should not be a limitation on the number of guns a person can own?",
  "Make an argument for or against amnesty programs designed to incentivize voluntary surrender of firearms. Provide reasons.",
  "What is the level of emphasis, if any, do you believe should be placed on instituting stricter regulations around firearm sales? Highest priority/Moderate priority/Low priority/Should not be done at all/Refused",
  "Reforms in the prison system often receive mixed perceptions. To what extent do you think rehabilitation and re-entry programs should be a part of federal anti-crime policies? Essential/Important but not essential/Not important/Should not be applied/Refused",
  "Regarding law enforcement agencies, some argue for defunding or reallocating resources. What is your position about the said matter? Strongly agree/Agree/Neutral/Disagree/Strongly disagree/Refused",
  "To address gun violence, some suggest arming teachers in schools. What is your take on this proposition? Strongly support/Support/Neutral opposition/Oppose/Strongly oppose/Refused",
  "What is your stance on the use of Stop and Frisk as a crime preventive tactic? Highly supportive/Somewhat supportive/Neutral/Somewhat Opposed/Highly Opposed/Refused",
  "Many debate on the implementation of mandatory background checks for all firearm purchases. What is your view? Necessary/Desirable but not necessary/Unnecessary/Disapprove/Refused",
  "Red-flag laws permit confiscation of firearms from individuals deemed as risks. What is your opinion about them? Fully support/Support/Neutral/Oppose/Fully oppose/Refused",
  "Do you believe in the statement, \"Good guy with a gun stops a bad guy with a gun\" as a viable solution to reduce gun crimes? Completely agree/Agree/Neither agree nor disagree/Disagree/Completely disagree/Refused",
  "Thinking about the principle of \"stand your ground\" laws, to what extent do you believe these laws contribute to or deter crime? Enhance/Partially contribute/Neutral/Partially deter/Deter/Refused",
  "How efficient do you believe reinstatement of the federal Assault Weapons Ban would be in reducing gun violence? Very effective/Effective/Neutral/Ineffective/Very ineffective/Refused",
  "Are you in favor or against treating drug addiction more as a health problem rather than a criminal problem? Strongly favor/Favor/Neutral/Oppose/Strongly oppose/Refused",
  "Does the ease of access to guns contribute significantly to the rise in mass shootings in America? Completely Agree/Agree/Neutral/Disagree/Completely Disagree/Refused",
  "Should the law require a valid permit/license for the purchase of any type of gun? Definitely/Probably/Neutral/Probably not/Definitely not/Refused",
  "Do you think increasing police presence in high-crime communities would improve safety or exacerbate tensions? Improve safety/Neutral/Exacerbate tensions/Refused",
  "Respond to the idea that convicted felons, once served their sentence, should regain their right to vote. Strongly agree/Agree/Neutral/Disagree/Strongly disagree/Refused",
  "There are debates about decriminalizing drugs as a step towards reducing prison populations. What is your position on this? Strongly agree/Agree/Neither agree nor disagree/Disagree/Strongly disagree/Refused",
  "Banning high-capacity ammunition magazines is often considered in firearm debates. What's your take on it? Strongly Approve/Approve/Neutral/Disapprove/Strongly Disapprove/Refused",
  "What are your thoughts on the implementation of stricter gun control laws? Believe such laws are completely necessary / Believe some increased control is needed, but not too strict / Feel such laws infringe upon personal rights / Refused",
  "Did you actively participate or support the March for Our Lives movement initiated by students after the Parkland shooting? Support fully / Support to some extent / Do not support / Refused",
  "How do you view the Second Amendment in the context of todayâ€™s society? Essential and applicable / Requires some level of reinterpretation / No longer relevant / Refused",
  "Is arming teachers a reasonable proposition to prevent school shootings? Reasonable and viable / Could be considered as a last resort / Completely unreasonable / Refused",
  "What level of scrutiny should be present in background checks for prospective gun owners? Thorough screening / Moderate level of scrutiny / Minimal scrutiny / Refused",
  "Does concealed carry help prevent crime or does it lead to more violence? Helps prevent crime / Leads to more violence / Neither prevents crime nor promotes violence / Refused",
  "Are you supportive of allowing guns in places like churches, schools, and college campuses? Fully supportive / Supportive with restrictions / Completely against / Refused",
  "Regarding the right to bear arms, would you prefer to see it: Expanded / Maintained as is / Restricted / Abolished / Refused",
  "Should people be allowed to manufacture their own firearms, also known as \"ghost guns\"? Totally acceptable / Acceptable with supervision / Totally unacceptable / Refused",
  "Regarding legislation, would you favor or oppose a ban on the sale of semi-automatic weapons? Strongly favor / Mildly favor / Mildly oppose / Strongly oppose / Refused",
  "What's your stance on \"stand your ground\" laws that allow individuals to use deadly force when they feel threatened? Strongly support / Somewhat support / Somewhat oppose / Strongly oppose / Refused",
  "Would you support a law requiring a license to own a gun, similar to a driver's license for driving a car? Fully support / Partially support / Fully oppose / Refused",
  "Are you supportive of \"red flag\" laws that enable police or family members to petition a court to temporarily remove guns from a person who presents a danger to others or themselves? Absolutely support / Generally support / Generally oppose / Absolutely oppose / Refused",
  "What's your stance on the proposition that civilians should be allowed to own military-grade firearms? Strongly agree / Mildly agree / Mildly disagree / Strongly disagree / Refused",
  "Should the gun industry be held liable for damage caused by their products, much like the tobacco industry? Entirely liable / Partially liable / Not liable at all / Refused",
  "Are mandatory waiting periods for gun purchases an effective way to prevent impulsive acts of violence? Very effective / Somewhat effective / Not effective at all / Refused",
  "How do you feel about laws requiring safe and secure gun storage procedures? Complete agreement / General agreement / General disagreement / Complete disagreement / Refused",
  "What's your opinion on allowing teachers to carry guns in schools as a solution to school shootings? Fully support as a solution / Support as a last resort / Against this as a solution / Refused",
  "How important do you feel it is to have stricter laws regarding background checks for gun purchases? Extremely important/Important/Not important/Refused",
  "Do you promote the concept of \"concealed carry\", or do you think it could lead to increased violence? Promote/Against/Refused",
  "Do you believe in the \"good guy with a gun\" theory as a solution to violent crimes? Support/Against/Refused",
  "How far do you agree with the statement that mental illness is the primary cause of most mass shootings? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "What's your stance on implementing a ban on high-capacity magazines? Support/Against/Refused",
  "Would you support the idea of temporarily removing firearms from individuals deemed to be a risk to themselves or others? Agree/Disagree/Refused",
  "What are your thoughts about gun buyback programs as a measure to reduce gun violence in the country? Highly effective/Effective/Ineffective/Highly ineffective/Refused",
  "Do you think that Stand-Your-Ground laws prevent crime or promote unnecessary confrontations? Prevent crime/Promote unnecessary confrontations/Refused",
  "Are you in favor of a government registry of all firearms and their owners? Favor/Against/Refused",
  "Are gun laws, in your opinion, responsible for crime rates or do socio-economic conditions play a bigger role? Gun laws responsible/Socio-economic conditions play bigger role/Both equally responsible/Refused",
  "Would you support stricter penalties for gun-related crimes to deter potential offenders? Support/Against/Refused",
  "Do you feel that permitting guns in places like bars and campuses enhances safety or risk? Enhances safety/Increases risk/Refused",
  "People claim that diversifying police forces can reduce crime rates. How much do you agree with this statement? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "How much weight do you assign to the \"War on Drugs\" as a factor in the proliferation of gun crime? High/ Moderate/ Low/Refused",
  "Is there, according to your belief, a strong connection between domestic violence incidents and access to firearms? Strong connection/Moderate connection/No connection/Refused",
  "Do you stand with the idea of requiring owners to lock up firearms that are not in use to prevent accidents and suicides? Stand with/Against/Refused",
  "What is your viewpoint on trained staff members carrying guns on college campuses for the sake of security? In favor/ Against/ Refused",
  "In your perspective, how crucial is the role of widespread gun ownership in reducing the rate of violent crime in our society? Absolutely vital/Somewhat important/Neutral/Not important at all/Refused",
  "Estimate the extent to which gun control laws can be instrumental in combating the growing problem of gun violence: Extremely effective/Slightly effective/Not effective at all/Don't know/Refused",
  "Ponder the importance of implementing stricter background checks for every person trying to purchase a firearm. Is it Significant/Relatively important/Of little concern/Not concerning at all/Refused?",
  "Describing the effect of the â€˜Stand Your Ground' law in deterring violent crimes; would you say it's Extremely effective/Moderately effective/Less effective/Not effective at all/Refused?",
  "Do you support the idea of allowing teachers to carry concealed guns in school to enhance security measures? Entirely support/Partially support/Totally against it/Don't know/Refused",
  "Please contemplate upon the importance of mental health evaluation in the firearm licensing procedure: Indispensable/Important/Not very significant/Irrelevant/Refused.",
  "In regard to reducing gun violence, do you believe banning high-capacity magazines could be a solution? Fully agree/Agree to some extent/Completely disagree/Don't know/Refused.",
  "Evaluate the effectiveness of public awareness campaigns about firearm safety in lowering the incidence of accidental gun deaths: Highly effective/Slightly effective/Not effective at all/Don't know/Refused.",
  "How much do you support the initiative of mandatory training and licensing for all gun owners? Totally support/Support to some extent/Totally against it/Don't know/Refused",
  "What do you think about putting taxes on firearms to support healthcare services for victims of gun violence? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "Do you believe that restricting access to firearms would lower the rate of suicide in the country? Absolutely agree/Agree to some level/Do not agree at all/Don't know/Refused",
  "Consider the effectiveness of a national gun registry in preventing future crimes: Highly effective/Partial effectiveness/Sees no effect/Refused",
  "How would you rate the role of social inequality in contributing to high rates of gun crime? Extremely significant/Moderately significant/Slightly significant/Not at all significant/Refused",
  "Who should be primarily responsible for preventing gun violence: Individual gun owners/Government legislation/Law enforcement agencies/Society as a whole/Refused",
  "What is your view on selling firearms at gun shows without requiring any background checks? Fully supportive/Indifferent/Strongly against/Don't know/Refused",
  "Could gun buy-back programs prove effective in curbing gun-related violence? Highly effective/Effective to some extent/Not effective at all/Don't know/Refused",
  "How significant is the influence of media portrayal of gun violence in perpetuating further crime? Highly significant/Somewhat significant/Not significant/Don't know/Refused",
  "Would you say arming civilians is a plausible solution to counteract terrorism? Fully agree/Agree to some level/Do not agree at all/Don't know/Refused",
  "Contemplate the impact of encouraging more citizens to carry concealed weapons on national safety: Highly positive effect/Slight positive effect/Negative effect/No effect/Refused",
  "Reflect on the contribution of the firearm industry to the US economy: Very substantial/Substantial/Not substantial/Negligible/Refused",
  "In your view, do stringent gun control laws help in reducing crime rates significantly? Agree/Disagree/Somewhat agree/Somewhat disagree/Refused",
  "How crucial do you think it is for society to restrict access to assault weapons? Extremely critical/Important but not critical/Not relevant at all/Worthless/Denied",
  "What is your point of view on the effectiveness of gun control laws in reducing crime rates? Significantly effective/Somewhat effective/Neutral/Not really effective/Not effective at all",
  "Do you believe it's important to strengthen mental health screening and services to prevent gun violence? Very important/Fairly important/Neutral/Not so important/Not important at all",
  "How often do you think individuals must take safety training courses if they possess a gun? Often/Sometimes/Rarely/Never/Refused",
  "What do you think about the role of the National Rifle Association (NRA) in the promotion of gun rights? They play a vital role/They play a somewhat important role/Neutral/They don't play an important role at all/They shouldnâ€™t be involved",
  "Should convicted felons have the right to carry a firearm after they have served their sentence? Yes/Yes, but with restrictions/Not sure/No, they should never have this right/Refused",
  "How likely do you think implementing stricter gun control laws will infringe upon people's rights to defend themselves? Extremely likely/Quite likely/Neutral/Not very likely/Not likely at all",
  "Should people who have been treated for mental illness be allowed access to guns? Yes/Yes, but with some restrictions/Neutral/No/Refused",
  "To what extent do you agree that schools should have armed security officers to protect students? Strongly Agree/Agree/Neutral/Disagree/Strongly Disagree",
  "How important do you think it is to ban high-capacity ammunition magazines that hold more than 10 rounds? Extremely important/Somewhat important/Neutral/Not very important/Not important at all",
  "Is it necessary for individuals to conceal carry firearms for personal protection? Very necessary/Slightly necessary/Neutral/Not so necessary/Not necessary at all",
  "Should there be a mandatory waiting period before an individual can purchase a gun? Yes/Yes, but with a shorter waiting period/Unsure/No/Refused",
  "Do you believe that children should be taught about gun safety in schools? Always/Often/Sometimes/Rarely/Never",
  "How impactful do you consider or believe gun violence is to public health? Extremely impactful/Somewhat impactful/Neutral/Slightly impactful/Not impactful at all",
  "Should companies be held liable for selling guns to customers who use them in a crime? Yes, always/Sometimes, based on circumstances/Not sure/No, never/Refused",
  "To what degree is the \"stand your ground\" law justified? Fully justified/Partially justified/Neutral/Barely justified/Not justified at all",
  "How important is it to enforce a law that would prevent individuals on the terrorism watch list from obtaining guns? Very important/Important/Neutral/Not so important/Unimportant",
  "Should there be a ban on \"ghost guns\" that are assembled from kits or3D-printed at home? Absolutely/Somewhat/Neutral/Not really/Not at all",
  "How would you rate the effectiveness of gun control measures in countering crime rates? Highly effective/Moderately effective/Slightly effective/Not effective at all/Refused",
  "In your opinion, does the presence of more guns equate to less crime or more crime? More guns equals less crime/More guns equals more crime/It doesn't matter/Refused",
  "Which do you think is a more effective way of addressing crime- enforcing stricter gun laws or improving social programs? Enforce stricter gun laws/Improve social programs/Both/Refused",
  "Do you think it should be legal for civilians to carry guns in public spaces? Yes/No/It depends/Refused",
  "Do you think gun manufacturers should be liable for crimes committed with their products? Yes, they should/No, they shouldn't/It depends/Refused",
  "Would you support a law to ban semi-automatic weapons if it were proposed? Yes, I would/No, I wouldn't/It depends/Refused",
  "Would you say that easy accessibility to firearms contributes significantly to crime rate? Yes, it does/No, it doesn't/I'm unsure/Refused",
  "Do you believe that having firearms in homes increases or decreases safety? Increases safety/Decreases safety/Doesn't affect safety/Refused",
  "In your opinion, who should bear the greatest responsibility for preventing gun violence? The government/Citizens/Gun manufacturers/All equally/Refused",
  "Would you agree or disagree that teachers should be allowed to carry firearms for safety in schools? Agree/Disagree/Unsure/Refused",
  "How do you weigh the balance between individual rights to gun ownership and public safety concerns? Individual rights should prevail/Public safety should prevail/Both are equally important/I'm unsure/Refused",
  "Do you feel background checks on potential gun owners are comprehensive enough? Yes, they are/No, they are not/Unsure/Refused",
  "Would you be in favor of or against allowing the mentally ill to purchase firearms? In favor/Against/Depends on the circumstances/Refused",
  "Do you support arming citizens as a way to prevent mass shootings? Support/Oppose/Neutral/Refused",
  "Do you support regulations that limit the amount of ammunition a person can purchase? Support/Oppose/Depends/Refused",
  "Do you believe gun possession laws should be a state or federal matter? State matter/Federal matter/Both/Refused",
  "How do you perceive the NRA's influence on gun laws? Positive/Negative/Neutral/Not sure/Refused",
  "In your opinion, do strict gun control laws help to decrease the level of violent crimes committed using firearms? Yes/No/Undetermined/Refused",
  "Do you think teachers who are appropriately trained should be allowed to carry firearms in schools as a protective measure? Yes/No/Undecided/Refused",
  "How strongly do you agree with the statement: \"owning a gun makes me feel safer\"? Strongly agree/Somewhat agree/Neither agree nor disagree/Somewhat disagree/Strongly disagree/Refused",
  "Should people with a history of mental illness have their rights to gun ownership restricted? Absolutely/Somewhat/Not at all/Undecided/Refused",
  "Do you believe that universal background checks for all gun sales would effectively reduce gun violence? Certainly/Possibly/Unlikely/Unsure/Refused",
  "How significant is it for you that the political candidates you vote for share your views on gun control? Extremely important/Very important/Moderately important/Slightly important/Not at all important/Refused",
  "Do you think tighter gun control measures increase or decrease the ability of law-abiding citizens to protect themselves? Increase/Decrease/No effect/Unsure/Refused",
  "Should technology be used to make guns safer, for instance, through fingerprint locks that only allow the owner to use the gun? Yes/No/Maybe/Refused",
  "Is the right to carry a concealed gun something all law-abiding adults should have? Yes/No/Depends/Refused",
  "Would you support a law that imposes a mandatory waiting period before a person can purchase a firearm? Support/Do not support/It depends/Refused",
  "Do you perceive gun ownership rates to positively or negatively correlate with the number of mass shootings in a country? Positively/Negatively/No correlation/Refused",
  "Should therapy for victims of violent crime be publicly funded? Yes/No/Depends/Refused",
  "Do you believe that majority of police shootings could be prevented if the suspects didn't have access to firearms? Yes/No/Unsure/Refused",
  "How often do you discuss gun regulations with people who have different views than you? Regularly/ Sometimes/ Rarely/ Never/ Refused",
  "Is there a significant number of illegal guns in your community that you're aware of? Yes/No/Uncertain/Refused",
  "How would you feel about a requirement to reapply for a gun license every few years? Supportive/Against/Indifferent/Refused",
  "Thinking about your community, how important should government intervention be in regulating access to firearms? Very important/Somewhat important/Not very important/Not important at all/Refused",
  "In terms of crime rate, do you believe the presence of more guns in homes results in More crime/Same level of crime/Less crime/Refused",
  "When considering types of guns, do you believe heavier regulations should be placed on Handguns/Assault weapons/All types of guns/No guns/Refused",
  "How well do you think current U.S laws prevent potential criminals from owning guns? Very effective/Fairly effective/Not too effective/Ineffective/Refused",
  "Do you think those suffering from mental illnesses should have access to guns? Yes/No/Depends on the severity of illness/Refused",
  "How frequently do you talk to your friends and family about gun safety? Regularly/Occasionally/Rarely/Never/Refused",
  "To what extent do you agree that providing teachers with firearms could prevent school shootings? Completely agree/Partially agree/Do not agree/Refused",
  "Would you support stricter gun control laws if they potentially infringed on Second Amendment rights? Yes/No/Depends on the details of the laws/Refused",
  "When thinking about gun violence, is the focus primarily on Mass shootings/Street crime/Suicide/All equally/Refused",
  "Do you feel that media coverage of gun violence contributes to a sense of fear in society? Always/Often/Sometimes/Never/Refused",
  "How much attention should policy makers pay to issues of gun violence? Considerable amount/Moderate amount/Little/None/Refused",
  "How essential is funding for research into gun violence? Crucial/Important/Not necessary/Refused",
  "Would you support laws requiring safe storage of firearms to protect children? Strongly support/Somewhat support/Oppose/Refused",
  "How significant is the role of the black market in gun crime? Very significant/Somewhat significant/Not very significant/Insignificant/Refused",
  "How often do you feel the need for a firearm for personal protection? Always/Often/Rarely/Never/Refused",
  "Should individuals be allowed to carry concealed weapons in public spaces? Always/Occasionally/In certain public spaces/Never/Refused",
  "How important is it to you that a politician shares your view on gun control? Very important/Somewhat important/Not very important/Unimportant/Refused",
  "Do you think linking gun ownership with crime is fair? Completely fair/Partly fair/Unfair/Refused",
  "Would you support a total ban on civilian ownership of handguns? Fully support/Partially support/Do not support/Refused",
  "In your view, should it be more difficult for people to obtain guns legally? Much more difficult/Somewhat more difficult/About the same as now/Somewhat less difficult/Much less difficult/Refused",
  "What are your thoughts on strict gun control laws being the answer to preventing gun violence? Strongly agree/Agree/Neither agree nor disagree/Disagree/Strongly Disagree/Refused",
  "Do you think a gun in the home makes the home a safer or more dangerous place? Safer/More Dangerous/Neither safer nor more dangerous/Depends on the situation/Refused",
  "What role do you believe mental illness plays in mass shootings? Major role/Minor role/Does not play a role/Unsure/Refused",
  "Should convicted felons have the right to own guns after serving their sentence? Yes, they should/Yes, but only non-violent felons/No, they should not/It depends on the crime committed/Refused",
  "Do you believe that teachers should be armed in schools to prevent mass shootings? Strongly agree/Agree/Neither agree nor disagree/Disagree/Strongly Disagree/Refused",
  "What is your view on the assertion that the presence of more guns reduces crime? Strongly agree/Agree/Neither agree nor disagree/Disagree/Strongly Disagree/Refused",
  "Should the government buy back firearms from citizens who voluntarily choose to sell them? Yes, without conditions/Yes, but with conditions/No/Unsure/Refused",
  "Do you believe having a gun increases the security of an individual? Strongly agree/Agree/Neither agree nor disagree/Disagree/Strongly Disagree/Refused",
  "Do you support laws allowing police to temporarily seize guns from people deemed by a judge to be a danger to themselves or others? Strongly support/Support/Neutral/Oppose/Strongly Oppose/Refused",
  "What are your sentiments on a complete ban on semi-automatic weapons? Strongly favor/Favor/Neutral/Oppose/Strongly oppose/Refused",
  "Do you believe the second amendment protects the right of citizens to own any type of gun they want? Yes, absolutely/Yes, but with some restrictions/No, there should be limits/Definitely not/Refused",
  "Do you think that gun owners should have to pass a skills test before being allowed to purchase a gun? Strongly agree/Agree/Neither agree nor disagree/Disagree/Strongly Disagree/Refused",
  "Do you support laws requiring all gun owners to register their firearms with the local government? Strongly support/Support/Neutral/Oppose/Strongly Oppose/Refused",
  "Should people on the government's terrorism watch list be allowed to purchase guns? Yes, always/Yes, but with some restrictions/No, never/Unsure/Refused",
  "How do you perceive the necessity of having stricter gun laws in order to reduce crime rate in the country? Extremely necessary/Necessary/Partly necessary/Not necessary at all/Refused",
  "What is your stance on the following: Teachers carrying firearms in schools as a protective measure? Highly agree/Agree/Neutral/Disagree/Highly disagree/Refused",
  "Consider the statement: \"Lack of mental health support contributes more to gun violence than ease of gun access.\" Do you agree with that? Strongly agree/Agree/Neither agree nor disagree/Disagree/Strongly disagree/Refused",
  "To what extent do you think that strengthening the background check system for gun sales should be prioritized? Urgent priority/Important but not urgent/Low priority/Unnecessary/Refused",
  "Explain your view point: \"The right to own guns contributes to the freedom and independence of citizens.\" Strongly agree/Agree/Neutral/Disagree/Strongly disagree/Refused",
  "What is your opinion on: \"Guns don't kill people; people kill people.\"? Totally agree/Moderately agree/Neither agree nor disagree/Moderately disagree/Totally disagree/Refused",
  "Consider the question: \"Should convicted felons lose their right to own guns permanently?\" Strongly yes/Yes/Neutral/No/Strongly no/Refused",
  "In your opinion, would more citizens carrying guns deter crime? Significantly/Partially/Not Really/Not at all/Refused",
  "Specify your views: Should minors under the age of 18 be allowed to own guns with parental consent? Strongly agree/Agree/Neutral/Disagree/Strongly disagree/Refused",
  "How critical do you think providing gun safety education is in preventing accidental gun deaths? Extremely critical/Critical/Somewhat critical/Not critical at all/Refused",
  "State your opinion on the suggestion: \"Government should buy back guns from citizens to reduce the number of firearms in circulation.\" Strongly support/Support/Neutral/Oppose/Strongly oppose/Refused",
  "Rate the significance of addressing illegal gun sales in tackling gun violence? Extremely high/High/Moderate/Low/None at all/Refused",
  "How do you interpret the fact that the Second Amendment protects an individual's right to own guns? Fully agree/Somewhat agree/Neutral/Somewhat disagree/Fully disagree/Refused",
  "Specify your standpoint: \"Only law enforcement officers should carry guns publicly.\" Strongly agree/Agree/Neutral/Disagree/Strongly disagree/Refused",
  "How urgently should the conflict between gun ownership rights and public safety be resolved? Immediately/Soon/Eventually/Not an issue/Refused",
  "Identify your opinion on gun access for people listed on the â€œNo-Flyâ€ list. Should it be denied? Absolutely/Generally/None in general/Absolutely not/Refused",
  "Explain your position on the matter of household defense using firearms. Fully support/Support/Neutral/Oppose/Fully oppose/Refused",
  "Express your views: \"It's not enough to toughen gun laws, we need to enforce the ones we already have.\" Strongly agree/Agree/Neutral/Disagree/Strongly disagree/Refused",
  "If you had to pick, which is most important to you: Ensuring the constitutional right to own guns, no matter the restrictions or impacts, or prioritizing the reduction of gun violence, even if it means limiting gun rights? Prioritizing gun rights/Reducing gun violence/Can't choose/Refused",
  "How do you feel about the presence of guns in schools as a measure to deter potential attackers? Strongly support/Support/Oppose/Strongly oppose/Refused",
  "In your opinion, should teachers be armed in classrooms for the protection of students? Yes/No/Unsure/Refused",
  "Do you believe that more stringent background checks would reduce the number of shootings in America? Yes/No/Unsure/Refused",
  "Do you support the prohibition on firearms for people who have been identified as a risk by their family or law enforcement? Yes/No/Unsure/Refused",
  "Do you agree with the idea of setting a legal minimum age for gun ownership? Yes/No/Unsure/Refused",
  "Do you endorse the idea of requiring a gun license to purchase any type of firearm, similar to getting a driver's license? Yes/No/Unsure/Refused",
  "Do you think mental health issues are the root cause of most gun violence in America? Yes/No/Unsure/Refused",
  "What's your take on the availability of 3D printed guns? Should it be allowed or banned? Allowed/Banned/Unsure/Refused",
  "Would you agree that individuals convicted of domestic violence should be forever banned from owning firearms? Yes/No/Unsure/Refused",
  "How often do you feel concerned about a possible mass shooting event? Always/Often/Sometimes/Never/Refused",
  "Should gun manufacturers be held accountable for gun violence in the same way that tobacco companies are held accountable for smoking-related illnesses? Yes/No/Unsure/Refused",
  "What's your opinion on the idea of providing tax credits or other incentives to gun owners who turn in their firearms? Support/Oppose/Neither support nor oppose/Refused",
  "Do you believe firearm safety should be a mandatory part of education in schools? Yes/No/Unsure/Refused",
  "Do you see a need for a national database to track gun sales? Yes/No/Unsure/Refused",
  "Is comparing gun violence in the United States to other countries a fair comparison, given the unique cultural and constitutional context? Yes/No/Refused",
  "What's your take on the issue of guns rights vs. public health? Is there a middle ground? Yes/No/Unsure/Refused",
  "Should private gun sales, such as those at gun shows, be subject to the same background checks as sales at retailers? Yes/No/Unsure/Refused"
]