[
  "Would you say that black people are treated less fairly than white people, white people are treated less fairly than black people, or both are treated about equally in when applying for a loan or mortgage situations? Black people are treated less fairly than white people/White people are treated less fairly than black people/Both are treated about equally/Refused",
  "Overall, how much has your family's financial situation when you were growing up helped or hurt your ability to get ahead? Helped a lot/Helped a little/Hurt a little/Hurt a lot/Neither helped nor hurt/Refused",
  "Overall, how does being poor affect people's ability to get ahead in our country these days? Helps a lot/Helps a little/Hurts a little/Hurts a lot/Neither helps nor hurts/Refused",
  "Overall, how does being wealthy affect people's ability to get ahead in our country these days? Helps a lot/Helps a little/Hurts a little/Hurts a lot/Neither helps nor hurts/Refused",
  "Which statement comes closer to your own views? The economic system in this country unfairly favors powerful interests/The economic system in this country is generally fair to most Americans/Refused",
  "How likely do you think it is that the following will happen in the next 30 years? Most Americans will work into their 70s to have enough resources to retire Will definitely happen/Will probably happen/Will probably not happen/Will definitely not happen/Refused",
  "Which do you think is most likely to occur over the next 30 years? The national debt will Grow larger/Stay about the same/Be reduced/Be eliminated/Refused",
  "Thinking ahead 30 years from now, which do you think is more likely to happen? Adults ages 65 and older will be better prepared financially for retirement than older adults are today/less prepared financially for retirement than older adults today/Refused",
  "Over the next 30 years, will the average working person in this country have employee benefits, such as health insurance, paid vacations and retirement plans that are Better than they are now/Not as good as they are now/About the same as they are now/Refused",
  "Over the next 30 years, do you think the share of Americans who are lower class will increase, decrease, or stay about the same? Increase/Decrease/Stay about the same/Refused",
  "Over the next 30 years, do you think the share of Americans who are in Middle Class will increase, decrease, or stay about the same? Increase/Decrease/Stay about the same/Refused",
  "Over the next 30 years, do you think the share of Americans who are upper class will increase, decrease, or stay about the same? Increase/Decrease/Stay about the same/Refused",
  "If you were deciding what the federal government should do to improve the quality of life for future generations, what priority would you give to avoiding tax increases? A top priority/An important, but not a top priority/A lower priority/Should not be done/Refused",
  "If you were deciding what the federal government should do to improve the quality of life for future generations, what priority would you give to reducing the gap between the rich and the poor? A top priority/An important, but not a top priority/A lower priority/Should not be done/Refused",
  "Still thinking ahead 30 years, which do you think is more likely to happen in the U.S.? The gap between the rich and the poor will grow/get smaller The gap between the rich and the poor will grow/The gap between the rich and the poor will get smaller/Refused",
  "Still thinking ahead 30 years, which do you think is more likely to happen in the U.S.? People 65 and older will have a better/worse standard of living People 65 and older will have a better standard of living/People 65 and older will have a worse standard of living/Refused",
  "Still thinking ahead 30 years, which do you think is more likely to happen in the U.S.? The U.S. economy will be stronger/weaker The U.S. economy will be stronger/The U.S. economy will be weaker/Refused",
  "Over the next 30 years, do you think that the average American family will see its standard of living Get better/Stay about the same/Get worse/Refused",
  "Still thinking ahead 30 years, which do you think is more likely to happen in the U.S.? Children will have a better/worse standard of living Children will have a better standard of living/Children will have a worse standard of living/Refused",
  "How much, if at all, do you think the following proposals would do to reduce economic inequality in the U.S.? Ensuring that workers have the skills they need for today's jobs A great deal/A fair amount/Not too much/Nothing at all/Refused",
  "How much, if at all, do you think the following proposals would do to reduce economic inequality in the U.S.? Expanding Medicare so that it covers Americans of all ages A great deal/A fair amount/Not too much/Nothing at all/Refused",
  "How much, if at all, do you think the following proposals would do to reduce economic inequality in the U.S.? Making college tuition free at public two-year colleges A great deal/A fair amount/Not too much/Nothing at all/Refused",
  "How much, if at all, do you think the following proposals would do to reduce economic inequality in the U.S.? Making college tuition free at both public two-year and four-year colleges A great deal/A fair amount/Not too much/Nothing at all/Refused",
  "How much, if at all, do you think the following proposals would do to reduce economic inequality in the U.S.? Increasing taxes on the wealthiest Americans A great deal/A fair amount/Not too much/Nothing at all/Refused",
  "How much, if at all, do you think the following proposals would do to reduce economic inequality in the U.S.? Eliminating college debt A great deal/A fair amount/Not too much/Nothing at all/Refused",
  "In order to address economic inequality in this country, do you think it would be better for the government to Give direct assistance to people who are poor in the form of cash payments or tax credits/Invest in education and job training programs for people who are poor/Refused",
  "How much, if at all, do you think the following proposals would do to reduce economic inequality in the U.S.? Breaking up large corporations A great deal/A fair amount/Not too much/Nothing at all/Refused",
  "In order to address economic inequality in this country, do you think the government Should raise taxes on the wealthiest Americans/Should not raise taxes on the wealthiest Americans/Refused",
  "In order to address economic inequality in this country, do you think the government Should raise taxes on people like you/Should not raise taxes on people like you/Refused",
  "How much, if at all, do you think the following proposals would do to reduce economic inequality in the U.S.? Expanding government benefits for the poor A great deal/A fair amount/Not too much/Nothing at all/Refused",
  "How much, if at all, do you think the following proposals would do to reduce economic inequality in the U.S.? Increasing the federal minimum wage A great deal/A fair amount/Not too much/Nothing at all/Refused",
  "How much power and influence do you think politicians have on today's economy? Too much power and influence/Not enough power and influence/About the right amount/Refused",
  "How much, if at all, do you think problems with our educational system contributes to economic inequality in this country? Contributes a great deal/Contributes a fair amount/Contributes not too much/Contributes not at all/Refused",
  "Thinking about children growing up in the area where you live these days, how much, if at all, do you think their family's financial situation impacts their ability to succeed in life? A great deal/A fair amount/Not too much/Not at all/Refused",
  "Thinking about children growing up in this country these days, how much, if at all, do you think their family's financial situation impacts their ability to succeed in life? A great deal/A fair amount/Not too much/Not at all/Refused",
  "How much, if at all, do you think the growing number of illegal immigrants working in the U.S. contributes to economic inequality in this country? Contributes a great deal/Contributes a fair amount/Contributes not too much/Contributes not at all/Refused",
  "How much, if at all, do you think the growing number of legal immigrants working in the U.S. contributes to economic inequality in this country? Contributes a great deal/Contributes a fair amount/Contributes not too much/Contributes not at all/Refused",
  "Please choose the statement that comes closer to your own views. Poor people today have it easy because they can get government benefits without doing anything in return/Poor people have hard lives because government benefits don't go far enough to help them live decently/Refused",
  "Please choose the statement that comes closer to your own views The economic system in this country unfairly favors powerful interests/The economic system in this country is generally fair to most Americans/Refused",
  "Do you think the country's current economic conditions are helping or hurting people with college degrees? Helping a lot/Helping a little/Hurting a little/Hurting a lot/Neither helping nor hurting/Refused",
  "Do you think the country's current economic conditions are helping or hurting people without college degrees? Helping a lot/Helping a little/Hurting a little/Hurting a lot/Neither helping nor hurting/Refused",
  "Do you think the country's current economic conditions are helping or hurting the middle class? Helping a lot/Helping a little/Hurting a little/Hurting a lot/Neither helping nor hurting/Refused",
  "Do you think the country's current economic conditions are helping or hurting people who are wealthy? Helping a lot/Helping a little/Hurting a little/Hurting a lot/Neither helping nor hurting/Refused",
  "Do you think the country's current economic conditions are helping or hurting people who are poor? Helping a lot/Helping a little/Hurting a little/Hurting a lot/Neither helping nor hurting/Refused",
  "Do you think the country's current economic conditions are helping or hurting older adults? Helping a lot/Helping a little/Hurting a little/Hurting a lot/Neither helping nor hurting/Refused",
  "Do you think the country's current economic conditions are helping or hurting you and your family? Helping a lot/Helping a little/Hurting a little/Hurting a lot/Neither helping nor hurting/Refused",
  "Do you think the country's current economic conditions are helping or hurting people who are black? Helping a lot/Helping a little/Hurting a little/Hurting a lot/Neither helping nor hurting/Refused",
  "Do you think the country's current economic conditions are helping or hurting people who are white? Helping a lot/Helping a little/Hurting a little/Hurting a lot/Neither helping nor hurting/Refused",
  "Do you think the country's current economic conditions are helping or hurting people who are Hispanic? Helping a lot/Helping a little/Hurting a little/Hurting a lot/Neither helping nor hurting/Refused",
  "Do you think the country's current economic conditions are helping or hurting young adults? Helping a lot/Helping a little/Hurting a little/Hurting a lot/Neither helping nor hurting/Refused",
  "Thinking about our economic situation, how would you describe the current economic situation in the US? Very good/Somewhat good/Somewhat bad/Very bad/Refused",
  "How much, if at all, do you think our current trade policies with other countries contributes to economic inequality in this country? Contributes a great deal/Contributes a fair amount/Contributes not too much/Contributes not at all/Refused",
  "How much, if at all, do you think the outsourcing of jobs to other countries contributes to economic inequality in this country? Contributes a great deal/Contributes a fair amount/Contributes not too much/Contributes not at all/Refused",
  "How much responsibility, if any, should wealthy individuals have in reducing economic inequality in our country? A lot/Some/Only a little/None/Refused",
  "How much responsibility, if any, should state governments have in reducing economic inequality in our country? A lot/Some/Only a little/None/Refused",
  "In order to address economic inequality in this country, do you think our economic system Requires only minor changes/Requires major changes/Needs to be completely rebuilt/Refused",
  "How much responsibility, if any, should churches and other religious organizations have in reducing economic inequality in our country? A lot/Some/Only a little/None/Refused",
  "How much responsibility, if any, should large businesses and corporations have in reducing economic inequality in our country? A lot/Some/Only a little/None/Refused",
  "Thinking about the US, how much would you say the economic system needs to be changed, if at all? It needs to be completely reformed/It needs major changes/It needs minor changes/It doesn't need to be changed/Refused",
  "When children today in the US grow up, do you think they will be Better off financially than their parents/Worse off financially than their parents/Refused",
  "Do you think that Some amount of economic inequality is acceptable/No amount of economic inequality is acceptable/Refused",
  "Thinking about the level of economic inequality in the country these days, would you say there is Too much economic inequality/Too little economic inequality/About the right amount of economic inequality/Refused",
  "How much, if at all, do you think gas prices are contributing to your opinion about how the economy is doing? A great deal/A fair amount/Not too much/Not at all/Refused",
  "How much of a priority should the following be for the federal government to address: Reducing economic inequality A top priority/Important, but lower priority/Not too important/Should not be done/Refused",
  "How much, if at all, do you think not enough regulation of major corporations contributes to economic inequality in this country? Contributes a great deal/Contributes a fair amount/Contributes not too much/Contributes not at all/Refused",
  "How much, if at all, do you think some people work harder than others contributes to economic inequality in this country? Contributes a great deal/Contributes a fair amount/Contributes not too much/Contributes not at all/Refused",
  "How much, if at all, do you think our tax system contributes to economic inequality in this country? Contributes a great deal/Contributes a fair amount/Contributes not too much/Contributes not at all/Refused",
  "How much, if at all, do you think the automation of jobs contributes to economic inequality in this country? Contributes a great deal/Contributes a fair amount/Contributes not too much/Contributes not at all/Refused",
  "How much, if at all, do you think too much regulation of major corporations contributes to economic inequality in this country? Contributes a great deal/Contributes a fair amount/Contributes not too much/Contributes not at all/Refused",
  "How much, if at all, do you think wages and incomes are contributing to your opinion about how the economy is doing? A great deal/A fair amount/Not too much/Not at all/Refused",
  "How much, if at all, do you think the country's tax system is contributing to your opinion about how the economy is doing? A great deal/A fair amount/Not too much/Not at all/Refused",
  "How much responsibility, if any, should the federal government have in reducing economic inequality in our country? A lot/Some/Only a little/None/Refused",
  "How much, if at all, do you think the cost of health care is contributing to your opinion about how the economy is doing? A great deal/A fair amount/Not too much/Not at all/Refused",
  "How much, if at all, do you think prices for food and consumer goods are contributing to your opinion about how the economy is doing? A great deal/A fair amount/Not too much/Not at all/Refused",
  "How much, if at all, do you think real estate values are contributing to your opinion about how the economy is doing? A great deal/A fair amount/Not too much/Not at all/Refused",
  "How much, if at all, do you think the availability of jobs is contributing to your opinion about how the economy is doing? A great deal/A fair amount/Not too much/Not at all/Refused",
  "A year from now, do you expect that economic conditions in the country as a whole will be Better/Worse/About the same as now/Refused",
  "How much, if at all, do you think how the stock market is doing is contributing to your opinion about how the economy is doing? A great deal/A fair amount/Not too much/Not at all/Refused",
  "How much, if at all, do you think the federal budget deficit is contributing to your opinion about how the economy is doing? A great deal/A fair amount/Not too much/Not at all/Refused",
  "How much, if at all, do you think the different life choices people make contributes to economic inequality in this country? Contributes a great deal/Contributes a fair amount/Contributes not too much/Contributes not at all/Refused",
  "Thinking about the nation's economy, how would you rate economic conditions in this country today? Excellent/Good/Only fair/Poor/Refused",
  "How much, if at all, do you think some people starting out with more opportunities than others contributes to economic inequality in this country? Contributes a great deal/Contributes a fair amount/Contributes not too much/Contributes not at all/Refused",
  "How much, if at all, do you think the following proposals would do to reduce economic inequality in the U.S.? Reducing illegal immigration A great deal/A fair amount/Not too much/Nothing at all/Refused",
  "How much power and influence do you think small businesses have on today's economy? Too much power and influence/Not enough power and influence/About the right amount/Refused",
  "How much power and influence do you think banks and other financial institutions have on today's economy? Too much power and influence/Not enough power and influence/About the right amount/Refused",
  "How much power and influence do you think large corporations have on today's economy? Too much power and influence/Not enough power and influence/About the right amount/Refused",
  "How much, if at all, do you think discrimination against racial and ethnic minorities contributes to economic inequality in this country? Contributes a great deal/Contributes a fair amount/Contributes not too much/Contributes not at all/Refused",
  "How much power and influence do you think labor unions have on today's economy? Too much power and influence/Not enough power and influence/About the right amount/Refused",
  "How much power and influence do you think Health insurance companies have on today's economy? Too much power and influence/Not enough power and influence/About the right amount/Refused",
  "How much power and influence do you think the middle class have on today's economy? Too much power and influence/Not enough power and influence/About the right amount/Refused",
  "How much power and influence do you think people who are wealthy have on today's economy? Too much power and influence/Not enough power and influence/About the right amount/Refused",
  "How much power and influence do you think people who are poor have on today's economy? Too much power and influence/Not enough power and influence/About the right amount/Refused",
  "Please choose the statement that comes closer to your own views. The economic system in this country unfairly favors powerful interests/The economic system in this country is generally fair to most Americans/Refused",
  "Do you think the fact that there are some people in this country who have personal fortunes of a billion dollars or more is A good thing for the country/A bad thing for the country/Neither a good thing or a bad thing/Refused",
  "In your opinion, how significant is the role of systemic discrimination in perpetuating economic inequality? Substantially significant/Fairly significant/Not very significant/Not significant at all/Refused",
  "Do you believe wealth redistribution through taxation is a viable approach to addressing economic inequality? Definitely a viable approach/Probably a viable approach/Probably not a viable approach/Definitely not a viable approach/Refused",
  "How much, in your view, does the lack of universal healthcare contribute to the wealth gap in this country? Contributes a great deal/Contributes a fair amount/Contributes not too much/Contributes not at all/Refused",
  "In the future, do you think the technological advancement will reduce or increase the gap between the rich and the poor? Will reduce the gap/Will increase the gap/Won't affect the gap/Refused",
  "Do you think the minimum wage in its current state contributes to the wealth disparity in this country? Contributes significantly/Contributes moderately/Contributes slightly/Does not contribute/Refused",
  "Looking at the employment market, how much influence do you think labor unions have in combating economic inequality? Too much influence/Not enough influence/Just the right amount of influence/Refused",
  "How much, according to you, the deregulation of the financial markets has contributed to the current economic inequality? Contributed a great deal/Contributed a fair amount/Not contributed much/Have not contributed at all/Refused",
  "How much impact do you believe offshoring and outsourcing have on domestic economic inequality? Greatly increases inequality/Increases inequality somewhat/Does not affect inequality/Decreases inequality/Refused",
  "What kind of impact, if any, do you think an increase in education funding would have on economic inequality? Significantly reduce inequality/Reduce inequality somewhat/Have no impact on inequality/Increase inequality/Refused",
  "Do you believe that a free-market economy leads to a fair distribution of wealth? Full agreement/Partial agreement/Neutral/Partial disagreement/Full disagreement/Refused",
  "Do you believe that a strong social safety net contributes to reducing economic inequality? Contributes a great deal/Contributes somewhat/Does not contribute much/Does not contribute at all/Refused",
  "Is it probable that the rise of automation and artificial intelligence will increase economic inequality in the future? Highly probable/Probable/Unlikely/Highly unlikely/Refused",
  "Do you think that globalization would likely lead to a decrease or increase in economic inequality? Likely lead to decrease/Likely lead to increase/No impact/Refused",
  "In your opinion, to what extent does the wage gap between men and women contribute to economic inequality? Contributes significantly/Contributes moderately/Contributes slightly/Does not contribute/Refused",
  "Do you think that economic austerity measures mainly benefit the rich, widen inequality, or both? Mainly benefit the rich/Widen inequality/Both/Neither/Refused",
  "To what extent do you believe that taming corporate power can help reduce economic inequality? Can reduce a great deal/Can reduce a fair amount/Cannot reduce much/Cannot reduce at all/Refused",
  "What role, if any, do you think renewable energy industries can play in reducing economic inequality? Can play a significant role/Can play some role/Can play little or no role/Can increase inequality/Refused",
  "In your view, do progressive taxes have the ability to significantly reduce economic inequality? Has a great ability/Has a fair ability/Has little ability/Has no ability/Refused",
  "How much influence, if any, do you feel that corporate lobbying has on economic inequality? Influences a great deal/Influences a fair amount/Influences not too much/Influences not at all/Refused",
  "Do you believe the gig economy contributes more towards economic enrichment or economic impoverishment? Contributes more towards enrichment/Contributes more towards impoverishment/Contributes equally towards both/Does not contribute either way/Refused",
  "Taking into account the present economic conditions, what is your stance on the implementation of Universal Basic Income (UBI)? The boon to the struggling individuals/An unnecessary financial burden on the economy/Doesn't matter much/Refused",
  "Considering the escalating wealth inequality in many developed nations, how effective do you think wealth taxes could be in promoting economic equity? Extremely effective/Moderately effective/Not at all effective/Refused",
  "How much potential impact do you think raising the minimum wage would have on reducing poverty in the country? A significant impact/A moderate impact/No impact at all/Refused",
  "With the rise in automation, do you feel jobs will be more scarce leading to higher rates of unemployment? More scarce/Less scarce/No significant change/Refused",
  "Reflecting upon the state of our environment, do you believe a Green New Deal would be beneficial to our economy? Highly beneficial/Mildly beneficial/Not beneficial at all/Refused",
  "Do you think offshore production and outsourcing jobs overseas have resulted in an unfair economic advantage? Caused significant disadvantage/Caused moderate disadvantage/No notable change/Refused",
  "What do you perceive to be the potential economic impact of large-scale immigration on a nation's economy? Positive impact/Negative impact/No significant impact/Refused",
  "Do you believe that deregulating the financial industry would drive economic growth or lead to economic instability? Drive economic growth/Lead to economic instability/No significant impact/Refused",
  "Thinking of multinational corporations, do you view their dominance in the market as a threat to local businesses or an opportunity for economic growth? Threat to local businesses/Opportunity for growth/Both/Refused",
  "Considering social welfare programs, how impactful are they in reducing the wealth gap in society? Highly impactful/Moderately impactful/Not impactful at all/Refused",
  "How do you rate the effectiveness of trade protectionism in safeguarding domestic jobs? Highly effective/Moderately effective/Not effective at all/Refused",
  "In terms of balancing the national budget, would you favor spending cuts or increasing taxes? Favor spending cuts/Favor increasing taxes/Both/Refused",
  "How much, if at all, do you think publicly funded healthcare would alleviate financial stress on the middle class? A great deal/A fair amount/Not too much/Nothing at all/Refused",
  "Do you believe the digital economy (e.g., internet companies, e-commerce) generates more job opportunities or job losses? Generates more job opportunities/Generates job losses/Both/Refused",
  "Should economic policies aim more towards incentivizing businesses for job creation, or towards direct wealth redistribution to reduce income inequality? Incentivize businesses/Direct wealth redistribution/Both/Refused",
  "Regarding housing affordability, do you think government subsidies for low-income households would help improve their economic status? Significantly improve/Improve slightly/Not improve at all/Refused",
  "How effective do you think financial literacy education would be in improving the general public's money management skills and reducing poverty? Highly Effective/Moderate Effectiveness/Doesn't make a big difference/Refused",
  "Looking toward the coming decades, do you think stringent climate regulations will harm or boost the economy? Harm the economy/Boost the economy/Has no significant impact/Refused",
  "Should the government provide financial incentives to companies for adopting environmentally friendly practices? Yes, it would encourage sustainability/No, companies should bear the cost/May be helpful but not necessary/Refused",
  "Do you feel global economic integration has led to improved living standards or have they led to exploitation of labor and resources in poorer nations? Led to improved living standards/Led to exploitation/Both/Refused",
  "What do you think is the most effective way to uplift the financial conditions of underprivileged sections of society? Is it by implementing redistributive policies or by promoting free-market capitalism, or a mix of both? Elucidate your perspective.",
  "Do you believe the current economic system favours the wealthy over the everyday worker? Please articulate your views and bolster them with supporting points.",
  "How significant a role do you reckon minimum wage laws play into addressing economic inequality? Too significant/Significant but not enough/Insignificant/Not at all/Refused",
  "What's your stance on incorporating higher taxes for the wealthy as a measure to decrease economic disparity? Greatly in favour/Slightly in favour/Neutral/Opposed to it/Highly opposed to it",
  "How would you assess the impact of globalization on economic inequalities? Positively/Negatively/Neutral/Can't Say/Refused",
  "Do you perceive that automation and technological advancements will exacerbate income inequality in our society? Substantially/To some extent/Not Much/Not At All/Refused",
  "What role do you envisage labor unions playing in mitigating wage gaps and economic inequality? Critical/Moderate/Little/None at all/Refused",
  "Do you perceive that a quality public education system can serve as a catalyst in diminishing economic inequality? To a considerable degree/To some degree/To a slight degree/Not at all/Refused",
  "Do you presuppose that a universal basic income (UBI) could be beneficial in addressing increasing income disparity? Very Beneficial/Moderately Beneficial/Slightly Beneficial/Not Beneficial At All/Refused",
  "What weightage would you assign to the impact of climate change policies on economic inequality? Too much/Just right/Too little/No impact at all/Refused",
  "Does a balanced trade policy contribute to leveling the economic disparity? Strongly Agree/Agree/Disagree/Strongly Disagree/Refused",
  "How influentially do you rate the financial literacy programs in regulating wealth disparity? Highly Influential/Moderately Influential/Slightly Influential/Not Influential at all/Refused",
  "How would you evaluate the effect of corporate welfare on exacerbating economic inequality? Greatly Increases/Increases/Has no Effect/Decreases/Refused",
  "What impact do investment in infrastructure projects have on mitigating economic inequality? Significant/Some/Minimal/None/Refused",
  "Do you think gender wage gap plays a role in widening the economic inequality? Yes, a significant role/Yes, but a minor role/Neutral/No Role/Refused",
  "How impactful do you suppose the role of Small and Medium Enterprises (SMEs) is towards reducing economic disparity? Very Impactful/Impactful/Slightly Impactful/Not Impactful/Refused",
  "What's your view on the effect of foreign direct investment (FDI) on economic inequality? It widens inequality/It reduces inequality/It has no significant effect/Can't say/Refused",
  "Do you see a decentralization of economic power as an effective way to curb economic inequality? Strongly Agree/Agree/Disagree/Strongly Disagree/Refused",
  "What's your take on the influence of federal economic policies in sustaining economic equality? Very Significant/Significantly/Moderately/Insignificant/Refused",
  "How do you perceive the effect of raising the minimum wage on economic inequality? Would it help a lot/Help a little/Not help much/Not help at all/Refused",
  "What's your opinion on the impact of unions on economic inequality? Do they help a great deal/A moderate amount/Just a little/They do not help at all/Refused",
  "To what extent, in your opinion, will government investing more in public infrastructure help to reduce economic inequality? Helps a lot/Helps somewhat/Doesn’t help much/Doesn't help at all/Refused",
  "In your view, does the aggressive pursuit of economic growth by corporations help or hurt economic inequality in this country? Helps a lot/Helps somewhat/Hurts somewhat/Hurts a lot/Refused",
  "What do you think of universal healthcare as a solution to economic inequality? Would it help a great deal/Help a fair amount/Help not too much/Not help at all/Refused",
  "To what extent, if at all, do you think protecting domestic industries contributes to alleviating economic inequality? Contributes a great deal/Contributes a fair amount/Doesn't Contribute much/Contributes not at all/Refused",
  "How, if at all, would providing universal basic income to all citizens influence economic inequality? Would it impact a great deal/Impact a fair amount/Impact not too much/No impact at all/Refused",
  "How do you see the influence of Wall Street and large financial institutions on economic disparities? Highly influential/Fairly influential/Not very influential/No influence at all/Refused",
  "How much does crony capitalism, in your opinion, contribute to economic inequality? Contribute substantially/Contribute moderately/Contribute slightly/Does not contribute at all/Refused",
  "In your view, how much does the concentration of wealth in the hands of a few increase economic disparity? Increases a great deal/Increases somewhat/Increases slightly/Doesn't increase at all/Refused",
  "How does the increasing cost of higher education, in your opinion, affect economic inequality? Affects a great deal/Affects a bit/Doesn’t affect much/Doesn't affect at all/Refused",
  "In your view, does the outsourcing of jobs to foreign countries exacerbate economic inequality? Exacerbates a great deal/Exacerbates a little/Doesn't exacerbate too much/Doesn't exacerbate at all/Refused",
  "How significantly, if at all, does the lack of affordable healthcare services influence economic inequality? Influences a great deal/Influences somewhat/Doesn't influence much/Doesn't influence at all/Refused",
  "How, if at all, does the existence of offshore tax havens affect economic disparity? Affects a great deal/Affects a fair amount/Affects not too much/No affect at all/Refused",
  "Outline your thoughts on how tax policies are affecting income inequality in our country. Lightening a lot/Lightening a little/Exacerbating a little/Exacerbating a lot/No noticeable effect/Refused",
  "Are current government spending priorities contributing to or lessening economic inequality? Contributing significantly/Contributing moderately/Lessening moderately/Lessening significantly/No significant effect/Refused",
  "Can you elaborate on how trade policies might be impacting wage inequality in the country? Benefiting a lot/Benefiting a little/Hurting a little/Hurting a lot/No noticeable effect/Refused",
  "Discuss your views on how globalization could influence social economic disparities. Widening a lot/Widening a little/Narrowing a little/Narrowing a lot/No noticeable effect/Refused",
  "Do you believe the current balance of power between corporations and individuals in the economy is fair? Well-balanced/More power to corporations/More power to individuals/Neither/Can't tell/Refused",
  "Share your ideas on how healthcare costs are affecting economic inequality. Exacerbating significantly/Exacerbating a little/Lightening a little/Lightening significantly/No noticeable effect/Refused",
  "How do you believe our current employment laws impact wage gaps in the country? Worsening a lot/Worsening a little/Improving a little/Improving a lot/No noticeable effect/Refused",
  "Could you explain how you think income redistribution plays a role in reducing or increasing economic disparities? Reduces a lot/Reduces a little/Increases a little/Increases a lot/No noticeable effect/Refused",
  "Can affordable housing and real estate policies mitigate or exacerbate economic inequality in the country? Mitigating significantly/Mitigating moderately/Exacerbating moderately/Exacerbating significantly/No significant effect/Refused",
  "Share your perspective on the role technology and automation might be playing in economic inequality. Increasing a lot/Increasing a little/Decreasing a little/Decreasing a lot/No noticeable effect/Refused",
  "How do current educational policies and access to quality education impact economic inequality? Exacerbates a lot/Exacerbates a little/Alleviates a little/Alleviates a lot/No noticeable effect/Refused",
  "Reflect on how the national debt is influencing economic fairness in the country. Damaging significantly/Damaging moderately/Aiding moderately/Aiding significantly/No significant effect/Refused",
  "Do you believe that access to affordable higher education can change the wealth distribution in the country? Changes a lot/Changes a little/No noticeable change can result/Changes for the worse/Can't comment/Refused",
  "How do you think current labor union policies and actions are affecting wage gaps? Reducing significantly/Reducing moderately/Increasing moderately/Increasing significantly/No significant effect/Refused",
  "Reflect on how immigration policies and immigrant labor can alter economic imbalance in our society. Balancing a lot/Balancing a little/Creating more imbalance a little/Creating more imbalance a lot/No noticeable effect/Refused",
  "To what extent do you believe the minimum wage laws in this country impact economic inequality? Significantly/Somewhat/Minimally/Not at all/Refused",
  "In the aspect of economic policy, how would you perceive the role of corporations in contributing to economic inequality? Contribute greatly/Contribute somewhat/Do not contribute much/Do not contribute at all/Refused",
  "To what degree do you think the cost of higher education contributes to economic disparity in this nation? Substantial/Some/Little to none/Not at all/Refused",
  "Should businesses have more responsibility in bridging the wage gap in our society? A great deal/Some/A little/None at all/Refused",
  "What's your perspective on the influence of healthcare cost in magnifying economic inequality? Contributes considerably/Contributes somewhat/Contributes just a little/Contributes not at all/Refused",
  "How greatly, if at all, do you believe globalization has an impact on economic disparity within this country? Greatly/Somewhat/Not much/Not at all/Refused",
  "How significant do you think the economic cost of climate change contributes to inequality? Contributes significantly/Contributes fairly/Contributes slightly/Does not contribute/Refused",
  "Do you foresee automation and AI impacting wealth distribution in the next two decades? Strong impact/Moderate impact/Minimal impact/No impact/Refused",
  "To what degree does the current tax code exacerbate income inequality? To a great extent/To some extent/To a minor extent/Not at all/Refused",
  "How much, if at all, do you think the housing market affects the wealth gap in our country? A great deal/Some/A little/Not at all/Refused",
  "In your opinion, how much does the structure of capitalism contribute to economic inequality? Contributes a great deal/Contributes some/Contributes a little/Contributes not at all/Refused",
  "How influential are trade policies in deepening the economic disparity in our nation? Very influential/Somewhat influential/Minimally influential/Not influential/Refused",
  "What do you think is the impact of financial literacy on the widening wealth gap? Significant impact/Moderate impact/Minor impact/No impact/Refused",
  "How much of a role, if any, does technology and the digital divide play in perpetuating economic inequality? Major role/Some role/Minor role/No role/Refused",
  "How much, if at all, do you think the rising cost of living contributes to economic imbalance? Majorly/Slightly/Not much/Not at all/Refused",
  "To what extent do you think the retirement savings crisis contributes to wealth disparity in the country? Great extent/Moderate extent/Minor extent/Not at all/Refused",
  "How much, if any, should government regulation control market forces to reduce economic inequality? A lot/Some/Only a little/None/Refused",
  "How directly do you think income inequality contributes to social issues in our society? Directly/Indirectly/Somehow related/Not at all linked/Refused",
  "What impact, if any, do you think student loan debt has on widening the wealth gap? Significant/Moderate/Minimal/No impact/Refused",
  "Considering the current economic environment, how much of an impact do you think high income earners have on the economy? Positive impact/Negative impact/No real impact/Refused",
  "How significantly do you believe that the government should be intervening to reduce income inequality? Heavily intervene/Some intervention/Little to no intervention/Not at all/Refused",
  "Given the current state of the economy, how fair would you say the distribution of wealth is among citizens in the US? Very fair/Somewhat fair/Not very fair/Not at all fair/Refused",
  "What impact do you think reducing taxes for the rich has on the overall economy? Positive impact/Negative impact/No impact/Refused",
  "To what extent do you feel the increase in minimum wage impacts economic inequality? Great extent/Moderate extent/Little extent/No extent/Refused",
  "How much of a role should the government play in providing welfare benefits to reduce poverty? A large role/Moderate role/Little role/No role/Refused",
  "What impact do you think globalization has on economic inequality? Increases inequality/Decreases inequality/No impact/Refused",
  "Based on today's economic climate, to what degree do you think corporate accountability is important in reducing economic inequality? Very important/Somewhat important/Not at all important/Refused",
  "In considering economic inequality, how much impact do you think improving access to quality education would have? Great impact/Moderate impact/Little impact/No impact/Refused",
  "How important do you think the issue of gender wage gap is in contributing to economic inequality? Very important/Somewhat important/Not very important/Not at all important/Refused",
  "In the context of economic circumstances in the US, how beneficial do you think implementing universal healthcare would be? Very beneficial/Somewhat beneficial/Not at all beneficial/Refused",
  "How influential is racial inequality when considering economic inequality? Very influential/Somewhat influential/Not at all influential/Refused",
  "When assessing economic imbalance, how significant do you think access to affordable housing is in resolving this issue? Very significant/Somewhat significant/Not at all significant/Refused",
  "What role do technological advancements play in economic inequality, in your opinion? Increase inequality/Decrease inequality/No impact/Refused",
  "In relation to the economy, do you think climate change can influence economic inequality? Yes, it can influence greatly/Yes, but influence is limited/No, it cannot influence at all/Refused",
  "How much of an impact do you believe affordable child care services would have on reducing economic inequality? Significant impact/Moderate impact/No impact/Refused",
  "How would you rate the current state of socio-economic mobility in the US, in terms of fairness? Very fair/Somewhat fair/Not very fair/Not fair at all/Refused",
  "Describe, in your own opinion, the potential impact launching free universal healthcare would have on the economy? Positive impact/Negative impact/Both positive and negative/Unsure",
  "Devise your perspective on how the introduction of a universal basic income could influence the American economy. Highly favorable/Favorable/Neutral/Unfavorable/Strongly unfavorable",
  "Advise on the degree to which you believe that large corporations' tax breaks contribute to economic disparities. Substantially contributes/Somewhat contributes/Little to no contribution/Absolutely no contribution",
  "Rate your belief on the correlation between the steep rise in the cost of education and income inequality in today's society. Strong correlation/Moderate correlation/Weak correlation/No correlation",
  "Share your viewpoint on the impact of wealth inheritance on wealth inequality in our society? Highly significant/Somewhat significant/Insignificant/Not significant at all",
  "To what extent do you believe that globalization has influenced income disparity within the country? Greater influence/Moderate influence/Slight influence/No influence",
  "Can you express how the ever-rising cost of housing has fueled wealth inequality? Major influencer/Moderate influencer/Minor influencer/No influence",
  "Do you feel the government should regulate salaries in large corporations to reduce income inequality? Strongly agree/Agree/Disagree/Strongly disagree",
  "Illustrate how you believe financial literacy could help alleviate wealth inequality. Critical importance/Important/Not very important/Unimportant",
  "Explain the role minimum wage policy plays on income inequality in your opinion. Major role/Moderate role/Minimal role/No role",
  "How would the pardon of all student loans impact wealth inequality in the U.S., in your perspective? Broad impact/Moderate impact/Little impact/No impact",
  "What are your views on the role Wall Street plays in income inequality in the United States? Substantial role/Minimal role/Partially responsible/Not at all responsible",
  "State your belief on tax policy and its influence on the growing economic divide in the country. Crucial factor/Important factor/Minor factor/Not a factor",
  "Do you believe that creating more jobs can solve the issue of income inequality? Definitely agree/Agree/Disagree/Strongly disagree",
  "Reason on the impact you anticipate on wealth inequality if a wealth tax is implemented? Profound effect/Moderate effect/Minimal effect/No effect",
  "Evaluate the influence that inflation has on income inequality in your opinion. Significant influence/Mild influence/Negligible influence/Zero influence",
  "Propose your opinion on how the gig economy contributes to income inequality. High contribution/Moderate contribution/Low contribution/No contribution",
  "Point out how the monopolization of industries does affect wealth inequality in the United States, in your perspective? Greatly affects/Somewhat affects/Barely affects/Doesn't affect",
  "Kindly articulate your stance on the belief that financial deregulation affects economic inequality. Strongly affects/Partially affects/Minimal effect/No effect",
  "How would you describe the government's role in addressing income inequality? Should it intervene more or less?",
  "In your opinion, are the current fiscal policies favoring the wealthy, the middle class, or the underprivileged? Could you elaborate?",
  "Do you believe that tax cuts for corporations can spur economic growth and reduce income disparity?",
  "How do you perceive the influence of lobbying on our economic inequality? Is it detrimental or beneficial?",
  "What impact do you think that an increase in the minimum wage would have on economic inequality?",
  "Is income redistribution a solution to economic inequality, or does it stifle individual initiative and growth?",
  "Do you think there's a correlation between the education system and economic inequality? Could you expand on that?",
  "How would you evaluate the impact of affordable healthcare on income inequality in the country?",
  "Do you think a universal basic income would alleviate the issues of economic inequality? Please provide an elaborate response.",
  "Could you explain the effects of global trade policies on domestic economic inequality?",
  "Do more stringent environmental regulations contribute to economic inequality? If so, how?",
  "How have tech giants and big corporations influenced income inequality in recent years? Please elaborate.",
  "How does economic inequality affect political inequality, can they be separated or do they go hand in hand?",
  "How might affordable housing initiatives impact economic inequality in urban areas?",
  "How do you see the relationship between gender inequality and economic inequality? Please explain.",
  "Does a robust social security system mitigate economic inequality, and if so, how?",
  "In your perspective, how do current immigration policies affect economic inequality?",
  "Could you discuss the impact of economic inequality on crime rates and social unrest?",
  "Do you believe that geographical inequality fuels economic disparity in our society? Please expand.",
  "Does a nation’s foreign policy bear any implication on internal economic inequality?",
  "Do you hold that the war on drugs has escalated economic inequality within the country? Provide your insights.",
  "What are your thoughts on the idea of a universal basic income as a tool to alleviate economic inequality? Favorable/Unfavorable/Neutral/Refused",
  "How necessary do you find government intervention in order to bridge the wealth gap in society? Essential/Important/Not so important/Unnecessary/Refused",
  "Would you endorse the notion of taxing the wealthiest more to aid those in the lower income brackets? Agree/Disagree/Neutral/Refused",
  "How does access to healthcare services affect economic mobility and inequality in your opinion? Improves a lot/Improves a little/Hinders a little/Hinders a lot/No effect/Refused",
  "What role does affordable housing play in ending economic disparity, according to your understanding? Significant role/Moderate role/Minimal role/No role/Refused",
  "According to you, how substantial is the contribution of quality, affordable education towards reducing income inequality? Very substantial/Substantial/Not very substantial/Non-existent/Refused",
  "What is your opinion on increasing the minimum wage to confront poverty and income inequality? Strongly support/Support/Oppose/Strongly oppose/Refused",
  "Do you agree that access to affordable and healthy food options would lessen the impact of economic inequality? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "What is your assessment of the link between social mobility and economic inequality in our society? Strong link/Moderate link/Weak link/No link/Refused",
  "To what degree do you consider regressive tax systems as a factor promoting economic disparity? Very significant/Significant/Not very significant/Not at all significant/Refused",
  "Do you agree with the statement that economic inequality can be reduced by investing in public transportation? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "What is your perspective on the role of trade policies in shaping economic inequality? Significant/Moderate/Minimal/No role/Refused",
  "How do you perceive the effect of globalization on economic disparity in our country? Increases a lot/Increases a little/Reduces a little/Reduces a lot/No effect/Refused",
  "What degree of impact does corporate lobbying have on economic inequality, in your view? Immense impact/Moderate impact/Little impact/No impact/Refused",
  "How pertinent do you find wealth redistribution through inheritance taxes for reducing economic inequality? Very pertinent/Pertinent/Not very pertinent/Not at all pertinent/Refused",
  "How crucial do you think access to technology and the internet is to overcoming economic detriment? Extremely crucial/Crucial/Less crucial/Not crucial at all/Refused",
  "Do you perceive job outsourcing as a factor that exacerbates economic inequality in our country? Yes/No/Neutral/Refused",
  "How much, in your opinion, does the concentration of economic power in the hands of few influence politics and policy decisions in a favorable/ unfavorable/ neutral way?",
  "Do you think economic policies that favor rich individuals and corporations are justifiable/ unjustifiable/ neither justifiable nor unjustifiable because they stimulate economic growth and job creation?",
  "In your opinion, what impact does increasing income disparity have on the social fabric of a nation? Deepens social divisions/ Enhances social mobility/ Has no particular effect/ Refused?",
  "Do you believe that a \"trickle-down\" economic policy in which wealth is given to the rich and will eventually benefit the poor, work well/ doesn't work well/ depends on other factors?",
  "Assuming you are to address wealth disparity, would you increase/ decrease/ maintain current levels of taxation on the wealthy?",
  "If you are given the power, would you implement/ not implement/ unsure about universal basic income as a strategy to combat economic inequality?",
  "How convinced are you that access to free public education can significantly reduce/ not reduce economic inequality/ has no impact/ refused?",
  "Are labor unions important/ not important/ neutral for reducing income inequality?",
  "In your opinion, should the state have/ not have/ neutral the right to implement wealth redistribution policies?",
  "Do you believe that financial regulations are beneficial/ not beneficial/ neutral for fostering economic equality in free markets?",
  "Do you think healthcare should be treated as a right/ a privilege/ neither/ refused, and is it a means to address economic inequality?",
  "In relation to economic inequality, do you believe minimum wage laws should be strengthened/ abolished/ neither/ refused?",
  "How much do you think that racial and gender discrimination exacerbates economic inequality? A lot/ A little/ Not at all/ Refused?",
  "Do you hold the view that progressive tax policies are effective/ ineffective/ neutral in reducing economic inequality?",
  "Would you propose more/ less/ same amount of government spending in social welfare programs to address economic inequality?",
  "How much importance do you place on equal pay for equal work in reducing/ not reducing/ having no impact on economic inequality?",
  "Considering the gender pay gap, would you promote/ not promote/ unsure about policies that enforce equal pay to alleviate economic inequality?",
  "Do you think offshore banking and tax loopholes used by wealthy individuals and corporations should be eliminated/ preserved/ neither/ refused to tackle economic inequality?",
  "Do you see automation and AI as threats/ opportunities/ neutral to economic inequality?",
  "Try to assess the potential impact on economic inequality of abolishing student loans? Would do a great deal/Would do a fair amount/Would do not too much/Would do nothing at all/Refused",
  "How much do you feel minimum wage laws contribute to the gap in wealth? Contribute significantly/Contribute moderately/Contribute slightly/Do not contribute at all/Refused",
  "Do you believe the current healthcare system is favoring the rich or the poor? Favors the rich a lot/Favors the rich a little/Neither favors the rich nor the poor/Favors the poor a little/Favors the poor a lot/Refused",
  "What are your thoughts on whether the current tax policies exacerbate economic inequality? Contributes a great deal/Contributes a fair amount/Contributes not too much/Contributes not at all/Refused",
  "What impact, if any, do immigration policies have on the nation's wealth gap? A great impact/A fair impact/Not too much impact/No impact at all/Refused",
  "Could you assess the role big corporations play in driving economic inequality in the U.S.? Plays a significant role/Plays a moderate role/Plays a minor role/Does not play a role at all/Refused",
  "Do you think the housing market and its policies are broadening or narrowing economic inequality? Broadening a lot/Broadening a little/Neither broadening nor narrowing/Narrowing a little/Narrowing a lot/Refused",
  "How would reinstating the Glass-Steagall Act (distancing commercial banking from investment banking) affect economic inequality? Would alleviate a great deal/Would alleviate a fair amount/Would alleviate not too much/Would not affect at all/Refused",
  "Assess the potential role of blockchain technology in reducing economic inequality. Can reduce a great deal/Can reduce a fair amount/Can reduce not too much/Cannot reduce at all/Refused",
  "Can closing tax loopholes for the rich substantially decrease economic disparity? Would decrease a great deal/Would decrease a fair amount/Would decrease not too much/Would not decrease at all/Refused",
  "Do you think easing zoning laws might increase or decrease economic inequality? Increase a lot/Increase a little/Neither increase nor decrease/Decrease a little/Decrease a lot/Refused",
  "Consider the role of financial education in lessening economic inequality. How significant do you think it is? Very significant/Moderately significant/Slightly significant/Not significant at all/Refused",
  "Can you ponder on technology being the driving force behind economic inequality these days? Is the leading cause/A major cause/A minor cause/Not a cause/Refused",
  "Evaluate the potential impact on economic inequality from a national jobs guarantee program. Would have a great impact/Would have a fair impact/Would not have much impact/Would have no impact at all/Refused",
  "Compose a brief description of the economic trends over the last decade. Are they leaning towards equality or widening the gap between the rich and the poor?",
  "Can you expand on how the current state of the job market is impacting the middle class? Has it been uplifting or detrimental to their financial health?",
  "How would you perceive the implications of the rapidly rising cost of higher education on income disparity? Does it increase, decrease or remain neutral towards the inequality?",
  "How significantly do prevailing tax policies contribute to economic inequality? Do they play a significant role, a moderate role, a small role, no role at all, or is it too complex to categorize?",
  "Describe the consequences of automation and AI on job opportunities for low-skilled workers. Are these advancements improving or worsening wealth inequality?",
  "Are small businesses being sufficiently supported in the current economic climate, or is the support majorly geared towards large corporations?",
  "How would you evaluate the impact of government social services on wealth distribution? Are they yielding fruitful results or further contributing to inequality?",
  "Elaborate on the influence of the healthcare system on personal finances amongst different economic classes. Is this influence pronounced, moderate, minimal, or non-existent?",
  "Are current minimum wage laws contributing positively or negatively to the gap between the haves and the have-nots?",
  "Assess the role of global trade policies in shaping local economies. Overall, are these policies promoting fairness or exacerbating inequality?",
  "Does the growth in technology sector jobs give rise to an increased wealth disparity or does it promote a more equal income distribution?",
  "What role does inflation play in wealth inequality? Is it largely responsible, partially responsible, barely responsible or not at all responsible?",
  "How, if at all, do housing policies contribute to the economic divide in urban versus rural areas? Are these contributions substantial, moderate, slight, or non-existent?",
  "Analyze the effects of recession periods on economic inequality. Do they exaggerate, diminish, or maintain the status quo when it comes to wealth disparity?",
  "How far does unequal access to quality education contribute to the perpetuation of economic inequality?",
  "Do you think that the stock market growth benefits everyone equally, or does it favor the wealthy more?",
  "Comment on how the gig economy affects the financial status of individuals. Does it contribute a great deal to the wealth gap, or does it have minimal impact?",
  "How does gentrification impact the socio-economic divide within a city? Are the effects major, minor, or negligible?",
  "Evaluate the impact of lobbying by large corporations on economic inequality. Is it a significant factor, a moderate factor, a minor factor, or not a factor at all?",
  "How much of a role, if any, do environmental policies play in economic inequality? Are they a major component, a minor component, completely unrelated, or depends on the situation?",
  "What would you say is the primary cause of economic inequality in our country? Lack of access to quality education/Economic policies favoring the wealthy/Corporate greed/Social discrimination/Other",
  "Predict the long-term effects of wealth inequality on societal cohesion. Do you foresee Increased conflict/Rise of populist movements/More charitable efforts/More progressive economic policies/No significant change?",
  "Discuss the role, if any, institutions should play in redistributing wealth. Should they play A significant role/A moderate role/Minor role/No role at all/Refused?",
  "What kind of impact do you foresee automation will have on the wealth disparity in the US? Significant increase in disparity/Moderate increase in disparity/No change in disparity/Disparity will decrease/Refused",
  "Predict how much minimum wage legislation can contribute to economic equality. Major contributor/Moderate contributor/Minor contributor/No contribution/Refused",
  "Comment on the impact, if any, rampant consumerism has on economic inequality. Major impact/Moderate impact/Minor impact/No impact/Refused",
  "Estimate the impact of affordable housing policies on reducing wealth disparity. Major impact/Moderate impact/Minor impact/No impact/Refused",
  "Talk about the effect, if any, of an open immigration policy on local economic distribution. Major disruption/Moderate disruption/Minor disruption/No disruption/Refused",
  "What effect do you think affordable tertiary education would have on the economic divide in the US? Major reduction in divide/Moderate reduction in divide/Minor reduction in divide/No effect on divide/Refused",
  "How much should corporations be obligated to equalize economic disparity? Highly Obligated/Moderately Obligated/Not Much Obligated/Not at all Obligated/Refused",
  "What impact do you think offshore tax havens have on societal economic balance? Major effect/Moderate effect/Minor effect/No effect/Refused",
  "How can strengthening of labor unions contribute to reducing income disparity? Major contribution/Moderate contribution/Minor contribution/No contribution/Refused",
  "What percentage of our economic issue do you think is due to healthcare costs? A large percentage/A fair amount/A small percentage/None at all/Refused",
  "How much effect do traditional gender roles have on the economic balance in today's world? Major effect/Moderate effect/Minor effect/No effect/Refused",
  "Give your opinion on the influence, if any, of military spending on national wealth distribution. Major influence/Moderate influence/Minor Influence/No influence/Refused",
  "Debate on the effect that foreign trade policies have on income inequality. Major effect/Moderate effect/Minor effect/No effect/Refused",
  "What is your opinion on taxes? They should be increased for the wealthy/They should be decreased for the wealthy/They should be kept the same for the wealthy/Refused",
  "In your opinion, does the distribution of wealth in this country need to be revised? It needs major revisions/It needs minor revisions/It does not need to be revised/Refused",
  "Is income inequality a major concern for you today? Extremely concerned/Quite concerned/Not too concerned/Not at all concerned/Refused",
  "Do you think minimum wage laws contribute to economic inequality? They contribute a great deal/They contribute a fair amount/They contribute not too much/They do not contribute at all/Refused",
  "In your view, how much role does education play in a person's ability to overcome economic inequality? Plays a large role/ Plays a moderate role/ Plays a minor role/ Does not play any role/Refused",
  "To what extent do you believe laws should be enacted to limit the money that can be earned by top executives? Strongly favor/Favor/Neutral/Oppose/Strongly oppose/Refused",
  "What is your stance regarding universal basic income as a solution to economic inequality? Strongly support/Support/Neutral/Oppose/Strongly oppose/Refused",
  "How would you assess the impact of globalization on economic inequality? It has greatly increased inequality/ It has slightly increased inequality/ It has not made a difference/ It has decreased inequality/Refused",
  "Is upward mobility easily attainable in our current economic climate? Completely attainable/Mostly attainable/Hard to attain/Not attainable at all/Refused",
  "Do you believe in implementing policies that limit corporate power to tackle economic inequality? Strongly support/Support/Neutral/Oppose/Strongly oppose/Refused",
  "What is your viewpoint on higher taxes on the wealthy to fund public services? Highly favorable/ Favorable/Neutral/ Unfavorable/Highly unfavorable/Refused",
  "Do you see financial literacy programs as a solution to economic inequality? Highly effective/Effective/Neutral/Ineffective/Highly ineffective/Refused",
  "What is your sentiment towards the impact of automation on job security? Highly concerned/Concerned/Neutral/Not concerned/Not at all concerned/Refused",
  "How much value do you place on government-led job creation programs as a solution to economic inequality? Highly valuable/Valuable/Neutral/Not valuable/Not at all valuable/Refused",
  "What level of responsibility do you think corporations have in addressing economic inequality? Major responsibility/ Moderate responsibility/ Minor responsibility/ No responsibility/Refused",
  "How much, if at all, do you think the federal minimum wage should be increased to combat economic inequality? Increase a large amount/Increase a moderate amount/Increase a small amount/Do not increase at all/Refused",
  "Is bridging the digital divide important to tackle economic inequality, in your opinion? Extremely important/Quite important/Not too important/Not at all important/Refused",
  "How strongly do you agree that closing the wage gap among different genders and races will contribute to reducing economic inequality in society? Agree strongly/Agree somewhat/Neither agree nor disagree/Disagree somewhat/Disagree strongly/Refused",
  "What is your belief regarding the role that healthcare costs play in exacerbating economic inequality? Have a major role/Have a moderate role/Have a minor role/Have no role at all/Refused",
  "Assess the impact of globalization on the widening of the economic gap within our society. A significant impact/A moderate impact/A slight impact/No impact at all/Refused",
  "How crucial do you believe it is to reform tax laws to address economic inequality? Very crucial/Moderately crucial/Slightly crucial/Not crucial at all/Refused",
  "Do you think increasing federal funding for education would reduce economic inequality? Definitely would/Probably would/Maybe would/Probably would not/Definitely would not/Refused",
  "How likely do you think it is that implementing a universal basic income would effectively reduce economic inequality? Very likely/Moderately likely/Slightly likely/Not at all likely/Refused",
  "What role do you believe corporations play in the perpetuation of economic inequality in this country? Major role/Moderate role/Minor role/no role/Refused",
  "Do you believe that strengthening workers' rights is a good way to tackle economic inequality? Strongly believe/Believe/Neutral/Do not believe/Strongly do not believe/Refused",
  "Do you believe instituting a wealth tax would be effective in mitigating economic inequality? Very effective/Somewhat effective/Neither effective nor ineffective/Not very effective/Not at all effective/Refused",
  "To resolve economic inequality, do you think the government should implement stronger regulations on Wall Street? Should implement/Should not implement/Refused",
  "How likely do you think it is that the following will happen in the next 20 years? Middle-class Americans will become an economic minority. Will definitely happen/Will probably happen/Will probably not happen/Will definitely not happen/Refused",
  "What role does income tax play in fueling economic inequality in this society? It plays a major role/It plays a moderate role/It plays a minor role/It plays no role at all/Refused",
  "How significantly do you believe job automation will contribute to future economic inequality? Contributes greatly/Contributes to some extent/Contributes a little/Does not contribute at all/Refused",
  "Could you please contemplate and share your thoughts on how income inequality affects the economic growth of a country? Do you think there's a positive correlation, or is the effect rather disadvantageous?",
  "How much sway does the minimum wage have, if any, your perception of the economic conditions in our country? Is it too high, too low, or does it not matter at all?",
  "What, in your opinion, is the impact of tax cuts for the wealthy in our country? Do they stimulate economic growth or exacerbate income inequality?",
  "Do you suspect that government interference in the economy can help rectify income inequality? Could you elaborate on your viewpoint?",
  "What effect do you think free trade has on the economy? Does it benefit all equally, favor the wealthy, or disproportionately harm lower-income individuals?",
  "Can you provide a brief explanation of why you think poverty rates in our country are on the rise or decline?",
  "Comparatively, would you say that the gig economy has done more harm or good to the workers? Could you elaborate?",
  "How essential is affordable healthcare in bridging the income inequality gap, according to your understanding?",
  "In your opinion, what influence does immigration have on employment and wage levels in our country? Is it somewhat beneficial or mainly detrimental?",
  "Do you think universal basic income (UBI) should be implemented to alleviate poverty and if so, why? If not, could you provide your reasons?",
  "Are you supportive of policies aimed at redistributing wealth in our society? If you do, could you clarify why; and if you don't, your reasoning for the same?",
  "What effects does the gender wage gap have on the economy, according to your perception?",
  "In your opinion, does the growing student loan debt have a negative impact on our economy and could you explain why?",
  "What impact do you believe automation and AI will have on job markets and therefore, income inequality?",
  "How do environmental policies and regulations affect economic growth, according to you?",
  "What could your ideal tax system look like, to both sustain the economy and address income inequality?",
  "How would you assess the influence of monetary policy on income inequality?",
  "Do you think that ensuring equal access to quality education can reduce income inequality? Please elaborate on your viewpoint.",
  "What sort of economic policies do you believe would most effectively encourage upward mobility and decrease socioeconomic disparity?",
  "In your understanding, how does public debt affect economic stability and income inequality?",
  "Considering the impact of globalization on national economies, do you lean towards Protectionism/Free Trade/Refused?",
  "Assess the effectiveness of social welfare programs in mitigating poverty and inequality. Are they Generally effective/Somewhat effective/Ineffective/Refused?",
  "Do you believe in redistributing wealth by tax policies—supportive of Progressive taxation/Flat tax rate/Refused?",
  "Propose a strategy to address economic inequality. Should the focus be on Raising minimum wage/Creating more jobs/Refused?",
  "In your opinion, does economic inequality call for more Government intervention/Private enterprise involvement/Refused?",
  "Do you perceive offshore tax havens as An economic advantage for the country/A cause of economic inequality/Refused?",
  "Does College debt constitute a major contributor to economic inequality? Agree/Disagree/Refused?",
  "Government-funded college education, is it a Feasible solution/Unrealistic proposal/Refused to address economic inequality?",
  "Do you think corporate tax rates should be Increased/Decreased/Remain the same/Refused to alleviate economic inequality?",
  "How well do you think trade unions are addressing wage inequality? Highly effective/Somewhat effective/Poorly effective/Refused?",
  "Does affordable housing policy play a key role in addressing economic inequality? Agree/Disagree/Refused?",
  "To bridge the wage gap, do you support Equal pay legislation/Market-determined wages/Refused?",
  "In your opinion, should the government provide more subsidies to the Agricultural sector/Technology sector/Refused?",
  "Do you think privatizing public utilities would lead to more Economic efficiency/Inequality/Refused?",
  "Should inheritance taxation be Increased/Decreased/Remain the same/Refused to curb wealth accumulation and inequality?",
  "How much impact do you think changes in the gig economy has on Workers' rights/Job security/Both/Refused?",
  "Do you think retiring baby boomers will Cause an economic strain/Offer new opportunities for younger generations/Both/Refused?",
  "What are your thoughts about the role of government in addressing wealth disparity? Should the government intervene a lot, somewhat, only a little, not intervene at all, or you refuse to answer?",
  "How do you perceive the relationship between free-market capitalism and economic inequality? Does it exacerbate inequality a lot, a little, alleviate inequality a little, alleviate inequality a lot, or have no impact?",
  "In your opinion, does the education system contribute to economic inequality in our country? Contributes significantly, contributes a little, detracts a little, detracts a lot, or doesn't affect?",
  "Do you think that the current tax policy in our country favors the rich, the average, the poor, or is it balanced fairly across all classes?",
  "Would you say that corporate interests in politics accentuate economic inequality? Do they greatly increase inequality, increase it a little, decrease it a little, decrease it a lot, or have no impact?",
  "Are labour unions vital tools for combating economic inequality? Should they have a large role, a moderate role, a small role, no role at all, or you prefer not to answer?",
  "Would you advocate for higher minimum wage as a means to reduce income inequality? Strongly in favor, in favor, opposed, strongly opposed, or refused to answer?",
  "How much does an individual's personal responsibility play a role in overcoming economic adversity? A big role, moderate role, little role, no role, or no opinion?",
  "Do you think progressive tax policies reduce economic inequality? Do they help a lot, help slightly, hurt slightly, hurt a lot, or have no impact?",
  "Is equal opportunity undermined by economic inequality in our nation? Does it greatly impair it, impair it slightly, enhance it slightly, greatly enhance it, or no impact?",
  "Do you think that wealth inherited through generations contributes to economic inequality? It contributes greatly, contributes slightly, reduces slightly, reduces greatly, or no impact?",
  "What is the influence of access to healthcare on economic disparity? It greatly worsens disparity, worsens it slightly, improves it slightly, significantly improves it, or has no effect?",
  "Is providing affordable housing a viable solution to minimize economic inequality? Is it extremely viable, somewhat viable, slightly viable, not viable at all, or refuse to answer?",
  "What effect do you think debt, specifically student debt, has on economic inequality? Increases it drastically, increases it slightly, decreases it slightly, decreases it drastically, or has no effect?",
  "Does unequal access to technology play a significant role in income disparity? It significantly worsens disparity, worsens it slightly, reduces it slightly, significantly reduces it, or has no influence?",
  "In your view, to what extent does gender inequality impact economic inequality? It significantly amplifies it, slightly amplifies it, slightly reduces it, significantly reduces it, or has no influence?",
  "Does racial inequality contribute to the economic division in our society? It greatly exacerbates it, slightly exacerbates it, slightly alleviates it, greatly alleviates it, or no effect?",
  "Would economic literacy programs help in mitigating income disparity in our society? Would it help greatly, help slightly, harm slightly, harm greatly or have no impact?",
  "How much do you think raising the minimum wage would contribute to alleviating economic discrepancies in society? To a large extent/Slightly/Not at all/It might exacerbate them/Refused",
  "To what degree do you believe that reforming the tax system to be more progressive would alleviate income inequality? Extremely/Somewhat/Moderately/Not at all/Refused",
  "How much would impeding offshore tax avoidance assist in addressing economic imbalance in this country? Significantly/Partially/Not at all/It could make it worse/Refused",
  "In your opinion, is the proliferation of freelance and gig economy jobs exacerbating disparities in economic outcomes? Significantly/Partially/Not at all/It could help reduce disparity/Refused",
  "Do you ascribe to the belief that shrinking public sector employment and services has detrimental effects on the state of financial equality? Entirely/Somewhat/Undecided/Not at all/Refused",
  "How much do you think that offering free, universal preschool would aid the reduction of wealth inequality in the country? Terribly/Significantly/Not at all/It might increase it/Refused",
  "How impactful do you believe Wall Street’s practices are in perpetuating gaps in societal wealth? Extremely impactful/Moderately impactful/Not impactful at all/They help reduce such gaps/Refused",
  "What is your perception on the effect of gentrification on social economic imbalances in inner-city communities? Exacerbates them/Has a slight effect/Has no effect/Reduces them/Refused",
  "How much do you believe that supporting small businesses helps to lessen monetary disparities in the country? Considerably/Fairly/Not much/Not at all/It could increase disparities/Refused",
  "Would a federally mandated living wage help bridge the economic divide, in your view? Definitely/Partially/Not sure at all/It could widen the divide/Refused",
  "Do you feel that providing affordable housing can significantly reduce wealth discrepancy? Absolutely/To some extent/No impact at all/It could enhance discrepancies/Refused",
  "Does the commodification of healthcare contribute to economic inequality in your view? Chiefly/Somewhat/Not at all/It helps to level the playing field/Refused",
  "How instrumental would you say that making tertiary education more affordable is in leveling the economic playing field? Very/Somewhat/Indecisive/Not crucial at all/Refused",
  "Does a lack of affordable and easily accessible public transportation contribute to economic inequality? Massively/To a certain degree/Not at all/Helps reduce inequality/Refused",
  "Do you think that providing financial literacy education would mitigate economic disparity? Tremendously/Somewhat/Not much/Not at all/Refused",
  "How observably has global trade affected domestic economic imbalance? Markedly/Ordinarily/Not applicable/It has curbed economic imbalance/Refused",
  "To what extent do you suppose that providing more government subsidies to the working poor would diminish economic injustice? Substantially/Slightly/Not at all/It might worsen it/Refused",
  "How significantly, if at all, do you think green energy investments will tackle societal economic imbalances? Significant influence/Minor influence/No influence/It may make distinctions worse/Refused",
  "How much would gender and racial pay equity policies contribute to reducing economic disparity in your view? A huge amount/A good amount/A small amount/Not at all/Refused",
  "Do you think that encouraging unionization and collective bargaining significantly impacts wage inequality? Absolutely/Sort of/Not at all/It could impact negatively/Refused",
  "Would you agree that automation and technological advancements contribute to job losses and wage stagnation? Completely agree/ Agree/ Neutral/ Disagree/ Completely disagree/ Refused",
  "Can the tax system in this country be considered as a tool to reduce economic inequality or does it exacerbate it? Reduces greatly/ Reduces a fair amount/ Does not affect/ Exacerbates a fair amount/ Exacerbates greatly/ Refused",
  "Do you think a high minimum wage leads to a healthier economy or does it result in fewer jobs and increased expenses for businesses? Leads to healthier economy/ Has no noticeable effect/ Leads to fewer jobs and increased business expenses/ Refused",
  "Do you perceive a major income gap between the wealthy and the poor in our country? Enormous gap/Considerable gap/Some gap/Little to no gap/Refused",
  "To what degree do you feel the economic system favors the rich over the middle class and the poor? Totally favors/ Favors somewhat/ Neutral / Somewhat unfair / Totally unfair / Refused",
  "Do you believe universal healthcare can help reduce economic inequality? Will reduce greatly/ Will reduce moderately/ Will not affect/ Will enhance moderately/ Will enhance greatly/ Refused",
  "Do you feel the cost of education in our country significantly contributes to economic inequality? Contributes greatly/ Contributes fairly/ Contributes not too much/ Doesn't contribute at all/ Refused",
  "In what ways do you think labor unions impact our country's economic inequality? Greatly positive/Gently positive/Neither positive nor negative/Gently negative/Greatly negative/Refused",
  "How crucial is addressing racial and gender wage gaps in the fight against economic inequality? Extremely crucial/ Quite crucial/ Somewhat crucial/ Not crucial/ Refused",
  "Would you agree that offshore tax havens exacerbate economic inequality? Strongly agree/ Agree/ Neutral/ Disagree/ Strongly disagree/ Refused",
  "How important do you think it is to increase social programs like food stamps and unemployment benefits to address economic inequality? Extremely important/ Very important/ Moderately important/ Slightly important/ Not important at all/ Refused",
  "How much do you think a disparity in education contributes to economic inequality? Contributes greatly/ Contributes a fair amount/ Contributes not too much/ Contributes not at all/ Refused",
  "Do you believe that an inheritance tax is a justified means of reducing wealth inequality? Completely justified/ Justified/ Neutral/ Unjustified/ Completely unjustified/ Refused",
  "How influential do you consider corporate lobbying to be on economic inequality? Highly influential/Somewhat influential/Neutral/Not at all influential/ Refused",
  "Do you feel that affordable housing policies can play a role in minimizing economic disparities? A large role/ Some role/ Little to no role/ Refused",
  "How necessary are progressive tax policies for reducing economic inequality? Highly necessary/ Fairly necessary/ Not very necessary/ Not necessary at all/ Refused",
  "What do you think are effective measures to ensure economic growth while maintaining income equality? Increase minimum wage/Tax the ultra-rich more/Provide free education/Improving healthcare/Refused",
  "Do you believe that implementing a universal basic income could effectively reduce economic inequality? Highly effective/Moderately effective/Ineffective/Completely ineffective/Refused",
  "According to you, would progressive tax policies help in reducing economic inequality? Highly likely/Likely/Unlikely/Highly unlikely/Refused",
  "In your opinion, does the rise of automation and artificial intelligence contribute to job inequality? Contributes a lot/Contributes a little/Does not contribute/No opinion/Refused",
  "Do you think small businesses are affected by the current economic policies? Highly affected/Somewhat affected/Not affected at all/Unsure/Refused",
  "What is your view on the wealth accumulated by the top 1% influencing economic inequality? Highly influential/Somewhat influential/Not influential/No opinion/Refused",
  "Would increasing federal funding for education contribute to reducing income inequality? Highly likely/Likely/Unlikely/Highly unlikely/Refused",
  "In your perspective, how significantly have economic globalization processes contributed to the existing economic inequality? Significant contribution/Moderate contribution/Little to no contribution/No opinion/Refused",
  "Do you believe that the wealth gap can be narrowed down by increasing taxes on the rich? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "What do you think about the impacts of capitalism on economic inequality? Highly impactful/Impactful/Not impactful/Negative impact/Refused",
  "How much do you think reducing federal regulations on businesses would contribute to creating more jobs? A great deal/A fair amount/Not too much/Not at all/Refused",
  "What is your opinion on the effects of the current trade war on our national economy? Positively a lot/Positively a little/Negatively a little/Negatively a lot/Refused",
  "What is your stance on the role played by government intervention in controlling economic inequality? Crucial role/Minor role/No role/Harmful role/Refused",
  "How much do you believe that economic growth benefits everyone in society, irrespective of their income levels? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "Would introducing more social welfare programs be an effective measure to alleviate poverty and reduce economic inequality? Highly effective/Effectively/Ineffective/Completely ineffective/Refused",
  "How impactful do you think offshore outsourcing is on domestic job opportunities and wage levels? Highly impactful/Impactful/Not impactful/Negative Impact/Refused",
  "Does the current state of immigration policies have an impact on wage inequality in your view? Impact a lot/Impact a little/No Impact/No Idea/Refused",
  "What is your stance on the contribution of financial deregulations to the growing wealth gap in the country? Major contribution/Minor contribution/No contribution/Don't know/Refused",
  "Do you believe that raising the minimum wage would decrease economic inequality or could it potentially result in job losses? Decreases inequality a lot/Decreases inequality a little/Results in job losses a little/Results in job losses a lot/Neither reduces inequality nor causes job losses/Refused",
  "How impactful do you think large corporations and their business practices are on contributing to economic inequality? Highly impactful/Moderately impactful/Less impactful/Not impactful at all/Refused",
  "In your opinion, could the expansion of healthcare services be a method to address economic inequality? A potent method/A mildly effective method/An ineffective method/Not at all an answer/Refused",
  "How influential do you believe individual financial decisions are in the context of overall economic inequality? Highly influential/Moderately influential/Less influential/Not influential at all/Refused",
  "Do you believe universal basic income (UBI) could be an effective method to tackle economic inequality? Highly effective/A little effective/Ineffective/Not effective at all/Refused",
  "In your view, does a higher progressive taxation on the wealthy address economic inequality? Addresses a lot/Addresses a little/Doesn't address at all/Refused",
  "Do you believe providing more affordable housing options can lead to a reduction in economic inequality? Leads to a great reduction/Leads to a little reduction/Doesn't lead to reduction/Refused",
  "Would a governmental push for stronger labor unions contribute meaningfully to reducing economic inequality? Contributes a great deal/Contributes a little/Doesn't Contribute at all/Refused",
  "How effective do you believe strict financial sector regulation would be in reducing economic inequality? Highly effective/Moderately effective/Least effective/Not effective at all/Refused",
  "In your opinion, to what extent does affordable education play a role in combating economic inequality? Plays a huge role/Plays a moderate role/Doesn't play a role/Refused",
  "Would creating more job opportunities in low-income areas address economic inequality effectively? Highly effectively/Moderately effectively/Least effectively/Ineffectively/Refused",
  "How beneficial do you think investing in clean energy jobs could be towards reducing economic inequality? Highly beneficial/Slightly beneficial/Not at all beneficial/Refused",
  "Do you believe an increase in inheritance tax could play a role in mitigating economic inequality? Significant role/Minor role/No role at all/Refused",
  "To what extent do you think expanding access to quality childcare would help in mitigating economic disparity? Helps a lot/Helps a little/Does not help/Refused",
  "Do you believe equal salary for both genders would reduce economic inequality? Reduces a lot/Reduces a little/Does not reduce/Refused",
  "In your opinion, how much could closing the racial wealth gap impact the overall economic inequality? Highly impactful/Moderately impactful/Less impactful/Not impactful at all/Refused",
  "How favorable are you towards reducing military spending to fund social programs aimed at mitigating economic inequality? Highly favorable/Moderately favorable/Least favorable/Not favorable at all/Refused",
  "Can the government play a pivotal role in reversing the trend of growing wealth inequality by taxing the ultra-rich more rigorously? Highly likely/Likely/Unlikely/Highly unlikely/Refused",
  "Think about the pros and cons of universal basic income. Do you believe it would be a viable solution to address economic inequality? Definitely yes/Probably yes/No Further investigation needed/Definitely no/Refused",
  "Is it justifiable to concern ourselves with the widening wealth gap, even when the economy is growing? Strongly Agree/Agree/Disagree/Strongly Disagree/Refused",
  "Do you consider it essential for corporations to pay higher taxes to support economic equality? Absolutely essential/Very essential/Not so essential/Not at all essential/Refused",
  "How effective would decreasing defense spending and redirecting funds toward social welfare programs be in reducing economic inequality? Extremely effective/Very effective/Moderately effective/Not at all effective/Refused",
  "Envision the implications of automation and AI on job availability. Will they exacerbate economic inequality in the future? Certain to exacerbate/ Likely to exacerbate/May or may not exacerbate/Unlikely to exacerbate/Refused",
  "Do you think a free market economy inherently leads to economic inequality? Always leads/Often leads/Occasionally leads/Never leads/Refused",
  "Is it true that tax cuts for the wealthy result in stronger overall economic performance, thus benefiting everyone irrespective of their wealth? Strongly Agree/Agree/Disagree/Strongly Disagree/Refused",
  "How much impact do you think labor unions can have in reducing income disparity? A great deal/A fair amount/Some/Very little/None/Refused",
  "Is it fair for the wealthiest to pay a significantly higher percentage of their income in taxes compared to the middle class? Extremely fair/Very fair/Slightly fair/Not at all fair/Refused",
  "Can legislation like increasing the minimum wage, establishing paid leave, and affordable childcare effectively reduce income inequality? Likely to reduce/ Possibly will reduce/Likely will not reduce/Certainly will not reduce/Refused",
  "To what extent should the government intervene in regulating wealth redistribution in order to create equal economic opportunities? To a large extent/To a moderate extent/To a small extent/Should not intervene at all/Refused",
  "How much of an impact would a more progressive tax system have on reducing wealth disparity? Huge impact/Moderate impact/Minimal impact/No impact/Refused",
  "Do you believe that loosening regulations on small businesses and startups will help level the economic playing field? Strongly Believe/Believe/Do Not Believe/Strongly Do Not Believe/Refused",
  "How successful would providing quality education universally be in bringing down economic inequality between different classes? Extremely successful/Very successful/Only somewhat successful/Not successful at all/Refused",
  "Is it reasonable to finance public services, like healthcare and education, through higher taxes on the wealthy to reduce economic inequality? Completely reasonable/Reasonable/Unreasonable/Completely Unreasonable/Refused",
  "Could deregulation and lower taxes boost economic growth and ultimately lead to less economic inequality? Definitely yes/Might yes/Might not/Definitely not/Refused",
  "How much effect would reforming campaign finance to reduce the influence of wealthy donors have on improving income inequality? Tremendous/A lot/A little/None/Refused",
  "Do you think that embracing socialist policies can help tackle the issue of income disparity? Fully agree/Somewhat agree/Slighty disagree/Fully disagree/Refused",
  "How impactful would currently proposed “Green New Deal” policies be in addressing the issue of economic inequality? Highly impactful/Moderately impactful/Less impactful/Not impactful/Refused",
  "In your perspective, how would adopting a universal basic income impact income disparity? Significantly Reduce/Reduce/Maintain/Increase/Significantly Increase/Refused",
  "Do you believe that the wealth gap between the rich and the poor is contributing to political division in our country? Very much/Somewhat/Not Much/Not At All/Refused",
  "Would a raise in the federal minimum wage significantly decrease poverty rates in our nation? Very likely/Likely/Unlikely/Very unlikely/Refused",
  "How important are social safety nets, like welfare and food stamps, in curbing financial inequality in the U.S.? Very important/Important/Neutral/Unimportant/Very unimportant/Refused",
  "Do you perceive the current economic system in the U.S to be stacked in favor of the wealthy? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "Do you think CEOs and high-ranking executives earn too much money compared to their employees? Much too high/Too high/About right/Too low/Much too low/Refused",
  "Should the government step in to limit how much CEOs and other high-ranking officials earn, in the interest of reducing wealth inequality? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "How important is equal pay legislation in addressing wage disparity in the nation? Extremely important/Very important/Moderately important/Not at all important/Refused",
  "How strongly does the rising cost of healthcare affect economic inequality? Very strongly/Strongly/Not so strongly/Does not affect at all/Refused",
  "Are labor unions crucial to protecting workers' rights and improving economic equality? Absolutely Necessary/Necessary/Unnecessary/Absolutely Unnecessary/Refused",
  "Do large corporations hold too much power in our current economy, leading to substantial income inequality? Far too much power/Too much power/Just the right amount/Too little power /Far too little power/Refused",
  "Do you believe that more opportunities in higher education would lead to less income inequality? Certainly/Most likely/Maybe/Not likely/Not at all/Refused",
  "Is the lack of affordable housing in major cities a primary driver of economic inequality? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "How much impact does racial discrimination have on wage disparity in our society? Monumental impact/Significant impact/Minimal impact/No impact/Refused",
  "Do you consider income inequality as a significant threat to democracy? Extremely serious/Serious/Not very serious/Not serious at all/Refused",
  "Should it be a governmental responsibility to ensure that everyone has access to affordable internet services in order to lessen the digital divide and its consequential economic disparity? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "Will improvements in our public education system effectively decrease long-term financial inequality by better preparing future generations? Extremely effective/Very effective/Moderately effective/Not at all effective/Refused",
  "Do you believe people with incomes below the poverty line are often overlooked or ignored in economic policies? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "Should the government implement wealth taxation to redistribute resources and address economic inequality? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "Do you agree or disagree that the level of income inequality in our country is problematic? Strongly agree/Agree/Neither agree nor disagree/Disagree/Strongly disagree/Refused.",
  "Based on your observations, would you say that economic mobility is increasing or decreasing in this country? Much higher/Higher/About the same/Lower/Much lower/Refused.",
  "What's your opinion on introducing a wealth tax in order to reduce economic inequality? Strongly favor/Somewhat favor/Neither favor nor disagree/Somewhat oppose/Strongly oppose/Refused.",
  "Do you consider a universal basic income could be a solution to poverty and economic inequalities? Absolutely/Somewhat/Maybe not/Definitely not/Refused.",
  "Do the current tax systems in this country favor the rich over the middle class? Greatly favor/Favor/Neutral/Disfavor/Greatly disfavor/Refused",
  "Do you think a free-market economy is the best way to ensure prosperity and economic growth for all citizens? Strongly agree/Agree/Neither agree nor disagree/Disagree/Strongly disagree/Refused.",
  "What is your stance on increasing minimum wage as a strategy to decrease economic inequality? Very favorable/Favorable/Neutral/Unfavorable/Very unfavorable/Refused.",
  "Do you believe government regulations on businesses reduce or exacerbate economic inequalities? Much more reduce/More reduce/Neither reduce nor exacerbate/More exacerbate/Much more exacerbate/Refused.",
  "How do you feel about the role of unions in reducing income inequality? Extremely positive/Positive/Neutral/Negative/Extremely negative/Refused.",
  "Do you see economic globalization as a contributing factor to the growing wealth gap in our country? To a large extent/To some extent/Not much/Not at all/Refused.",
  "Based on your views, how likely is implementing progressive tax policies to alleviate economic disparity? Very likely/Likely/Neither likely nor unlikely/Unlikely/Very unlikely/Refused.",
  "In what way, do you think automation and artificial intelligence impacts salary distribution and job availability? Major impact/Minor impact/Neutral/Little impact/No impact at all/Refused.",
  "Do you believe an emphasis on college education exacerbates or alleviate economic inequality? Greatly exacerbates/Exacerbates/Neither exacerbates nor alleviate/Alleviates/Greatly alleviates/Refused.",
  "If government was to address economic inequality, should it prioritize investing in public healthcare or private sector competition? Public healthcare/Private sector competition/Both/Neither/Refused.",
  "Do amnesty policies for undocumented immigrants impact economic inequality? Major impact/Some impact/Neutral/Little impact/No Impact/Refused.",
  "How do you perceive the role of big corporations in driving economic disparities? Major role/Moderate role/Minor role/No role at all/Refused.",
  "Do you think policies favoring renewable energy allocation could affect income disparity? Greatly/Somewhat/Not much/Not at all/Refused.",
  "How significant is the role of central banks and their policies in defining wealth distribution within the country? Very significant/Significant/Neither significant nor insignificant/Insignificant/Very insignificant/Refused.",
  "Can you express your thoughts on how the federal government can address income inequality in our society? Do you think Undertaking active steps/Passive steps/No intervention at all/Refused would be the best approach?",
  "What is your view on the current level of income equality in the US? Do you consider it Very unequal/Fairly unequal/Neither equal nor unequal/Fairly equal/Very equal/Refused?",
  "Discuss the effect of raising the minimum wage on the economy. Would you classify it as Extremely positive/Moderately positive/No effect/Negative/Very negative/Refused?",
  "Reflect on the role of Wall Street in our economy. Do you believe it is Extremely significant/Moderately significant/Neither significant nor insignificant/Insignificant/Completely insignificant/Refused?",
  "What priority would you assign to strengthening labor unions as a way of tackling income inequality? A top priority/An important, but not a top priority/A lower priority/Should not be done/Refused?",
  "In your opinion, how influential are income tax policies in mitigating economic inequality? Extremely influential/Fairly influential/Neither influential nor uninfluential/Not very influential/Not at all influential/Refused?",
  "Rank your agreement with this statement: 'The rich should be taxed more to redistribute wealth.' Do you Strongly agree/Agree/Neither agree nor disagree/Disagree/Strongly disagree/Refused?",
  "Can you expound on the influence of globalization on economic inequality within the US? Would you say it is Highly beneficial/Moderately beneficial/Not beneficial or harmful/Moderately harmful/Highly harmful/Refused?",
  "What is your perception of the impact of free trade agreements on the economic inequality in the country? It is Very positive/Mostly positive/Neutral/Mostly negative/Very negative/Refused?",
  "Deliberate upon how much influence technological advancements have on altering economic inequalities. Extremely influential/Quite influential/Neither influential nor uninfluential/Less influential/Not influential at all/Refused?",
  "If you were asked to evaluate the effectiveness of social programs like food stamps in addressing economic inequality, how would you rate them? Extremely effective/Somewhat effective/Neither effective nor ineffective/Not very effective/Not at all effective/Refused?",
  "What level of responsibility do you think individuals have in reducing their own economic inequality? A lot/Some/Only a little/None at all/Refused?",
  "Can you discuss your thoughts on the influence of climate change on economic inequality? Highly significant/Moderately significant/Neither significant nor insignificant/Less significant/Not significant at all/Refused?",
  "What is your evaluation of the current wealth concentration among the top 1% in the US? Extremely concerning/Somewhat concerning/Neither concerning nor unconcerning/Not very concerning/Not concerning at all/Refused?",
  "What's your perspective on middle-class shrinkage and its impact on the economy? It is Extremely detrimental/Moderately detrimental/Has no impact/Moderately beneficial/Extremely beneficial/Refused?",
  "What is your view on the government's role in addressing wealth inherited by elites as a factor in economic inequality? Should it be Intervene a lot/Intervene moderately/Neither intervene nor not/Do not intervene much/Do not intervene at all/Refused?",
  "Considering your personal financial situation, do you believe that increased government regulation of industries benefits or harms you? More benefit/More harm/No significant change/Refused",
  "Based on your understanding, how influential do you reckon economic policies of the government are in determining wealth distribution? Very influential/Fairly influential/Not so influential/Not influential at all/Refused",
  "From your perspective, does the minimum wage in this country suffice to lead a comfortable life? More than enough/Just enough/Insufficient/Extremely insufficient/Refused",
  "In your belief, to what extent are social policies like welfare and universal healthcare pivotal to bridging the gap of wealth disparity? Very crucial/Quite important/Not very important/Not important at all/Refused",
  "According to your line of thinking, should the government intervene more heavily in shaping the economy or let market forces dictate progress? More Intervention/Less Intervention/Neutral/Stance not formed/Refused",
  "How much influence, if any at all, do you think corporate lobbying has on economic inequality? Significant/Some/Little to none/None at all/Refused",
  "Based on your perception, how much faith do you put in the capitalist system in promoting social equality if tweaked properly? A lot/A fair bit/Not much/None at all/Refused",
  "Do you think the government should reduce tax on small businesses to encourage entrepreneurship and reduce income disparity? Definitely/Probably/Probably not/Definitely not/Refused",
  "From your standpoint, are the current tax laws in the country contributory to the widening wealth gap? Strongly contributory/Somewhat contributory/Not very contributory/Not contributory at all/Refused",
  "In your judgment, should high earners and corporations pay more taxes to fund social programs aimed at reducing inequality? Yes, definitely/Yes, probably/No, probably not/No, definitely not/Refused",
  "How essential do you believe education is in addressing economic inequality in society? Utterly essential/Quite essential/Not very essential/Not at all essential/Refused",
  "Is it your belief that the existing social mobility in your country is adequate for reducing economic disparities? Completely adequate/Partly adequate/Barely adequate/In no way adequate/Refused",
  "In your opinion, can stricter regulations on Wall Street curb income inequality? Absolutely/To some extent/Not much/Not at all/Refused",
  "Do you think that wealth concentration in the hands of a few results in economic instability? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "Justifiably, to your mind, how responsible are corporate monopolies in creating wealth imbalances in society? Highly responsible/Moderately responsible/Slightly responsible/Not responsible at all/Refused",
  "According to your thinking, do trade union protections help alleviate wealth distinctness among different social classes? Certainly/possibly/Unlikely/Absolutely Not/Refused",
  "Do you think that globalization is a primary driver of economic inequality? Very probable/Probable/Improbable/Highly improbable/Refused",
  "Do you envision a future where automation and artificial intelligence exacerbate wealth inequality in society? Highly plausible/Plausible/Not very plausible/Not plausible at all/Refused",
  "Do you perceive existing labor laws, including those relating to minimum wages and working hours, as helpful in reducing economic disparities? Very helpful/Fairly helpful/Not very helpful/Not at all helpful/Refused",
  "In your assessment, how instrumental is the wage gap between genders in the broader landscape of economic inequality? Extremely instrumental/Fairly instrumental/Minimal influence/No influence at all/Refused",
  "Given the issue of wealth disparity, do you think it would be beneficial to cap the salaries of top executives at companies? Why or why not?",
  "In your opinion, will implementing policies to support small businesses significantly contribute to minimizing economic inequality?",
  "How much of a role do you believe technological advancement plays in the wage gap and economic inequality? A major role/A minor role/No role at all",
  "Is the idea of Universal Basic Income a feasible solution for addressing economic disparities? What potential impacts could it have?",
  "Outline your thoughts on higher taxes for large corporations and the potential effect on economic balance and inequality.",
  "Do you think gentrification plays a part in economic inequality? How might this issue be better managed?",
  "How effective would stricter laws on offshoring and tax evasion be in reducing economic inequality? Very effective/Somewhat effective/Not effective at all",
  "In terms of income inequality, what is your view on increasing the minimum wage? Would it make a substantial difference/only a slight difference/no difference to the status quo?",
  "What do you believe would be the impact of making high-quality healthcare universally accessible on economic inequality?",
  "Would a progressive taxation system effectively aid in leveling the economic playing field? Share your thoughts.",
  "Could investments in public education be an effective solution to reduce income inequality? Why or why not?",
  "Assess the potential effect of implementing trade protectionism policies on economic disparities.",
  "Do you believe that the gender wage gap contributes to economic inequality? If so, how much? A lot/A little/Not at all",
  "How could strengthening workers' rights and unions help in mitigating the issue of economic inequality?",
  "Looking at the future of work, what impact could automation and AI have on economic disparity?",
  "Reflect on your stance on wealth redistribution as a potential remedy for economic inequality.",
  "Discuss how government subsidies to industries and agriculture could contribute or alleviate economic disparities.",
  "In your opinion, to what extent does social mobility contribute to addressing economic inequality? A lot/A little/Not at all",
  "How do you perceive the impact of immigration, both legal and illegal, on the economic disparity?",
  "Do you think the financial sector, including banking and investment institutions, plays a part in exacerbating economic inequality? In what way?",
  "How could changes in inheritance laws and estate taxes influence the wealth gap and economic inequality?",
  "What's your take on wealth distribution, do you believe wealth in this country is evenly distributed/Favors the wealthy/Favors the middle-class/Favors the poor/Refused?",
  "In terms of healthcare, do you think that the current system Helps the wealthy/Helps the middle-class/Helps the poor/Hurts everyone/Does not significantly affect economic inequality/Refused?",
  "Ponder on the following, do you think that large corporations are Beneficial for the economy/Detrimental for the economy/Neither beneficial nor detrimental/Refused?",
  "Thoroughly contemplate on this, do you think government regulation of big businesses and corporations is Necessary/Unnecessary/Does not matter/Refused?",
  "Reflect deeply, does a free market economic system Increase economic inequality/Decrease economic inequality/Have no significant effect on economic inequality/Refused?",
  "Mull over this, do you view universal basic income as a Potential solution to economic inequality/Potential problem for the economy/Neither a solution nor a problem/Refused?",
  "Ponder over tax policies, do you perceive progressive taxation as Favorable for economic equality/Unfavorable for economic prosperity/Neither favorable nor unfavorable/Refused?",
  "Reflect on economic mobility, does it currently Favor those from wealthier backgrounds/Favor those from less wealthy backgrounds/Doesn't favor any particular background/Refused?",
  "Think about the minimum wage, do you see it as a Tool to combat economic inequality/Reason for economic strain/Neither a tool nor a reason/Refused?",
  "Consider the economy's future and predict, do you think income inequality in the country a year from now will be Better/Worse/About the same as now/Refused?",
  "Estimate the effect tax cuts for the wealthy have on income inequality. Would it make a significant difference/ fair difference/ only a slight difference/ no difference at all?",
  "In your view, to what extent does the federal minimum wage contribute to income disparity? Substantially contributes/ Somewhat contributes/ Barely contributes/ Does not contribute at all.",
  "Mull over the degree to which the healthcare system drives economic disparity in the United States. Is it a significant contributor/ fair contributor/ minor contributor/ no contribution?",
  "Evaluate the influence of labor unions in decreasing income inequality in American society. Is it high impact/ moderate impact/ low impact/ no impact?",
  "What do you presume the impact of affordable higher education would be on the USA's income inequality problem? High impact/ Moderate impact/ Low impact/ No impact?",
  "Decipher the extent to which big tech companies monopolies aggravate income disparity in the United States. Does it exacerbate a lot/ somewhat/ slightly/ not at all?",
  "Given the wealth accumulated by billionaires, how much impact would redistributing this wealth have on economic discrepancies? High impact/ Moderate impact/ Low impact/ No impact?",
  "What do you believe the influence of allowing workers to partake in corporate decision-making (worker cooperatives) could be in minimizing income inequality? Significant influence/ Average influence/ Limited influence/ No influence?",
  "Contemplate the role overtime pay laws may play in reducing the income gap in America. Is it High Degree/ Moderate Degree/ Small Degree/ No Degree?",
  "Consider how much influence affordable childcare might have in decreasing economic disparity in America. Would this have a large impact/ fair impact/ little impact/ negligible impact?",
  "Reflect on the extent to which offshore tax havens exacerbate income inequality. Do they augment a lot/ somewhat/ slightly/ not at all?",
  "What potential impact do you presume a robust social security system would have on economic inequality? High impact/ Moderate impact/ Low impact/ No impact?",
  "Analyze how much influence corporate lobbying has on economic disparity in America. High influence/ Some influence/ Little influence/ No influence?",
  "Mediate on the role a universal basic income could play in combating income inequality. Substantial impact/ Moderate impact/ Slight impact/ No impact?",
  "Assess the degree to which intellectual property (IP) laws add to the economic disparity in the United States. A lot/ Somewhat/ Slightly/ Not at all?",
  "Mastermind a proposal on how the automation of jobs will affect income inequality. Will it drastically increase/ mildly increase/ slightly increase/ not increase at all?",
  "In your perception, if we adjust for inflation, what would be the impact on income inequality? Significant/ Moderate/ Slight/ None?",
  "Evaluate the influence of equitable educational opportunities on the income gap in the United States. Is the impact substantial/ fair/ insignificant/ nil?",
  "Ponder over the role financial literacy could play in reducing income inequality. Would the impact be big/ moderate/ small/ none?",
  "In your estimate, what would be the effect of affordable housing initiatives on income disparity? Would it have a huge impact/ some impact/ little impact/ no impact?",
  "Reflect on the impact of corporate tax rates on economic inequality. Do higher rates help to redistribute wealth and decrease inequality or do you feel they hinder business growth and job creation? Please explain your perspective.",
  "Provide insights on the influence of technological advancements such as automation and artificial intelligence on the job market. Do they increase job opportunities or exacerbate income disparity?",
  "In your perspective, does a universal basic income play a role in easing economic inequality? Would it encourage laziness, or help those in need and stimulate economic activity?",
  "Evaluate the impact of education as a lever for addressing economic inequality. Do you believe an increase in available quality education would lessen this disparity, or is the solution more complex?",
  "Predict how a nationalized healthcare system would influence the U.S. economy. Would it provoke financial stability for families, causing an increase in consumer spending, or result in a drain on national resources?",
  "In terms of economic inequality, dissect the role of minimum wage laws. Are they beneficial in promoting income equality or do they discourage small businesses and create unemployment?",
  "How could progressive taxation influence economic inequality? Does it apportion the tax burden appropriately, or does it discourage wealth generation and investment?",
  "How does housing policy affect this inequality? Are affordable housing initiatives helpful in reducing homelessness and creating economic stability, or do they tend to stifle the real estate market and discourage private investment?",
  "What's your assessment on the role that welfare programs play in the economy? Do they assist those in need and allow them to contribute more to the economy, or do they create dependency and discourage work?",
  "Assess the potential effects of green policies and sustainable practices on economic disparity. Do they offer new opportunities for employment or do they put jobs at risk?",
  "How much influence do you think inflation has on the wealth gap? Does it cause goods and services to become unaffordable for the lower income demographics, or does it boost the economy by encouraging spending?",
  "Project the influence of import tariffs and trade wars on income inequality. Would these protect domestic jobs and decrease inequality, or would they increase prices and hurt consumers?",
  "What role do you reckon student loan policies play in wealth disparity? Can forgiving student loans level the income field, or does it unfavorably redistribute public resources?",
  "Ruminate over the influence of immigration policies on economic inequality. How has controlled and fair immigration impacted job opportunities and wage gaps?",
  "Consider the implications of the gig economy on income inequality. Do you think flexible employment structures provide opportunities for income generation or exacerbate instability and inequality?",
  "Share your perspective on how unionization impacts economic disparity. Can stronger unions ensure fair pay and lessen income inequality, or would they discourage business growth?",
  "What are your thoughts on the influence of monetary and fiscal policy on economic inequality? Can appropriate manipulation of these tools reduce the wealth gap or could it lead to artificial imbalances in the economy?",
  "Discuss the role of financial literacy education in correcting economic inequality. Would advancing such education help individuals make wiser investment decisions and increase wealth, or is it an oversimplified solution?",
  "How much of an impact do agriculture policies have on economic disparity? Does supporting small-scale farmers and local produce decrease or increase inequality?",
  "Contemplate on how globalization is affecting income disparity. Does it increase economic opportunities worldwide or only benefitting developed countries while exploiting developing ones?",
  "How likely do you believe automation will lead to job loss and increased economic inequality? Extremely likely/Somewhat likely/Not very likely/Not at all likely/Refused",
  "Assuming limited resources, would you prioritize education or infrastructure spending to reduce economic disparity? Prioritize education/Prioritize infrastructure/Both should be prioritized equally/Neither should be prioritized/Refused",
  "Which tax policy do you believe would be most effective at reducing income inequality? Implementing a wealth tax/Increasing the corporate tax rate/Reducing tax loopholes for the wealthy/They all are equally effective/None would be effective/Refused",
  "Relatively speaking, should the government focus more on income redistribution or on promoting economic growth to reduce income disparities? Focus on income redistribution/Focus on promoting economic growth/Equal focus on both/Neither/Refused",
  "How significant of an impact do you believe that universal basic income could have on reducing economic inequality in this country? A great deal of impact/A fair amount of impact/Not too much impact/No impact at all/Refused",
  "To what extent do you think student loan forgiveness could impact economic inequality? A great extent/A fair extent/A little extent/No extent at all/Refused",
  "How would you rate the role of affordable housing in addressing income inequality in America? Extremely important/Very important/ Moderately important/Slightly important/Not important at all/Refused",
  "What level of influence do you believe corporate lobbying has on perpetuating economic inequalities? A great deal of influence/A moderate amount of influence/A little influence/No influence/Refused",
  "Considering the wage gap between the wealthiest and poorest, how would you rate the current state of income inequality in the United States? Extremely severe/Very severe/Slightly severe/Not severe at all/Refused",
  "Is the disparity in healthcare access a contributing factor to the wealth gap in the country? Contributes significantly/Contributes moderately/Contributes negligibly/Does not contribute/Refused",
  "Does access to affordable housing influence the rate of poverty in our society? Influences a great deal/Influences a fair amount/Influences not too much/Does not influence at all/Refused",
  "Given our economic system, do you think everyone has an equal chance at financial success? Most people have a fair shot/Some people have a fair shot/Only a few have a fair shot/No one has a fair shot/Refused",
  "Do you think raising the minimum wage would minimize the wealth gap in this country? Would minimize a great deal/Would minimize somewhat/Would make no difference/Would exacerbate the issue/Refused",
  "What impact do you think student loan debt has on income inequality? Contributes significantly/Contributes moderately/Contributes a little/Does not contribute at all/Refused",
  "In your view, is racial discrimination a factor in the economic inequality evident in the country? A significant factor/A moderate factor/An insignificant factor/Not a factor at all/Refused",
  "Do the employment industries available in a region contribute to regional wealth disparities? Contributes significantly/Contributes moderately/Contributes a little/Does not contribute at all/Refused",
  "How significantly do you think corporate greed affects wealth distribution in our country? Affects a great deal/Affects somewhat/Does not affect much/Does not affect at all/Refused",
  "What influence does government regulation have on economic disparity? A significant influence/A moderate influence/A minor influence/No influence/Refused",
  "Is the availability of technology and Internet access a factor in income inequality? A major factor/A moderate factor/A minor factor/Not a factor/Refused",
  "How much would a more progressive tax system alleviate income inequality? Would alleviate a lot/Would alleviate somewhat/Would make no difference/Would exacerbate the issue/Refused",
  "Can equal pay policies help reduce income inequality? Would help a lot/Would help somewhat/Would make little difference/Would not help at all/Refused",
  "How much does gender discrimination impact income inequality? Impacts significantly/Impacts moderately/Impacts a little/Does not impact at all/Refused",
  "Do you think union representation can influence wage disparities? Influences significantly/Influences moderately/Influences a little/Does not influence at all/Refused",
  "Can government welfare programs effectively reduce poverty? Can reduce significantly/Can reduce somewhat/Can reduce a little/Cannot reduce at all/Refused",
  "How influential do you think globalization has been in exacerbating income inequality? Has it had a Major effect/A moderate effect/Minor effect/No effect at all/Refused",
  "Can the model of capitalism we follow be blamed for economic inequality? What are your thoughts on this statement: Capitalism is to blame for economic inequality/ Capitalism is not to blame for economic inequality/Refused?",
  "What are your views on the idea of Universal Basic Income (UBI) as a measure to reduce income disparity? Highly effective/ Somewhat effective/ Slightly effective/ Not at all effective/Refused",
  "What impact do you think the lack of access to quality education has on income inequality? Major impact/ Moderate impact/ Minor impact/ No impact at all/ Refused",
  "To what extent would increasing taxes on the wealthy contribute to reducing economic disparity? Extremely significant contribution/ Moderate contribution/ Minor contribution/ No contribution at all/ Refused",
  "Evaluate the proposition: Technological advances and automation have led to income disparity. Strongly agree/ Agree somewhat/ Disagree somewhat/ Strongly disagree/ Refused",
  "What's your opinion on implementing wealth taxes to combat economic inequality? Do you think it would be Extremely effective/ Somewhat effective/ Slightly effective/ Not effective at all/Refused?",
  "How do you perceive the effect of financial institutions, such as banks and hedge funds, on economic inequality? Increase inequality significantly/ Increase inequality slightly/ No effect on inequality/ Decrease inequality slightly/ Decrease inequality significantly/ Refused",
  "In terms of reducing economic disparity, how effective would overhauling the healthcare system be? Very effective/ Somewhat effective/ Not very effective/ Not effective at all/ Refused",
  "What are your views on the impact of housing policies on economic inequality in the U.S? Significant impact/Some impact/ Minimal impact/ No impact at all/Refused",
  "What's your stance on the effect trade policies have on American jobs and income inequality? Strong positive effect/ Moderate positive effect/ No effect/ Moderate negative effect/ Strong negative effect/Refused",
  "How do you rate the performance of the Federal Reserve in managing income inequality issues? Excellent/ Good/ Fair/ Poor/ Refused",
  "How would the introduction of more stringent labor laws affect the wage gap? Considerably reduce the wage gap/ Slightly reduce the wage gap/ Remain the same/ Slightly increase the wage gap/ Considerably increase the wage gap/ Refused",
  "Would guaranteeing jobs for the unemployed significantly reduce economic disparity in our society? Definitely/ Probably/ Maybe/ Probably not/ Definitely not/ Refused",
  "How do you perceive the impact of fiscal policies on income inequality? Very significant/ Somewhat significant/ Not very significant/ Not significant at all/ Refused",
  "Rate the importance of reforming the criminal justice system in addressing economic inequality? Extremely important/ Very important/ Somewhat important/ Not at all important/ Refused",
  "What is your opinion on the relationship between corporate profit-making and economic inequality? Direct correlation/ Indirect correlation/ No correlation/ Inverse correlation/ Refused",
  "What impact does the gig economy and contingent workforce have on the rate of economic inequality? Strong increase/Some increase/No impact/Some decrease/Strong decrease/Refused",
  "What's your stance on how the social security system is affecting economic inequality? Major contributor/Moderate contributor/Neutral/Reduces inequality slightly/Reduces inequality significantly/Refused",
  "Are you in favor of increasing minimum wage as a solution to bridge the wealth gap? Agree/Disagree/Indifferent/Refused",
  "Do you believe the gender wage gap contributes to overall economic inequality? Yes/No/Refused",
  "Should investment in public education be one of the strategies to reduce economic inequality over the long term? Should/Should not/Refused",
  "What role do you believe free trade policies play in exacerbating or mitigating economic inequality? Exacerbating/Mitigating/None/Refused",
  "Can technology bridge the economic gap in labor markets, or does it exacerbate inequality? Bridges the gap/Exacerbates inequality/Neither/Refused",
  "How much influence do large corporations have over economic inequality? Lots of influence/Little influence/No influence/Refused",
  "Should reducing the wealth gap include higher taxation of the ultra-rich class? Yes/No/Refused",
  "Would job guarantee programs be a successful mechanism to reduce income inequality? Yes/No/Maybe/Refused",
  "Do you think affordable higher education can play a significant role in reducing economic disparity? Yes/No/Not sure/Refused",
  "Is it beneficial for the government to subsidize industries that pay above-average wages to decrease income inequality? Yes/No/Not sure/Refused",
  "Should the government control prices of essential commodities to curb economic inequality? Yes/No/Not sure/Refused",
  "Do you think affordable housing policies would alleviate the consequences of economic inequality? Yes/No/Not sure/Refused",
  "Would you consider promoting entrepreneurship among underprivileged groups a solution to economic inequality? Yes/No/Neutral/Refused",
  "Do you believe that reducing military spending could redirect necessary funds to decrease economic disparity? Yes/No/Not sure/Refused",
  "Is privatization of public services contributing to growing economic inequality? Yes/No/Neutral/Refused",
  "Do you think policies promoting green energy jobs will help reduce income inequality? Yes/No/Not sure/Refused",
  "Are labor union protections vital for addressing wage disparity? Yes/No/Neutral/Refused",
  "Can stricter regulation of Wall Street reduce the economic inequality in our society? Yes/No/Not sure/Refused",
  "Imagine that you are in a position of policy-making power. Explain how you would allocate resources to address wealth distribution in the country. Would you prioritize more funding for public services or lower taxes for the wealthy to stimulate the economy?",
  "Do you agree or disagree with the statement that corporations wield too much power and influence over the economy? Are strict regulations necessary to curb this power, or should we let the free market prevail?",
  "Consider the concept of a universal basic income (UBI), where the government provides everyone with a regular income no matter their employment status. Would you support or oppose the implementation of it in our society? Why?",
  "To what extent do you think the influx of automation and artificial intelligence will impact job opportunities and overall economy? Would the implementation of more advanced technologies exacerbate income inequality or help balance it?",
  "What measures, if any, would you suggest taking to give women, minorities, and other marginalized groups more economic opportunities? Should the government intervene more directly in this, or should the market be allowed to correct itself?",
  "Do minimum wages play a key role in maintaining economic equilibrium, or do they pose a burden on entrepreneurs, thereby negatively impacting the economy? How would you handle this issue?",
  "Do you concur or disagree that the expansion of renewable energy industries can be a solution to both environmental and economic issues? How could this transition to clean energy affect income disparity?",
  "How much do labor unions contribute to implementing fairness in wage policies? Should their power be increased or decreased to improve the economic status of workers?",
  "Given that today's students are tomorrow's workforce, how would you approach investment in education to combat economic disparity? Would you suggest free college education or a different approach, and why?",
  "What are your thoughts on the role of trade policies in enhancing domestic economic capacities? Are these policies beneficial in reducing economic inequality, or do they exacerbate it?",
  "Discuss the power dynamics between rural and urban economies. How does this dichotomy influence overall economic stability and balance?",
  "Does the role of philanthropy from billionaires significantly impact the overall reduction of economic inequality? Express your opinion.",
  "Discuss the role of fiscal policy in affecting economic equality. Would you lean towards expansionary policies or contractionary ones, and why?",
  "Share your thoughts on the wealth gap between different generations. Do you see any necessary steps to bridge this gap, and how can the government help?",
  "What policies would you propose to improve the economic situation of the middle class? Do you believe they need more support from the government or not?",
  "The healthcare industry is a major factor in our economy. How should the government approach this sector in terms of pricing regulations and its impact on income inequality?",
  "Do you believe that affordable housing policies are a tool to reduce economic disparity? What's your stance on government intervention in the housing market?",
  "What is your view on immigration policies and their impact on economic equality? How does the influx of foreign workforce affect wage distribution and overall economic progression?",
  "Numerous veterans and military families struggle economically. How do you suggest the government should support them to address this issue?",
  "How much influence should the government have in regulating the stock market? Can it help in reducing economic inequality, while preserving the principles of a free market?",
  "Assuming the government could take specific actions, should they implement higher tax rates for the wealthy or promote entrepreneurship as a means to reduce economic inequality? Higher tax rates for the wealthy/Promote entrepreneurship/Refused",
  "What's your opinion on the role of large corporations in exacerbating economic inequality in our society? They play a huge role/ They play some role/ They play little role/They play no role at all/ Refused",
  "In the rift between the rich and the poor, what role do you believe access to technology plays? Plays a significant role/ Plays a moderate role/ Plays a minimal role/ Plays no role at all/ Refused",
  "To bridge the wealth gap, do you believe it's more effective to grant more subsidies for small businesses or to implement policies to break up monopolies and oligopolies? Grant more subsidies/ Break up monopolies and oligopolies/ Refused",
  "To what degree do you think that reducing the gender wage gap would illuminate the path towards diminishing economic inequality? A great deal/ A fair amount/ Not too much/ Not at all/ Refused",
  "How much reduction in economic inequality, if any, do you think would develop from ensuring equal access to quality healthcare? MASSIVE reduction/ CONSIDERABLE reduction/ SLIGHT reduction/ NO reduction at all/ Refused",
  "What significance, if any, does Wall Street's influence hold in exacerbating or alleviating economic inequality? Greatly exacerbates/ Somewhat exacerbates/ Somewhat alleviates/ Greatly alleviates/ Has no effect/ Refused",
  "To tackle economic inequality, do you feel regulations should be placed on money in politics or on wealthy individuals' influence on policy-making? Regulations on money in politics/ Regulations on wealthy individuals' influence/ Refused",
  "Do you believe opportunities for higher education play a significant role in lessening economic inequality? Plays a significant role/ Plays some role/ Plays minimal role/ Plays no role/ Refused",
  "What influence, if any, do financial crises have on widening wealth disparity in the country? A significant influence/ Some influence/ Little influence/ No influence/ Refused",
  "What is your opinion on the influence of tax policies on economic inequality? Would lowering taxes on the wealthy lead to a trickled-down economic effect? A great deal/A fair amount/Not too much/Nothing at all/Refused",
  "To what extent do you think raising the minimum wage would impact economic inequality and poverty rates? Substantially/In some measure/Insignificant effect/None whatsoever/Refused",
  "Considering the increasing economic divide, how effective would a Universal Basic Income (UBI) program be in bridging this gap? Highly effective/Somewhat effective/Not very effective/Not at all effective/Refused",
  "How do you perceive the role of occupational zoning restrictions in contributing to economic inequality? A substantial factor/A moderate factor/Small contributor/Not a contributing factor at all/Refused",
  "Based on your perspective, would encouraging unionization significantly reduce income inequality in the country? To a large extent/To a minor extent/Barely/Not at all/Refused",
  "Can you attribute the lack of affordable housing to increased levels of poverty and inequality? A lot/To some extent/Just a little/Not at all/Refused",
  "Do trade restrictions, such as tariffs, boost economic inequality in a country or reduce it? Significantly increase/Somewhat increase/Slightly reduce/Majorly reduce/Refused",
  "Do you agree that expanding the social security net will greatly diminish economic disparities? A great deal/A fair amount/Not too much/Nothing at all/Refused",
  "How much influence do you think disruptive technology and automation have on current income inequality? High impact/Moderate impact/Low impact/No impact/Refused",
  "Would a wealth tax on the richest segment of society have a profound impact on economic inequality? Considerably/To a fair degree/To a minor degree/Not at all/Refused",
  "Do you think a “Medicare for All” healthcare system would significantly address economic inequality concerns? Major effect/Moderate effect/Minor effect/No effect/Refused",
  "Can investments in education fundamentally address the issue of economic inequality? Monumental scale/Moderate scale/Minimal scale/None at all/Refused",
  "Do you believe that wage stagnation is a major contributor to economic inequality? Major impact/Minor impact/Minimal impact/No impact/Refused",
  "How do you evaluate the role of subsidized childcare in combatting income inequality? Highly impactful/Moderately impactful/Barely impactful/Not impactful at all/Refused",
  "How much do you think campaign finance reform could influence economic inequality? A substantial amount/A moderate amount/Just slightly/None at all/Refused",
  "Do you think deregulating the financial sector would escalate or lessen economic inequality? Greatly escalate/Some escalation/No noticeable change/Considerable easing/Refused",
  "Is Wall Street an enormous contributor to widening economic gaps in the U.S society? Immensely/A great deal/To some extent/Not at all/Refused",
  "Are corporate bailouts a significant factor in expanding economic inequality? Extremely significant/Moderately significant/Slightly significant/Not at all significant/Refused",
  "Do you believe austerity measures amplify or mitigate economic disparity issues? Amplify considerably/Somewhat amplify/Barely effect/Contribute to mitigation/Refused",
  "Could financial literacy programs drastically reduce economic inequality? Tremendously/Fairly/Insufficiently/Not at all/Refused",
  "To what extent do you believe the recent tax reforms have influenced wealth inequality in the country? A great deal/A fair amount/Not too much/Nothing at all/Refused",
  "Do you perceive universal basic income as an effective measure to eliminate poverty and reduce wealth disparity? Absolutely/To a certain extent/Not much/Not at all/Refused",
  "How significantly, in your opinion, does affordable higher education play a role in closing the wealth gap? Extremely/Significantly/Moderately/Slightly/Not at all/Refused",
  "Can raising the minimum wage deliver a considerable blow to economic inequality? Absolutely/To an extent/Doubtfully/Not at all/Refused",
  "In your opinion, do the current economic policies favor the rich, thereby contributing to income disparity? Extremely/Significantly/Moderately/Slightly/Not at all/Refused",
  "How effective are labor unions in combating wage inequality, according to you? Extremely effective/Fairly effective/Slightly effective/Not effective at all/Refused",
  "Do you consider regressive taxation as one of the significant contributors to the wealth gap? A great deal/A fair amount/Not too much/Nothing at all/Refused",
  "Could improved financial regulation notably curb wealth disparity? Definitely/Probably/Perhaps/Not really/Refused",
  "How critical a role does lack of healthcare access play in exacerbating poverty and economic disparity? Extremely critical/Quite critical/Somewhat critical/Not so critical/Not critical at all/Refused",
  "Is gentrification a significant factor driving economic inequality in urban areas? Definitely/Probably/Perhaps/Not really/Refused",
  "How much does inadequate access to technology and the internet contribute to economic inequality, according to you? A great deal/A fair amount/Not too much/Nothing at all/Refused",
  "Do racial disparities play a significant role in widening the economic gap? Extremely significant/Quite significant/Moderately significant/Slightly significant/Not significant/Refused",
  "How much of an impact do you think investing in high-quality early childhood education could have on diminishing income inequality? A great deal/A fair amount/Not too much/Nothing at all/Refused",
  "Do you consider supporting small businesses as a viable approach to counter economic inequality? Highly Considerable/Fairly Considerable/Slightly Considerable/Not at all considerable/Refused",
  "Can the so-called 'Gig Economy' intensify the wealth gap? Absolutely/To a certain extent/Not much/Not at all/Refused",
  "To what extent would overhauling the criminal justice system tackle poverty and economic disparity? A great deal/A fair amount/Not too much/Nothing at all/Refused",
  "Do you believe an emphasis on green jobs and renewable energy could help reduce economic inequality? Emphatically/Acknowledgeable/Doubtfully/Indubitably/Refused",
  "Do you believe unemployment is a major issue currently impacting the country's economy? Major issue/Minor issue/Not an issue at all/Refused",
  "What's your opinion on the impact of technology on job availability? Are they creating more jobs than they eliminate or vice versa? Creating more jobs/Eliminating more jobs/Neutral impact/Refused",
  "Should wealth tax be introduced to reduce wealth inequality in the society? Totally agree/Somewhat agree/Somewhat disagree/Totally disagree/Refused",
  "Which statement aligns more with your beliefs? Government should take more responsibility to reduce income inequality/Individuals should take more responsibility/Shared responsibility/Refused",
  "Are affirmative action policies necessary to confront segregation and wealth gap issues in our society? Totally necessary/Partly necessary/Not necessary at all/Refused",
  "Does having a policy that ensures a living wage help reduce poverty? Very helpful/Somewhat helpful/Not helpful/Refused",
  "What is your view on wealth redistribution via high taxes for the super-rich? Favorable/Partly favorable/Unfavorable/Refused",
  "Given a choice, would you opt for a universal basic income system in the country? Yes, definitely/Yes, but with reservations/No, but I'm open to arguments against it/Absolute no/Refused",
  "Do you think investing more in education and infrastructure would help in reducing economic inequality? Definitely would help/Probably would help/Probably wouldn't help/Definitely wouldn't help/Refused",
  "Is access to healthcare a right everyone should be able to afford regardless of their economic status? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "Should corporations be required to pay more in taxes to help alleviate economic inequality? Absolutely/Somewhat/Not at all/Refused",
  "Do you agree with the statement: The wealth gap in the society is primarily due to lack of opportunities for the poor? Fully agree/Somewhat agree/Somewhat disagree/Fully disagree/Refused",
  "Do you think the government should provide more subsidies to help the poor and disadvantaged? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "Would forgiving student loan debt significantly improve the economic prospects of young Americans? Highly Likely/Likely/Unlikely/Highly Unlikely/Refused",
  "Do you believe a universal healthcare system would lead to a fairer society? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "Do you believe restrictive immigration policies can negatively impact the economy? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "In the context of the United States' economy, how would you rate the effectiveness of wealth redistribution in alleviating economic inequality? Highly effective/Effective/Ineffective/Highly ineffective/Refused",
  "Imagine 15 years into the future, what impact do you foresee for technology on job availability? Will it Create more jobs/Eliminate jobs/Have no impact/Refused",
  "In your opinion, how crucial is the role of small businesses in promoting economic equality? Highly crucial/Crucial/Non-essential/Not at all essential/Refused",
  "Considering economic policy, how important is tax reform in addressing wealth inequality? Extremely important/Important/Minimally important/Not important at all/Refused",
  "Concerning issues related to income gap, how much value does increasing minimum wage carry in closing this gap? A great deal of value/Some value/Little value/No value/Refused",
  "In your opinion, how effective could trade policies be in promoting domestic manufacturing jobs? Highly effective/Effective/Ineffective/Highly ineffective/Refused",
  "Thinking about the impact of globalization, how much does it affect economic inequality within countries? Greatly/Somewhat/Not much/Not at all/Refused",
  "From an economic perspective, how much influence do labor unions have on ensuring fair wages and working conditions? Too much influence/Just about right/Too little influence/No influence at all/Refused",
  "In the context of mitigating income inequality and poverty, what is the potential impact of universal basic income (UBI)? Significantly positive/Positive/Negative/Significantly negative/Refused",
  "How do you foresee the impact of renewable energy industries on job creation in the next 20 years? Substantial increase in jobs/No significant change/Substantial decrease in jobs/Refused",
  "Looking at measures to counter economic disparity, how much value do you place on public education in equipping the future workforce? Enormous value/Great value/Little value/No value at all/Refused",
  "How much do you think the rise of the gig economy has contributed to income inequality? Greatly contributed/Contributed partially/Has minimal contribution/No contribution/Refused",
  "How crucial is affordable healthcare in ensuring a better standard of living for low-income families? Extremely crucial/Crucial/Non-essential/Not at all essential/Refused",
  "How do you see the influence of automation on the job market in the next decade? Will lead to massive job losses/Will lead to some job losses/No significant effect/Lead to job growth/Refused",
  "How much do increased tariffs influence domestic manufacturing? A great deal/Some/Not much/Not at all/Refused",
  "Considering social mobility, how effective do you think higher education is in uplifting individuals from low-income backgrounds? Highly effective/Effective/Ineffective/Highly ineffective/Refused",
  "How impactful will cryptocurrencies be on the traditional banking sector in the next decade? Highly impactful/Impactful/Non-impactful/Not impactful at all/Refused",
  "Regarding government spending, how effective is military spending in promoting economic growth? Highly effective/Effective/Ineffective/Highly ineffective/Refused",
  "In the context of tax breaks for corporations, how much do you think they contribute to wealth inequality? A great deal/Some/Not much/Not at all/Refused",
  "Take into consideration the current economic climate, do you believe a system advocating for universal basic income would curtail the rising disparity in wealth distribution? Agree/Disagree/Not sure",
  "Do you think regulations on businesses by government incites or hampers economic growth and why?",
  "Given the rise of automation and AI, do you think there will be a substantial loss of jobs over the next 20 years or will new job opportunities emerge? Loss of jobs/Emergence of new jobs/Neither/Both",
  "Between progressive tax structure and flat tax structure, which do you think can more efficiently alleviate economic inequality? Progressive tax/Flat tax/Don't Know",
  "In your opinion, will the transition to a green economy lead to economic upheaval or create new job opportunities? Economic upheaval/New job opportunities/Both/None",
  "Do you believe trade agreements like NAFTA and Trans-Pacific Partnership are primarily job stealers or job creators for Americans? Job stealers / Job creators / Neither / Don't Know",
  "Should the minimum wage be increased substantially to curb poverty? Yes/No/Not sure",
  "In tackling income inequality, who should bear the primary responsibility: the government, private businesses, or individuals themselves? Government/Private businesses/Individuals/All of the above",
  "Do you perceive welfare programs as a burden on the economy or a necessary safety net for the vulnerable? Burden on economy/Necessary safety net/Both/Neither",
  "Does investing heavily in education and healthcare reduce inequalities or increase overall public spending without benefiting the economy? Reduce inequalities/Increase public spending without benefiting the economy/Both/Neither",
  "In your view, would a wealth tax on the super-rich help re-balance income inequality or stifle investment and economic growth? Help re-balance income inequality/Stifle investment and economic growth/Both/Neither",
  "How do you evaluate the impact of technology companies on economic inequality: Are they exacerbating the issue or providing more opportunities? Exacerbating the issue/Providing more opportunities/Both/Neither",
  "Should the Federal Reserve focus more on controlling inflation or reducing unemployment? Controlling inflation/Reducing unemployment/Both are equally important",
  "Will universal access to free high-quality education reduce income inequality in the US? Yes/No/Maybe",
  "Do you think healthcare should be a basic right for all, regardless of ability to pay, or a privilege based on one's financial capabilities? Basic right/Privilege/Don't Know",
  "In the context of economy and inequality, how do you rate the idea of trickle-down economics - where benefits given to the wealthy will eventually trickle down to everyone else in the society? Effective/Ineffective/Neutral/Not Sure",
  "Should large corporations receive government subsidies, or should that money be used to help small businesses thrive? Large corporations/Small businesses/Both/Neither",
  "Does preparing the workforce for the changing demands of the job market require primarily governmental intervention (e.g., education policy, job training programs) or private sector initiatives? Governmental intervention/Private sector initiatives/Both/Not sure",
  "How much, if at all, do you think the existence of a wealth tax would contribute to decreasing economic inequality in the U.S? A significant contribution/A reasonable contribution/Minimal contribution/No contribution at all/Refused",
  "Do you see automation and digitization as a threat or opportunity for alleviating wealth disparities in our country? A substantial threat/A potential threat/A partial opportunity/A substantial opportunity/Refused",
  "How strongly do you believe that gentrification is contributing to the widening wealth gap in urban areas? Strongly contribute/Fairly contribute/Minimally contribute/Do not contribute/Refused",
  "Do you think fostering entrepreneurship in marginalized communities would help in reducing economic disparities? Significantly help/Somewhat help/Help a little/Not help at all/Refused",
  "Do you think global trade policies are contributing to the increase or decrease of domestic job opportunities, affecting the class disparity? Contributing a lot/Contributing a little/Contributing not much/Contributing not at all/Refused",
  "Do you feel that the current rate of home evictions is contributing significantly to economic inequality? Contributing significantly/Contributing reasonably/Contributing barely/Not contributing/Refused",
  "Looking ahead 20 years, how do looming climate change effects change our understanding of potential economic inequality? Change a lot/Change somewhat/Change a little/Change not at all/Refused",
  "How intensely do you think that the lack of representation in political offices contributes to economic disparity? Very intensely/Moderately/Not too intensely/Not at all/Refused",
  "Do you believe that affordable childcare could help mitigate the gender pay gap, thereby tackling a part of economic inequality? Help greatly/Help moderately/Help minimally/Not help at all/Refused",
  "How much do you believe restricting CEO pay would reduce economic equality? Reduce considerably/Reduce moderately/Reduce slightly/Not reduce at all/Refused",
  "What is your conviction on funding comprehensive financial education as a measure to decrease economic inequality? Strong conviction/Mild conviction/Slight conviction/No conviction/Refused",
  "Do you suppose that piloting wealth redistribution policies could play a substantial role in combating economic disparity? Play a substantial role/Play a moderate role/Play a minor role/Play no role/Refused",
  "How forcefully do you think that closing tax loopholes for the wealthy could lessen economic inequality? Forcefully/Moderately/Minimally/Not at all/Refused",
  "What effect would promoting unionization have on reducing income inequality, according to you? Strong effect/Moderate effect/Light effect/No effect/Refused",
  "Do you think providing affordable health care could alleviate some aspects of economic inequality? Alleviate significantly/Alleviate moderately/Alleviate a bit/Not alleviate at all/Refused",
  "How much do you think increasing the minimum wage could play a role in reducing the economic inequality? A significant role/A fair role/A minor role/Not a role at all/Refused",
  "To what extent do you believe that the social security system is currently contributing to economic equality? Greatly contributing/Fairly contributing/Not contributing much/Not contributing at all/Refused",
  "Do you think that effective financial regulation is currently mitigating or exacerbating economic inequality in the country? Mitigating substantially/Mitigating a little/Exacerbating a little/Exacerbating substantially/Refused",
  "How significant of a role do you think that tax codes play in income inequality in our country? A very significant role/A somewhat significant role/Not a very significant role/No role at all/Refused",
  "Do you believe the current minimum wage in the country is sufficient for a decent standard of living? More than sufficient/Just sufficient/Not sufficient at all/Refused",
  "In terms of economic growth, how impactful do you believe small businesses are in comparison to large corporations? A lot more impactful/Somewhat more impactful/Equally impactful/Somewhat less impactful/A lot less impactful/Refused",
  "How critical do you think education is in reducing economic inequality in our society? Extremely critical/Very critical/Somewhat critical/Not at all critical/Refused",
  "Based on the current economic trends, do you think the wealth gap in our country will widen or narrow in the next 10 years? Widen/Narrow/Remain the same/Refused",
  "How effective do you think government subsidies are in stimulating economic growth and reducing poverty? Extremely effective/Very effective/Somewhat effective/ Not effective at all/Refused",
  "In your opinion, does affordable healthcare provision contribute to bridging the economic gap in the country? Contributes greatly/Contributes somewhat/Does not contribute/Refused",
  "Do you hold the view that tax incentives for the wealthy help in boosting economic growth? Significantly contribute/Somewhat contribute/Does not contribute/Refused",
  "In your opinion, do labor unions play a crucial role in mitigating wage inequality? Play a significant role/Play a moderate role/Play a minor role/Do not play any role/Refused",
  "How important do you think governmental social safety nets are for reducing poverty and inequality? Extremely important/Very important/Not very important/Not important at all/Refused",
  "How much does the cost of higher education contribute to income inequality in our country? Contributes significantly/Contributes moderately/Contributes minimally/Does not contribute/Refused",
  "How necessary is it to reform welfare policy in order to address income inequality? Extremely necessary/Moderately necessary/ Slightly necessary/Not necessary at all/Refused",
  "To what extent do you think trade unions help in preventing exploitation of workers by employers? Great extent/Moderate extent/Small extent/No extent at all/Refused",
  "How significant is the role of technology and automation in increasing income disparity? Extremely significant/Very significant/Slightly significant/ Not significant at all/Refused",
  "Do you believe that affordable housing policies contribute to reducing economic inequality in our society? Contribute greatly/Contribute somewhat/Do not contribute/Refused",
  "To what extent do you think current job outsourcing trends impact economic inequality? Greatly impact/Moderately impact/ Slightly impact/Do not impact/Refused",
  "Do you hold the view that stringent financial regulations are necessary for a fair distribution of wealth in the economy? Very necessary/Somewhat necessary/Not necessary at all/Refused",
  "In your opinion, do immigration policies have an impact on economic equality in the country? Significant impact/Moderate impact/Minimal impact/No impact/Refused",
  "To what extent do you believe that the national minimum wage policy affects economic inequality? Affects significantly/Affects moderately/Affects slightly/Does not affect/Refused",
  "What's your view on the influence of trade policies on income distribution, job security and the overall health of our economy? Greatly positive/Moderately positive/Neither positive nor negative/Moderately negative/Greatly negative/Refused",
  "In your opinion, do tax breaks for large corporations contribute significantly to the economic disparity in the country? Contribute greatly/Contribute moderately/Contribute slightly/Do not contribute/Refused",
  "How much influence do you believe the availability of quality healthcare has on economic inequality? Great influence/Moderate influence/Little influence/No influence/Refused",
  "In your view, does the distribution of wealth impact the overall social cohesion of a country? Impacts significantly/Impacts moderately/Impacts slightly/Does not impact/Refused",
  "How impactful do you consider the student loan debt crisis to be on young adults' financial stability and overall economic inequality? Extremely impactful/Moderately impactful/Slightly impactful/Not impactful/Refused",
  "Do you think that the gender pay gap is a contributing factor to the economic inequality? Contributes a lot/Contributes moderately/Contributes a little/Does not contribute/Refused",
  "In your opinion, to what degree does the digital divide impact economic inequality? Significant degree/Moderate degree/Minor degree/No degree/Refused",
  "Do you believe the outsourcing of jobs overseas contributes to income disparity and loss of local jobs? Contributes a lot/Contributes moderately/Contributes a little/Does not contribute/Refused",
  "How much, if at all, do you think economic inequality affects political polarization? Affects significantly/Affects moderately/Affects slightly/Does not affect/Refused",
  "Do you think investing in renewable energy and green jobs could help address economic inequality? Could help a lot/Could help moderately/Could help a little/Could not help/Refused",
  "Share your perspective on whether increasing the federal minimum wage would be beneficial or detrimental to addressing income inequality in our nation.",
  "Do you believe that the government bailouts to large corporations are fair or unjust with regard to economic equality?",
  "Would you agree that a progressive tax system, where the rich pay a higher percentage of their income in taxes, could contribute to resolving the issue of wealth disparity?",
  "Do you believe that strict regulations on large corporations would be beneficial for improving economic equality?",
  "Do you feel that providing universal healthcare would help level out the economic playing field?",
  "Share your perspective on how access to quality education impacts economic inequality.",
  "Do you think the current housing policies exacerbate or alleviate economic disparity?",
  "What's your take on whether student loan forgiveness would play a role in balancing economic inequality?",
  "Express your viewpoint on whether immigration policies impact economic inequality within our nation.",
  "Do you agree or disagree that access to affordable childcare would have a significant impact on economic inequality?",
  "Share your perspective on the potential role of social security reform in addressing economic inequality.",
  "Do you think extending unemployment benefits during economic downturns is an effective way to mitigate economic disparity?",
  "Would establishing a universal basic income benefit or harm the goal of reducing economic inequality?",
  "Do you believe that protectionist trade policies protect domestic industries at the expense of the wider economy and economic equality?",
  "Do you think technology and automation have a positive or negative impact on economic inequality?",
  "What's your take on investing in public infrastructure projects as a way of promoting economic equality?",
  "Do you agree that stronger labor unions would have a positive impact on reducing the wage gap and improving economic equality?",
  "How much influence, if any, do you believe that maintaining low interest rates has on reducing economic inequality?",
  "Express your viewpoint on the impact of financial literacy education on reducing economic inequality.",
  "What's your take on increasing foreign aid as a way to create more economic equality on a global scale?",
  "What are your thoughts on the idea that economic inequality in our country is primarily due to individual effort or lack thereof? Agree/Disagree/Somewhat agree/Somewhat disagree/Refused",
  "The country's economic policy includes many players and factors. Do you believe market mechanisms or government intervention are best suited to correct economic inequalities? Strongly favour market mechanisms/Moderately favour market mechanisms/Slightly favour market mechanisms/Slightly favour government intervention/moderately favour government intervention/Strongly favour government intervention/Refused",
  "Is income redistribution through taxation a fair way of managing economic inequality in society? Agree/Disagree/Neither agree nor disagree/Refused",
  "Given the current wealth distribution in our nation, do you think implementing a universal basic income will alleviate economic inequality? Yes/No/Maybe/Refused",
  "In terms of the economy, do you think corporate taxation rates should be substantially increased, moderately increased, untouched, reduced moderately, or reduced substantially to address economic inequality? Substantially increase/Moderately increase/Leave as is/Moderately reduce/Substantially reduce/Refused",
  "Do you believe that the concentration of wealth among the top 1% of income earners harms the economy? Strongly agree/Moderately agree/Slightly agree/Neither agree nor disagree/Slightly disagree/Moderately disagree/Strongly disagree/Refused",
  "What impact can an increased minimum wage have on reducing income inequality in the country? Significant effect/Moderate effect/Minor effect/No effect/Refused",
  "Is more rigorous regulation of financial institutions an effective strategy to minimize economic inequality? Yes/No/Not Sure/Refused",
  "Will escalating international trade relationships help mitigate economic inequality within the country? Highly likely/Likely/Not very likely/Not at all likely/Refused",
  "Given the present circumstances, how much faith do you have in the government's ability to manage economic inequality? Strong confidence/Moderate confidence/Not much confidence/No confidence at all/Refused",
  "Do you feel that policies designed to promote economic growth benefit all citizens equally, or primarily the wealthy? Primarily all citizens equally/Primarily the wealthy/Somewhere in between/Refused",
  "Does the rise of automation and artificial intelligence in the workforce significantly contribute to income inequality in this nation? Yes/No/Refused",
  "Given the steadily increasing cost of college education, how greatly does this contribute to income disparity? A great deal/Moderately/Not much at all/Not at all/Refused",
  "How much of an effect do you think proper budgeting and financial literacy education could have on reducing income inequality? Significant effect/Moderate effect/Minor effect/No effect/Refused",
  "Does globalization have a considerable impact on wealth disparity within the country? Yes/No/Refused",
  "Will better access to quality and affordable healthcare assist in reducing wealth disparity? Definitively yes/More likely than not/Unsure/More likely not/Definitively no/Refused",
  "Can large-scale affordable housing projects be considered as a solution to bridge wealth disparity? Most certainly could/Most likely could/Maybe/Most likely could not/Most certainly could not/Refused",
  "Do you think it is appropriate for CEOs of large companies to earn substantially more than their employees or should there be a cap on the multiplier? Without any doubt, it's appropriate/Possibly, it's appropriate/Not certain/Unlikely, it's appropriate/Definitely, it's inappropriate/Refused",
  "How significant a role does race and ethnicity play in economic disparities, according to you? Highly significant/Somewhat significant/Not very significant/Insignificant/Refused",
  "How would you assess the influence of labor unions in shaping economic policies? Highly influential/Somewhat influential/Not very influential/Not influential at all/Refused",
  "What's your standpoint on the effect of minimum wage policies on income inequality? Highly affective/Somewhat affective/Not very affective/Not affective at all/Refused",
  "Do you think that current welfare programs are adequate in addressing economic disparity? Highly adequate/ Somewhat adequate/ Not very adequate/ Not adequate at all/ Refused",
  "What impact do you think Wall Street has on the overall economy? Highly impactful/ Somewhat impactful/ Not very impactful/ Not impactful at all/ Refused",
  "In your judgment, how does the housing market affect wealth distribution? Highly affects/ Somewhat affects/ Does not affect much/ Does not affect at all/ Refused",
  "Do you believe the gig economy leads to more economic disparity? Leads greatly/Leads fairly/Does not lead much/Does not lead at all/Refused",
  "In your opinion, are labor market regulations effectively addressing wage gaps? Highly effective/Somewhat effective/Not very effective/Not effective at all/Refused",
  "Do you think trade policies have helped or hindered the economic mobility of the middle class? Helped a lot/Helped a little/Hindered a little/Hindered a lot/Neither helped nor hindered/Refused",
  "How impactful, if at all, do you think that increasing minimum wage could be in addressing economic disparity? Extremely impactful/Quite impactful/A little impactful/Not impactful at all/Refused",
  "To what degree do you think establishing universal healthcare could contribute to reducing economic inequality in the country? Major contribution/Some contribution/Minor contribution/No contribution/Refused",
  "How often do you feel that labor unions can play a role in diminishing the wealth gap? Always/Often/Sometimes/Rarely/Never/Refused",
  "In your view, what role does technology play in increasing the wealth gap? Significant role/Some role/A little role/No role/Refused",
  "Do you think that education spending is an effective method of narrowing economic inequality? Very effective/Somewhat effective/Not very effective/Not effective at all/Refused",
  "What value do you attribute to small business development in tackling economic disparity? High value/Moderate value/Low value/No value/Refused",
  "How relevant do you believe overseas outsourcing is to the issue of wealth disparity? Very relevant/Quite relevant/Not very relevant/Not at all relevant/Refused",
  "What impact, if any, do you see capital gains tax rates having on income inequality in the country? Major impact/Some impact/Minimal impact/No impact/Refused",
  "Would you regard employment anti-discrimination laws as important measures to curb economic inequality? Tremendously important/Fairly important/Slightly important/Not important/Refused",
  "What role do you think securing social security plays in addressing wealth inequality? Big role/Medium role/Small role/No role/Refused",
  "To what degree would you say access to affordable higher education contributes to alleviating economic inequality? High degree/Moderate degree/Low degree/No degree/Refused",
  "To what extent do you believe that providing equal pay can help to lessen the wealth gap? Great extent/Fair extent/Some extent/No extent/Refused",
  "How significant, if at all, do you consider inheritance tax rates to be in the matter of wealth disparity? Highly significant/Somewhat significant/Not very significant/Not significant/Refused",
  "Do you think that paid family leave policies can have an impact on reducing economic inequality? Major impact/Minor impact/Small impact/No impact/Refused",
  "In your opinion, do child care policies hold any relevance toward economic inequality? Significant relevance/Moderate relevance/Little relevance/No relevance/Refused",
  "Opinions often differ regarding taxes. To what extent do you see the rich paying more taxes as a beneficial measure to equalize wealth distribution? Very beneficial/Fairly beneficial/Not very beneficial/Not beneficial at all/Refused",
  "Considering various proposals, how much impact would you say government-funded healthcare has on reducing economic disparity? A significant amount/A fair amount/Not much/No impact at all/Refused",
  "How influential do you believe labor unions are in rallying for the rights of workers and reducing wage disparities in today's economy? Extremely influential/Somewhat influential/Not very influential/Not influential at all/Refused",
  "What role do you think the introduction of Universal Basic Income (UBI) could play in mitigating income disparity in the country? A huge role/Some role/Little role/No role/Refused",
  "Assessing the economic scenario, how impactful do you believe corporate tax hikes would be in addressing wealth inequality? Substantially impactful/Moderately impactful/Minimally impactful/Not impactful/Refused",
  "How necessary do you regard equal pay regulations as a means to reduce gender-based wage gaps in the professional world? Absolutely necessary/Somewhat necessary/Not very necessary/Not necessary at all/Refused",
  "Looking at the education sector, how significant a role does quality and affordability of education play in achieving economic equality? Extremely significant/Somewhat significant/Only slightly significant/Not significant/Refused",
  "How much would you support subsidized housing as a way to address economic stratification? Fully support/Somewhat support/Do not support much/Do not support at all/Refused",
  "Evaluate the role that strict regulation of banks and Wall Street might play in achieving economic justice? Significant role/Moderate role/Minimal role/No role/Refused",
  "Given the social disparities in the country, how important do you think is it to invest in green jobs to handle economic inequality? Extremely important/Quite important/Slightly important/Not important at all/Refused",
  "How much, if at all, can the implementation of a progressive tax system contribute to reducing wealth inequality? Tremendously contribute/Somewhat contribute/Barely contribute/Not contribute at all/Refused",
  "How much impact do you think the reduction of defense spending could have in addressing domestic economic inequality? A pronounced impact/A reasonable impact/A slight impact/No impact/Refused",
  "How much effect do you believe an increase in social security benefits would have on curtailing economic disparities among seniors? High effect/Moderate effect/Low effect/No effect/Refused",
  "In your opinion, what significance does affordable childcare hold in providing economic stability and reducing inequality? High significance/Moderate significance/Low significance/No significance/Refused",
  "How beneficial do you think increased spending on public transportation would be in combating economic inequality? Very beneficial/Beneficial/Not very beneficial/Not beneficial at all/Refused",
  "Contemplating the minimum wage issue, how vital do you see its increase for creating economic fairness in society? Extremely vital/Considerably vital/Not very vital/Not vital at all/Refused",
  "Taking into account the digital divide, how much would bridging the technology gap aid in reducing economic inequality? Greatly aid/Moderately aid/Slightly aid/Not aid at all/Refused",
  "Assessing economic factors, how consequential is a strong public school system in combating economic inequality? Highly consequential/Quite consequential/Not very consequential/Not consequential at all/Refused",
  "Considering the unequal distribution of wealth in our society, do you envision more monitoring of the top 1% financial elite? Tighter regulations/Looser regulations/No changes needed/Refused",
  "Looking into future financial trends, do you foresee a widening or narrowing of the wealth gap in the U.S.? Widening wealth gap/Narrowing wealth gap/No change/Refused",
  "Articulate your thoughts on implementing a universal basic income (UBI) as a solution to income inequality. Favor UBI/Oppose UBI/Undecided/Refused",
  "Express your views on the impact of technology and automation on economic disparity. Increase disparity/Decrease disparity/No effect/Refused",
  "Envision your views on progressive taxation as a means to address wealth inequality. In favor/Opposed/Neutral/Refused",
  "Express your thoughts on the impact of minimum wage regulations on the country's economy. Positive impact/Negative impact/No impact/Refused",
  "How do you perceive the economic influence of Wall Street on Main Street? Predominantly positive influence/Predominantly negative influence/Neutral influence/Refused",
  "Reflect on the potential of clean energy industries to revitalize the economy and reduce economic disparities. High potential/Moderate potential/Low potential/Refused",
  "How considerable do you think the impact of pharmaceutical companies' pricing policies is on economic inequality? Extremely considerable/Moderately considerable/Not considerable/Refused",
  "Do you think tax rates on the wealthy should be increased to mitigate economic inequality? Strongly agree/Agree/Neutral/Disagree/Strongly disagree/Refused",
  "How influential is technology in shaping the current state of our economy and inequality? Extremely influential/Very influential/Moderately influential/Slightly influential/Not at all influential/Refused",
  "In your opinion, how much is racial discrimination a contributing factor to economic inequality? A great deal/A lot/A moderate amount/A little/None at all/Refused",
  "To what extent do you think that raising the minimum wage could reduce economic inequality? Completely/Quite a lot/A moderate amount/Only a little/Not at all/Refused",
  "What impact, if any, do you believe automation and AI will have on economic inequality in the next decade? Significant impact/Moderate impact/Small impact/No impact/Refused",
  "In your view, do you think that free trade agreements have more positively or negatively impacted income inequality in your country? Predominantly positive /Partially positive /Neutral /Partially negative /Predominantly negative /Refused",
  "Do you believe that workers' unions have a role to play in diminishing income inequality? Absolutely/Very much/Somewhat/Not really/Not at all/Refused",
  "To what degree do you perceive immigration to contribute to economic inequality? A great deal /A fair amount /A small amount /Nothing at all /Refused",
  "What effect, if any, do you think an improved public transportation system would have on reducing economic inequality? A strong effect /A moderate effect /A mild effect /No effect /Refused",
  "In your opinion, what influence does the financial sector have on economic inequality? Tremendous influence /Considerable influence /Moderate influence /Little influence /No Influence /Refused",
  "Do you think empowering women economically could result in a significant reduction of income inequality? Strongly agree/Agree/Neutral/Disagree / Strongly disagree / Refused",
  "How critical do you think investing in the nation's infrastructure could be in decreasing economic inequality? Extremely vital /Quite vital /Moderately vital /Slightly vital /Not vital at all /Refused",
  "What are your thoughts on equal pay for equal work in terms of gender and race? Would it considerably reduce economic disparities? Yes, it would significantly reduce disparities/Yes, but it would only somewhat reduce disparities/No, it would not have a significant impact/Refused",
  "What are the possible implications of raising the minimum wage in the U.S., and how much would it impact economic inequality? Significant positive impact/Moderate positive impact/No impact/Negative impact/Refused",
  "Do you consider the wealth gap between the rich and the middle class as a significant concern that affects economic stability? A significant concern/A moderate concern/A minor concern/No concern at all/Refused",
  "In your perspective, can investing in public education substantially reduce economic disparity over time? Yes, significantly/Yes, moderately/No, it won't have much impact/No, it won't have any impact/Refused",
  "Do you hold the view that calling on the extremely wealthy to pay more in taxes will lessen economic inequality? Yes, greatly/Yes, moderately/No, it would not make much difference/No, it would not make any difference/Refused",
  "How do you judge the effect of gentrification on local economies and on the economic divide? Deepens the divide/Somewhat deepens the divide/No significant effect/Economically beneficial/Refused",
  "Do you believe expanding opportunities for affordable housing could serve to decrease economic disparities? Yes, it would significantly decrease disparities/Yes, but it would only somewhat decrease disparities/No, it would not have a significant impact/Refused",
  "Would the implementation of Universal Basic Income (UBI) significantly help to bridge the economic inequality gap in today's society? Would greatly help/Would help to some extent/Would not make much difference/Would not make a difference at all/Refused",
  "In terms of economic inequality, would enforcing tougher regulations and scrutiny on Wall Street firms make a positive difference? Yes, a great deal/Yes, a fair amount/No significant impact/No impact at all/Refused",
  "Do you believe that corporate monopolies contribute to increasing economic disparity? Contribute significantly/Contribute moderately/Do not contribute much/Do not contribute at all/Refused",
  "In your view, can better access to online education and skill enhancement platforms bridge the economic divide? Can bridge significantly/Can bridge moderately/Cannot bridge much/Cannot bridge at all/Refused",
  "Does the current social security system in the U.S. contribute to or help reduce economic inequality? Contributes significantly/Contributes moderately/Helps reduce slightly/Helps reduce significantly/Refused",
  "How impactful do you think the gender wage gap is on economic inequality? Contributes significantly/Contributes moderately/Does not contribute much/Does not contribute at all/Refused",
  "Do you think the country's current economic conditions are aiding or impeding economically disadvantaged communities? Helping considerably/Helping a little/Hurting slightly/Hurting considerably/Neither helping nor hurting/Refused",
  "Is supporting small businesses and start-ups a powerful tool against economic disparity? Has a significant impact/Has a moderate impact/Has no significant impact/Has no impact at all/Refused",
  "Describe your opinion on how much industrial automation contributes to the unemployment and economic disparity in the country? A great deal/A fair amount/Not too much/Not at all/Refused",
  "What is your opinion about the government providing universal basic income to reduce the economic gap? Strongly agree/Agree/Neutral/Disagree/Strongly disagree/Refused",
  "Do you believe in revising the tax laws to make corporations and high-income individuals pay more could promote economic equality? Definitely agree/Agree/Neutral/Disagree/Definitely disagree/Refused",
  "In your view, does increasing funding for job training programs significantly reduce unemployment and economic disparity? A lot/A moderate amount/A little/Not at all/Refused",
  "How effective would implementing higher inheritance taxes be in reducing wealth inequality in the U.S.? Highly effective/Moderately effective/Ineffective/Highly Ineffective/Refused",
  "Do you consider eliminating student loan debt to be a significant step towards economic fairness? Yes, completely/Yes, to some extent/No, not really/No, not at all/Refused",
  "Should everyone in the country be provided with free health care to attain economic equality? Strongly agree/Agree/Neutral/Disagree/Strongly disagree/Refused",
  "What's your stance on corporate earnings being redistributed more evenly among employees to reduce income inequality? Highly favorable/Favorable/Neutral/Unfavorable/Strongly unfavorable/Refused",
  "Do you feel implementing a wealth tax on the richest individuals could make a considerable difference in leveling economic disparity? Definitely yes/Probably yes/Neutral/Probably no/Definitely no/Refused",
  "Do you suppose inequality could significantly be reduced by expanding social security benefits? Definitely yes/Probably yes/Maybe/Probably no/Definitely no/Refused",
  "Do you believe that financial literacy education can play a significant role in combating economic inequality? Absolutely/To a certain extent/Neutral/Don't believe so/Not at all/Refused",
  "How likely do you think expanding access to quality education can reduce economic inequality in the country? Very likely/Likely/Neutral/Unlikely/Very unlikely/Refused",
  "Can legalizing and taxing marijuana significantly contribute to the economy and reduce public expense on law enforcement? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "What impact would you say creating more affordable housing has on the economic equality in the country? Major positive/Minor positive/No impact/Minor negative/Major negative/Refused",
  "Regarding the current economic scenario, would you say Minority-owned businesses are Thriving/Struggling/Maintaining a balance?",
  "How critically do you believe minimum wage increases would impact small businesses? Impact a great deal/Impact a fair amount/Impact negligibly/No impact/Refused",
  "Do you feel deregulation practices would aid or hamper the growth of the economy? Aid significantly/Aid slightly/Hamper slightly/Hamper significantly/Neither aid nor hamper/Refused",
  "How much do you think the tech industry is influencing the economic divide? Influencing considerably/Influencing moderately/Influencing negligibly/Not influencing/Refused",
  "In your perspective, should the government intervene more or less in the free market to address economic inequality? Intervene more/Intervene less/Stay the same/Refused",
  "What's your take on universal basic income as a solution for poverty and inequality? Fully support/Support with reservations/Oppose with reservations/Fully oppose/Refused",
  "Do you believe expanding trade agreements with other nations would benefit or harm our country's economy? Benefit significantly/Benefit moderately/Harm moderately/Harm significantly/Neither benefit nor harm/Refused",
  "How effectively do you think wealth redistribution policies are working to level economic disparities? Effectively/Ineffectively/Neutral/Moderately effectively/Refused",
  "Propose a strategy to induce economic growth without increasing the wealth divide, and explain your reasoning behind it.",
  "Do you believe that offshoring jobs have a considerable influence on our economy's health? Considerable influence/Moderate influence/Minimal influence/No influence/Refused",
  "What's your perspective on the argument that high corporate taxes result in reduced economic growth? Agree strongly/Agree somewhat/Disagree somewhat/Disagree strongly/Refused",
  "If it were up to you, would you prefer the implementation of wealth taxes or corporate taxes to address inequality? Wealth taxes/Corporate taxes/Both/Neither/Refused",
  "Do you see the rising cost of higher education as a fundamental issue contributing to economic inequality? Greatly contributing/Moderately contributing/Slightly contributing/Not contributing/ Refused",
  "What is your take on the proposal that reducing military spending would allow more budgetary allocation towards social services? Strongly agree/Agree/Neutral/Disagree/Strongly disagree/Refused",
  "In your viewpoint, are the recent tax reforms aiding the rich, the poor, or the middle class? Aiding the rich / Aiding the poor / Aiding the middle class / Not aiding any / Refused",
  "Do you believe the government should implement more protectionist policies to foster domestic industries and jobs? Yes/No/Depends on the policy/Refused",
  "Regarding fiscal policy, which should be the government's priority: Reducing the budget deficit or Stimulating economic growth/ Both/ Refused",
  "In your view, do you think the increasing wealth gap is having a negative or positive effect on the country? A lot negative/A little negative/Neither negative nor positive/A little positive/A lot positive/Refused",
  "Reflect on whether current economic policies are leading us towards an equal or unequal society? Moving towards equality/Moving towards inequality/Stay the same/Refused",
  "Should taxes on the wealthy be increased to address economic disparity, or should the emphasis be on fostering business growth? Increase taxes/Foster business growth/Both/Neither/Refused",
  "How do you evaluate the effect of minimum wage laws on the economy and the poverty level? Greatly positive/Fairly positive/Neither positive nor negative/Fairly Negative/Greatly Negative/Refused",
  "Consider whether the country is doing enough to address income inequality or not? Doing enough/Should do more/Don't need to do anything/Refused",
  "How much is your outlook on the state of the economy shaped by the rising costs of college education? A great deal/A fair amount/Not too much/Not at all/Refused",
  "Do you sense that the federal budget spending is addressing the needs of the less affluent citizens adequately? Yes, adequately/Yes, but not enough/No, not adequately at all/Refused",
  "In your judgement, is globalization more likely to increase or decrease income inequality? Increase/Decrease/Remain the same/Refused",
  "How does the current unemployment rate influence your views on our economic climate? Greatly influences/Fairly influences/Slightly influences/Doesn’t influence/Refused",
  "Should big corporations be held responsible for mitigating economic inequality, or is it the government's role? Corporations' responsibility/Government's responsibility/Both/Neither/Refused",
  "Ponder on the effects of privatisation of public sector industries on wealth inequality. A great deal/A fair amount/Not too much/Not at all/Refused",
  "Evaluate how important the implementation of a Universal Basic Income could be to improve economic conditions? Crucially important/Important/Not so important/Not important at all/Refused",
  "Do you think investment in green energy and technology can play a role in reducing economic inequality? Can help a lot/Can help a little/No effect/Can make worse/Refused",
  "Is gentrification exacerbating or alleviating city-wide income disparity? Exacerbating/Alleviating/No notable effect/Refused",
  "How much do you consider our welfare system effective in mitigating poverty and disparity? Very effective/Reasonably effective/Somewhat ineffective/Very ineffective/Refused",
  "If the government further deregulates the financial sector, will it increase or decrease economic disparity? Increase/Decrease/No change/Refused",
  "Discuss your perspective on how income inequality impacts the social fabric of the nation. Is it a significant problem or are there larger issues to deal with?",
  "How would you assess the effectiveness of the US welfare system in combating economic inequality? Could it be significantly improved, modestly adjusted, or is it optimum as currently established?",
  "Does the American Dream still hold true today? Or is it becoming increasingly difficult for people to move up the economic ladder?",
  "Describe the role of corporate greed in intensifying economic disparity. Is it largely, somewhat, minimally responsible, or is it not a factor at all?",
  "Evaluate the necessity of introducing a universal basic income (UBI) in the United States in light of rising economic inequality. Is it a needed solution, a possible remedy, not required, or counterproductive?",
  "In your view, how much is the existing tax structure in the U.S. contributing to the economic inequality? Is it a major contributor, a minor one, not relevant, or does it help alleviate inequality?",
  "Can large-scale charity by the wealthy, as seen in philanthropic causes, significantly reduce economic inequality or is systemic reform in governmental policy more effective?",
  "Discuss the role of education in addressing economic disparity. Does it hold the key solution, is it a part of the solution, or is it an overrated factor in this regard?",
  "What impact does economic globalization have on domestic economic inequality?",
  "Is there a correlation between increasing automation and rising economic inequality in the US? Does it contribute substantially, slightly, not at all or does it help decrease inequality?",
  "Does providing healthcare for all citizens serve to decrease economic inequality or does it place an unnecessary burden on the economy?",
  "Do you believe that uncontrolled capitalism feeds income inequality or does it allow for entrepreneurial growth and wealth creation?",
  "Should minimum wage in the United States be significantly increased, moderately increased, stay the same, or be removed to address economic inequality?",
  "Over the next decade, do you forecast that the wealth disparity in US is going to widen considerably, widen slightly, remain the same, narrow down slightly, or narrow down significantly?",
  "Does gentrification contribute to economic inequality or does it generally improve local economies and standard of living?",
  "How do you assess the role of unions in combating economic inequality? Are they highly effective, somewhat effective, not very effective, or counterproductive?",
  "How much can restructuring student loans and making college affordable contribute to alleviating the issue of economic inequality? Would it have a major effect, some effect, little effect, or no effect at all?",
  "Is it feasible to reduce economic disparity while maintaining an economically competitive country on the global stage?",
  "What is your opinion on the effect of inflation on income disparity? Does it increase disparity significantly, slightly, doesn't impact, or helps reduce it?",
  "How much effect does the gig economy have on economic disparity in the country? Does it increase disparity greatly, slightly, has no impact, or does it help reduce the disparity?",
  "Considering the current state of our national debt, how would you describe its impact on our country's economic stability? Significantly detrimental/Moderately detrimental/Neither harmful nor beneficial/Moderately beneficial/Significantly beneficial/Refused",
  "In terms of job creation, do you believe that small businesses or large corporations have a more significant impact? Small businesses/Both equally/Large corporations/Neither/Refused",
  "Should the federal government take responsibility for implementing policies that reduce income inequality? A lot of responsibility/A fair amount of responsibility/Not too much responsibility/No responsibility at all/Refused",
  "Do you think the federal minimum wage is sufficient in today's economy? Far too low/Slightly too low/Just right/Slightly too high/Far too high/Refused",
  "In your opinion, how justifiable is it for CEOs to make significantly more than their employees? Completely justifiable/Moderately justifiable/Slightly justifiable/Not justifiable at all/Refused",
  "Do you think workers' unions play an important role in combatting economic disparity? Play an important role/Play a somewhat important role/Play a slightly important role/Do not play an important role/Refused",
  "What are your views on immigration's effect on our economy? Very positive/Slightly positive/Neither positive nor negative/Slightly negative/Very negative/Refused",
  "Are the country's current trade policies favoring the rich, the poor, or neither? Favoring the rich/Equally favoring both/Favoring the poor/Favoring neither/Refused",
  "Should the healthcare industry be more regulated to reduce economic inequality? More regulated/Slightly more regulated/No change/Slightly less regulated/Less regulated/Refused",
  "What are your thoughts on how retirement pensions affect the economic stability of the middle class? Stabilizes a lot/Stabilizes a little/Neither stabilizes nor destabilizes/Destabilizes a little/Destabilizes a lot/Refused",
  "How much responsibility do multinational corporations hold for the economic inequality globally? A great deal of responsibility/A fair amount of responsibility/A little responsibility/No responsibility at all/Refused",
  "Do you believe that current corporate tax rates are excessive, unfairly low, or just right, considering the state of the economy? Excessive/Unfairly low/Just right/Refused",
  "Do you believe that income inequality in America is a result of individuals' work ethic or systemic issues? Work ethic/Systemic Issues/Both/Refused",
  "In your opinion, is the American Dream— the idea that anyone, regardless of where they were born or what class they were born into, can attain their own version of success in a society where upward mobility is possible for everyone— still achievable? Still achievable/Not achievable/Depends/Refused",
  "Considering the escalating costs of higher education and the burden of student loans, do you think community colleges should be made free for everyone? Yes/No/Depends/Refused",
  "Do you believe raising the minimum wage could mitigate income inequality, or would it lead to job losses? Mitigate inequality/Lead to job losses/Both/Refused",
  "Do you believe that wealthier individuals should bear a higher tax burden to support social services and redistribute wealth? Yes/No/Depends/Refused",
  "Do you think investments in social safety net programs, such as food assistance and housing subsidies, are beneficial or detrimental to the economy? Beneficial/Detrimental/Neutral/Refused",
  "Considering the increasing automation in various industries, do you think it will help in narrowing the economic gap or widen it? Narrow the gap/Widen the gap/No effect/Refused",
  "Do you think that government provision of universal basic income (UBI) could be a solution for reducing economic inequality? Yes/No/Depends/Refused",
  "Do you believe that providing more career training programs in fields such as technology and manufacturing could reduce income inequality? Yes/No/Depends/Refused",
  "Is building wealth through stock market investments restricted to the wealthy, or is it accessible to people across all economic backgrounds? Restricted to wealthy/Accessible to all/Depends/Refused",
  "Do you think the recent surge in tech companies and their high paying jobs could be increasing economic inequality? Yes/No/Depends/Refused",
  "Do you think outsourcing jobs to other countries leads to increased economic inequality in the U.S.? Yes/No/Depends/Refused",
  "Do you think gentrification contributes to economic inequality by pushing poorer residents out of their neighborhoods? Yes/No/Depends/Refused",
  "In light of the economic impact of the COVID-19 pandemic, do you believe we should place higher taxes on the wealthy to aid economic recovery for everyone? Yes/No/Depends/Refused",
  "Do you think a progressive tax system, where those with higher incomes contribute a larger proportion of their income in tax, can address income inequality? Yes/No/Depends/Refused",
  "Do you believe that enhancing public education, particularly in low-income neighborhoods, could provide a solution to economic inequality? Yes/No/Depends/Refused",
  "Do you believe the cost of healthcare adds to economic inequality considering its financial burden on the lower-income population? Yes/No/Depends/Refused",
  "Does the affordability and accessibility of quality childcare impact economic inequality in your view? Yes/No/Depends/Refused"
]