[
  "When it comes to raising boys, would you say there is too much emphasis or too little emphasis on encouraging boys to stand up for themselves these days, or is it about right? Too much emphasis/Too little emphasis/About right/Refused",
  "When it comes to raising boys, would you say there is too much emphasis or too little emphasis on encouraging boys to be leaders these days, or is it about right? Too much emphasis/Too little emphasis/About right/Refused",
  "How well, if at all, do the following words or phrases describe you? Consider myself a feminist Describes me well/Does not describe me well/Refused",
  "How well, if at all, do the following words or phrases describe you? Supporter of rights for lesbian, gay, bisexual and transgender LGBT people Describes me well/Does not describe me well/Refused",
  "When it comes to raising boys, would you say there is too much emphasis or too little emphasis on encouraging boys to talk about their feelings when they are sad or upset these days, or is it about right? Too much emphasis/Too little emphasis/About right/Refused",
  "Overall, how much has being a man/Being a woman/Your gender helped or hurt your ability to get ahead? Helped a lot/Helped a little/Hurt a little/Hurt a lot/Neither helped nor hurt/Refused",
  "Do you think gender should be a major factor, minor factor, or not a factor in college admissions? Major factor/Minor factor/Not a factor/Refused",
  "Overall, how does being a man affect people's ability to get ahead in our country these days? Helps a lot/Helps a little/Hurts a little/Hurts a lot/Neither helps nor hurts/Refused",
  "Overall, how does being a woman affect people's ability to get ahead in our country these days? Helps a lot/Helps a little/Hurts a little/Hurts a lot/Neither helps nor hurts/Refused",
  "Which statement comes closer to your views, even if neither is exactly right? Whether someone is a man or a woman is determined by the sex they were assigned at birth/Someone can be a man or a woman even if that is different from the sex they were assigned at birth/Refused",
  "Thinking about your work life, has more women in the workforce done more to help or hurt your job or career, or hasn't it made much of a difference for your job or career? Has done more to help my job or career/Has done more to hurt my job or career/Hasn't made much of a difference/Refused",
  "Thinking about your spouse or partner is your spouse or partner of the opposite sex as you or the same sex as you? Opposite sex/Same sex/Refused",
  "When it comes to raising girls, would you say there is too much emphasis or too little emphasis on encouraging girls to do well in school these days, or is it about right? Too much emphasis/Too little emphasis/About right/Refused",
  "Do you think it's a good thing or a bad thing that most people in our society look up to men who are manly or masculine? Good thing/Bad thing/Refused",
  "Thinking about how society sees men these days, in general, would you say Most people look up to men who are manly or masculine/Most people look down on men who are manly or masculine/Neither/Refused",
  "When it comes to raising girls, would you say there is too much emphasis or too little emphasis on encouraging girls to be leaders these days, or is it about right? Too much emphasis/Too little emphasis/About right/Refused",
  "When it comes to raising girls, would you say there is too much emphasis or too little emphasis on encouraging girls to stand up for themselves these days, or is it about right? Too much emphasis/Too little emphasis/About right/Refused",
  "When it comes to raising boys, would you say there is too much emphasis or too little emphasis on encouraging boys to do well in school these days, or is it about right? Too much emphasis/Too little emphasis/About right/Refused",
  "When it comes to raising girls, would you say there is too much emphasis or too little emphasis on encouraging girls to talk about their feelings when they are sad or upset these days, or is it about right? Too much emphasis/Too little emphasis/About right/Refused",
  "Which of the following statements comes closer to your feelings? Our society has gone too far in accepting people who are transgender/Our society has not gone far enough in accepting people who are transgender/Our society has been about right when it comes to accepting people who are transgender/Refused",
  "Thinking about the people you know, including yourself, do you personally know anyone who is transgender, or not? Yes/No/Refused",
  "In general, how much pressure, if any, do you think men face in our country these days to be willing to throw a punch if provoked? A lot/Some/Not too much/None at all/Refused",
  "In general, how much pressure, if any, do you think men face in our country these days to be emotionally strong? A lot/Some/Not too much/None at all/Refused",
  "In general, how much pressure, if any, do you think men face in our country these days to have many sexual partners? A lot/Some/Not too much/None at all/Refused",
  "In general, how much pressure, if any, do you think men face in our country these days to join in when other men are talking about women in a sexual way? A lot/Some/Not too much/None at all/Refused",
  "Do you think it's a good thing or a bad thing that most people in our society look up to women who are womanly or feminine? Good thing/Bad thing/Refused",
  "On a different topic how important is it to you, personally, to be seen by others as manly or masculine? Very important/Somewhat important/Not too important/Not at all important/Refused",
  "In general, how much pressure, if any, do you think men face in our country these days to be interested in sports? A lot/Some/Not too much/None at all/Refused",
  "Do you think it's a good thing or a bad thing that most people in our society look down on women who are womanly or feminine? Good thing/Bad thing/Refused",
  "Do you think men and women are basically similar or basically different when it comes to their physical abilities? Men and women are basically similar/Men and women are basically different/Refused",
  "Do you think men and women are basically similar or basically different when it comes to their hobbies and personal interests? Men and women are basically similar/Men and women are basically different/Refused",
  "Do you think men and women are basically similar or basically different when it comes to their approach to parenting? Men and women are basically similar/Men and women are basically different/Refused",
  "Do you think men and women are basically similar or basically different when it comes to how they express their feelings? Men and women are basically similar/Men and women are basically different/Refused",
  "Do you think men and women are basically similar or basically different when it comes to the things they are good at in the workplace? Men and women are basically similar/Men and women are basically different/Refused",
  "Thinking about how society sees women these days, in general, would you say Most people look up to women who are womanly or feminine/Most people look down on women who are womanly or feminine/Neither/Refused",
  "For each one of the following, please indicate whether you think it is a reason why there aren't more women in top executive business positions. Women aren't encouraged to pursue leadership positions from an early age Major reason/Minor reason/Not a reason/Refused",
  "For each one of the following, please indicate whether you think it is a reason why there aren't more women in top executive business positions. Family responsibilities make it harder for women to move up in business Major reason/Minor reason/Not a reason/Refused",
  "For each one of the following, please indicate whether you think it is a reason why there aren't more women in top executive business positions. Women have to more to prove themselves than men Major reason/Minor reason/Not a reason/Refused",
  "For each one of the following, please indicate whether you think it is a reason why there aren't more women in top executive business positions. Not as many women are interested in top executive business positions Major reason/Minor reason/Not a reason/Refused",
  "For each one of the following, please indicate whether you think it is a reason why there aren't more women in top executive business positions. Women aren't tough enough for business Major reason/Minor reason/Not a reason/Refused",
  "For each one of the following, please indicate whether you think it is a reason why there aren't more women in top executive business positions. Women don't make as good managers as men Major reason/Minor reason/Not a reason/Refused",
  "For each one of the following, please indicate whether you think it is a reason why there aren't more women in top executive business positions. Women in business face gender discrimination Major reason/Minor reason/Not a reason/Refused",
  "For each one of the following, please indicate whether you think it is a reason why there aren't more women in top executive business positions. Women are held to higher standards than men Major reason/Minor reason/Not a reason/Refused",
  "And thinking about some specific policy areas, in general, do you think men or women in high political offices are better at handling economic conditions? Men are better/Women are better/No difference/Refused",
  "Please indicate whether you think the following is is a reason why there are fewer women than men in high political offices. Women in politics face gender discrimination Major reason/Minor reason/Not a reason/Refused",
  "Please indicate whether you think the following is is a reason why there are fewer women than men in high political offices. Women aren't tough enough for politics Major reason/Minor reason/Not a reason/Refused",
  "How much, if anything, do you think having more women in top leadership positions in business and government would do to improve the quality of life for women? A lot/Some/Not much/Nothing at all/Refused",
  "Which of these two statements comes closer to your own view, even if neither is exactly right? As more women move into management roles, it is only a matter of time before there are as many women as men in top execu/Even as more women move into management roles, men will continue to hold more top executive positions in business in the/Refused",
  "Which of these two statements comes closer to your own view, even if neither is exactly right? As more women run for office, it is only a matter of time before there are as many women as men in high political office/Even as more women run for office, men will continue to hold more high political offices in the future/Refused",
  "How much, if anything, do you think having more women in top leadership positions in business and government would do to improve the quality of life for all Americans? A lot/Some/Not much/Nothing at all/Refused",
  "How much, if anything, do you think having more women in top leadership positions in business and government would do to improve the quality of life for men? A lot/Some/Not much/Nothing at all/Refused",
  "Thinking about top executive positions in business these days, would you say it is generally Easier for men to get these positions/Easier for women to get these positions/Not much difference/Refused",
  "Thinking about high political offices these days, would you say it is generally Easier for men to get elected to high political offices/Easier for women to get elected to high political offices/Not much difference/Refused",
  "What do you think would be the ideal situation when it comes to the number of women in top executive business positions? Having more women than there are now but still not as many women as men/Having about an equal number of women and men/Having more women than men/Refused",
  "And thinking about some specific policy areas, in general, do you think men or women in high political offices are better at dealing with national security and defense? Men are better/Women are better/No difference/Refused",
  "Please indicate whether you think the following is is a reason why there are fewer women than men in high political offices. Many Americans aren't ready to elect a woman to higher office Major reason/Minor reason/Not a reason/Refused",
  "And thinking about some specific policy areas, in general, do you think men or women in high political offices are better at dealing with the federal budget deficit? Men are better/Women are better/No difference/Refused",
  "For each one of the following, please indicate whether you think it is a reason why there aren't more women in top executive business positions. Women don't have access to the same kinds of personal networks and connections that men have Major reason/Minor reason/Not a reason/Refused",
  "For each one of the following, please indicate whether you think it is a reason why there aren't more women in top executive business positions. Women are less likely than men to ask for promotions and raises Major reason/Minor reason/Not a reason/Refused",
  "For each one of the following, please indicate whether you think it is a reason why there aren't more women in top executive business positions. Many businesses are not ready to hire women for top executive positions Major reason/Minor reason/Not a reason/Refused",
  "Please indicate whether you think the following is is a reason why there are fewer women than men in high political offices. Women get less support from party leaders Major reason/Minor reason/Not a reason/Refused",
  "In general, do you think men or women in high political offices are better at maintaining a tone of civility and respect in politics? Men are better/Women are better/No difference/Refused",
  "In general, do you think men or women in high political offices are better at serving as a role model for children? Men are better/Women are better/No difference/Refused",
  "In general, do you think men or women in high political offices are better at being persuasive? Men are better/Women are better/No difference/Refused",
  "Please indicate whether you think the following is is a reason why there are fewer women than men in high political offices. Fewer women have the experience required for higher office Major reason/Minor reason/Not a reason/Refused",
  "Please indicate whether you think the following is is a reason why there are fewer women than men in high political offices. Women don't do as good of a job selling their accomplishments Major reason/Minor reason/Not a reason/Refused",
  "Please indicate whether you think the following is is a reason why there are fewer women than men in high political offices. Sexual harassment creates an environment that makes it harder for women to succeed in politics Major reason/Minor reason/Not a reason/Refused",
  "Please indicate whether you think the following is is a reason why there are fewer women than men in high political offices. Women aren't encouraged to pursue leadership positions from an early age Major reason/Minor reason/Not a reason/Refused",
  "Please indicate whether you think the following is is a reason why there are fewer women than men in high political offices. Women who run for office have to more to prove themselves than men Major reason/Minor reason/Not a reason/Refused",
  "For each one of the following, please indicate whether you think it is a reason why there aren't more women in top executive business positions. Women don't do as good of a job selling their accomplishments Major reason/Minor reason/Not a reason/Refused",
  "Please indicate whether you think the following is is a reason why there are fewer women than men in high political offices. Women who run for office are held to higher standards than men Major reason/Minor reason/Not a reason/Refused",
  "Please indicate whether you think the following is is a reason why there are fewer women than men in high political offices. Not as many women are interested in holding higher office Major reason/Minor reason/Not a reason/Refused",
  "For each one of the following, please indicate whether you think it is a reason why there aren't more women in top executive business positions. Women have fewer opportunities to interact with people in senior positions outside of work Major reason/Minor reason/Not a reason/Refused",
  "For each one of the following, please indicate whether you think it is a reason why there aren't more women in top executive business positions. Sexual harassment creates an environment that makes it harder for women to succeed in business Major reason/Minor reason/Not a reason/Refused",
  "In general, do you think men or women in high political offices are better at being willing to take risks? Men are better/Women are better/No difference/Refused",
  "In general, do you think men or women in high political offices are better at working well under pressure? Men are better/Women are better/No difference/Refused",
  "In general, do you think men or women in high political offices are better at working out compromises? Men are better/Women are better/No difference/Refused",
  "In general, do you think men or women in high political offices are better at standing up for what they believe in, despite political pressure? Men are better/Women are better/No difference/Refused",
  "In general, do you think men or women in high political offices are better at being honest and ethical? Men are better/Women are better/No difference/Refused",
  "In general, do you think men or women in high political offices are better at being compassionate and empathetic? Men are better/Women are better/No difference/Refused",
  "In the long run, do you think the increased focus on sexual harassment and assault will lead to More opportunities for women in the workplace/Fewer opportunities for women in the workplace/Won't make much of a difference/Refused",
  "Which statement comes closer to your own views? The obstacles that once made it harder for women than men to get ahead are now largely gone/There are still significant obstacles that make it harder for women to get ahead than men/Refused",
  "As you may know, same-sex marriage is now legal in the U.S. Do you think this is a good thing or a bad thing for our society? Very good thing/Somewhat good thing/Somewhat bad thing/Very bad thing/Refused",
  "How likely do you think it is that the following will happen in the next 30 years? A woman will be elected U.S. president Will definitely happen/Will probably happen/Will probably not happen/Will definitely not happen/Refused",
  "In general, how do you think being approachable impacts a woman's chances of getting elected to high political office? Mostly helps a woman's chances/Mostly hurts a woman's chances/Doesn't make much of a difference/Refused",
  "In general, how do you think being assertive impacts a man's chances of getting elected to high political office? Mostly helps a man's chances/Mostly hurts a man's chances/Doesn't make much of a difference/Refused",
  "In general, how do you think being physically attractive impacts a man's chances of getting elected to high political office? Mostly helps a man's chances/Mostly hurts a man's chances/Doesn't make much of a difference/Refused",
  "In general, how do you think being approachable impacts a man's chances of getting elected to high political office? Mostly helps a man's chances/Mostly hurts a man's chances/Doesn't make much of a difference/Refused",
  "And thinking about some specific policy areas, in general, do you think men or women in high political offices are better at dealing with gun policy? Men are better/Women are better/No difference/Refused",
  "If there were more women in the U.S. Congress, do you think The tone of political debate in Washington would be more respectful/The tone of political debate in Washington would be less respectful/The number of women in Congress doesn't have much to with this/Refused",
  "In general, do you think men or women in top executive business positions are better at being willing to take risks? Men are better/Women are better/No difference/Refused",
  "In general, do you think men or women in top executive business positions are better at working well under pressure? Men are better/Women are better/No difference/Refused",
  "In general, do you think men or women in top executive business positions are better at working out compromises? Men are better/Women are better/No difference/Refused",
  "In general, do you think men or women in top executive business positions are better at providing fair pay and good benefits? Men are better/Women are better/No difference/Refused",
  "In general, do you think men or women in top executive business positions are better at valuing people from different backgrounds? Men are better/Women are better/No difference/Refused",
  "In general, do you think men or women in top executive business positions are better at being honest and ethical? Men are better/Women are better/No difference/Refused",
  "In general, do you think men or women in top executive business positions are better at being compassionate and empathetic? Men are better/Women are better/No difference/Refused",
  "In general, how do you think being ambitious impacts a man's chances of getting a top executive business position? Mostly helps a man's chances/Mostly hurts a man's chances/Doesn't make much of a difference/Refused",
  "In general, how do you think being approachable impacts a man's chances of getting a top executive business position? Mostly helps a man's chances/Mostly hurts a man's chances/Doesn't make much of a difference/Refused",
  "If there were more women in the U.S. Congress, do you think there would be more openness and transparency in government/less openness and transparency in government/The number of women in Congress doesn't have much to with this/Refused",
  "In general, how do you think being assertive impacts a man's chances of getting a top executive business position? Mostly helps a man's chances/Mostly hurts a man's chances/Doesn't make much of a difference/Refused",
  "In general, how do you think being compassionate impacts a woman's chances of getting a top executive business position? Mostly helps a woman's chances/Mostly hurts a woman's chances/Doesn't make much of a difference/Refused",
  "In general, how do you think being decisive impacts a woman's chances of getting a top executive business position? Mostly helps a woman's chances/Mostly hurts a woman's chances/Doesn't make much of a difference/Refused",
  "In general, how do you think being approachable impacts a woman's chances of getting a top executive business position? Mostly helps a woman's chances/Mostly hurts a woman's chances/Doesn't make much of a difference/Refused",
  "In general, what do you think is better for a woman who wants to reach high political office? Having children before she enters politics/Waiting until she is well-established in her political career to have children/Not having children at all/Refused",
  "If there were more women in the U.S. Congress, do you think Congress would Do a better job of dealing with the country's problems/Do a worse job of dealing with the country's problems/The number of women in Congress doesn't have much to with this/Refused",
  "As you may know, more women are running for U.S. Congress this year than in the past. Do you think this is A good thing/A bad thing/Neither a good thing nor a bad thing/Refused",
  "Do you think it would be a good thing or a bad thing for the country if a woman was elected president? Very good/Somewhat good/Somewhat bad/Very bad/Refused",
  "In general, how do you think showing emotions impacts a man's chances of getting elected to high political office? Mostly helps a man's chances/Mostly hurts a man's chances/Doesn't make much of a difference/Refused",
  "In general, how do you think being physically attractive impacts a man's chances of getting a top executive business position? Mostly helps a man's chances/Mostly hurts a man's chances/Doesn't make much of a difference/Refused",
  "In general, how do you think showing emotions impacts a man's chances of getting a top executive business position? Mostly helps a man's chances/Mostly hurts a man's chances/Doesn't make much of a difference/Refused",
  "In general, what do you think is better for a woman who wants to reach a top executive position in business? Having children early on in her career/Waiting until she is well-established in her career to have children/Not having children at all/Refused",
  "In general, how do you think being compassionate impacts a man's chances of getting elected to high political office? Mostly helps a man's chances/Mostly hurts a man's chances/Doesn't make much of a difference/Refused",
  "And thinking about some specific policy areas, in general, do you think men or women in high political offices are better at dealing with social issues such as education and health care? Men are better/Women are better/No difference/Refused",
  "In general, do you think men or women in top executive business positions are better at standing up for what they believe in, despite pressure to make a profit? Men are better/Women are better/No difference/Refused",
  "Please indicate whether you think the following is is a reason why there are fewer women than men in high political offices. Family responsibilities make it harder for women to run for higher office Major reason/Minor reason/Not a reason/Refused",
  "In general, how do you think being decisive impacts a man's chances of getting elected to high political office? Mostly helps a man's chances/Mostly hurts a man's chances/Doesn't make much of a difference/Refused",
  "And thinking about some specific policy areas, in general, do you think men or women in high political offices are better at dealing with immigration policy? Men are better/Women are better/No difference/Refused",
  "In general, how do you think being physically attractive impacts a woman's chances of getting elected to high political office? Mostly helps a woman's chances/Mostly hurts a woman's chances/Doesn't make much of a difference/Refused",
  "In general, how do you think being ambitious impacts a man's chances of getting elected to high political office? Mostly helps a man's chances/Mostly hurts a man's chances/Doesn't make much of a difference/Refused",
  "Thinking about the country today, would you say there are Too many women in high political offices/Too few women in high political offices/About the right number of women in high political offices/Refused",
  "What do you think would be the ideal situation when it comes to the number of women in high political office? Having more women than there are now but still not as many women as men/Having about an equal number of women and men/Having more women than men/Refused",
  "Thinking about the ways in which men and women in top positions in business and politics are different in their approach to leadership, would you say Women generally have a better approach/Men generally have a better approach/Neither is better/Refused",
  "Thinking about the country today, would you say there are Too many women in top executive business positions/Too few women in top executive business positions/About the right number of women in top executive business positions/Refused",
  "Next, please think about the leadership styles of people in top positions in business and politics. In general, when it comes to their approach to leadership, do you think that Men and women are basically similar/Men and women are basically different/Refused",
  "In general, do you think men or women would do a better job running a major technology company types of companies? Men would do a better job/Women would do a better job/No difference/Refused",
  "In general, do you think men or women would do a better job running a major retail chain types of companies? Men would do a better job/Women would do a better job/No difference/Refused",
  "In general, do you think men or women in top executive business positions are better at creating a safe and respectful workplace? Men are better/Women are better/No difference/Refused",
  "In general, do you think men or women would do a better job running a large bank or financial institution types of companies? Men would do a better job/Women would do a better job/No difference/Refused",
  "In general, do you think men or women would do a better job running a large oil or gas company types of companies? Men would do a better job/Women would do a better job/No difference/Refused",
  "In general, do you think men or women in top executive business positions are better at considering the impact of business decisions on society? Men are better/Women are better/No difference/Refused",
  "In general, do you think men or women in top executive business positions are better at negotiating profitable deals? Men are better/Women are better/No difference/Refused",
  "In general, do you think men or women in top executive business positions are better at providing guidance or mentorship to young employees? Men are better/Women are better/No difference/Refused",
  "In general, how do you think being ambitious impacts a woman's chances of getting elected to high political office? Mostly helps a woman's chances/Mostly hurts a woman's chances/Doesn't make much of a difference/Refused",
  "In general, how do you think being assertive impacts a woman's chances of getting elected to high political office? Mostly helps a woman's chances/Mostly hurts a woman's chances/Doesn't make much of a difference/Refused",
  "In general, how do you think being compassionate impacts a woman's chances of getting elected to high political office? Mostly helps a woman's chances/Mostly hurts a woman's chances/Doesn't make much of a difference/Refused",
  "In general, how do you think showing emotions impacts a woman's chances of getting elected to high political office? Mostly helps a woman's chances/Mostly hurts a woman's chances/Doesn't make much of a difference/Refused",
  "In general, do you think men or women would do a better job running a major hospital types of companies? Men would do a better job/Women would do a better job/No difference/Refused",
  "In general, do you think men or women would do a better job running a professional sports team types of companies? Men would do a better job/Women would do a better job/No difference/Refused",
  "In general, how do you think being decisive impacts a woman's chances of getting elected to high political office? Mostly helps a woman's chances/Mostly hurts a woman's chances/Doesn't make much of a difference/Refused",
  "In general, how do you think showing emotions impacts a woman's chances of getting a top executive business position? Mostly helps a woman's chances/Mostly hurts a woman's chances/Doesn't make much of a difference/Refused",
  "In general, how do you think being ambitious impacts a woman's chances of getting a top executive business position? Mostly helps a woman's chances/Mostly hurts a woman's chances/Doesn't make much of a difference/Refused",
  "In general, how do you think being physically attractive impacts a woman's chances of getting a top executive business position? Mostly helps a woman's chances/Mostly hurts a woman's chances/Doesn't make much of a difference/Refused",
  "In general, how do you think being assertive impacts a woman's chances of getting a top executive business position? Mostly helps a woman's chances/Mostly hurts a woman's chances/Doesn't make much of a difference/Refused",
  "In general, how do you think being compassionate impacts a man's chances of getting a top executive business position? Mostly helps a man's chances/Mostly hurts a man's chances/Doesn't make much of a difference/Refused",
  "In general, how do you think being decisive impacts a man's chances of getting a top executive business position? Mostly helps a man's chances/Mostly hurts a man's chances/Doesn't make much of a difference/Refused",
  "Is your spouse or partner of the opposite sex as you or the same sex as you? Opposite sex/Same sex/Refused",
  "How much confidence do you have in us President Joe Biden to do the right thing regarding world affairs? A lot of confidence/Some confidence/Not too much confidence/No confidence at all/Refused",
  "What do you think is the ideal situation for men with young children? Working full-time for pay/Working part-time for pay/Not working for pay at all/Refused",
  "Do you think of yourself as Gay or lesbian/Straight, that is, not gay or lesbian/Bisexual/Something else/I don't know the answer/Refused",
  "Do you think same-sex marriages being legal in the U.S. is generally good or bad for our society? Very good for society/Somewhat good for society/Neither good nor bad for society/Somewhat bad for society/Very bad for society/Refused",
  "Please choose the statement that comes closer to your own views. The obstacles that once made it harder for women than men to get ahead are now largely gone/There are still significant obstacles that make it harder for women to get ahead than men/Refused",
  "Do you think greater social acceptance of people who are transgender (people who identify as a gender that is different from the sex they were assigned at birth) is generally good or bad for our society? Very good for society/Somewhat good for society/Neither good nor bad for society/Somewhat bad for society/Very bad for society/Refused",
  "In general, how important, if at all, is having children in order for a man to live a fulfilling life? Essential/Important, but not essential/Not important/Refused",
  "In general, how important, if at all, is being married in order for a man to live a fulfilling life? Essential/Important, but not essential/Not important/Refused",
  "In general, how important, if at all, is being in a committed romantic relationship in order for a man to live a fulfilling life? Essential/Important, but not essential/Not important/Refused",
  "In general, how important, if at all, is having a lot of money in order for a man to live a fulfilling life? Essential/Important, but not essential/Not important/Refused",
  "In general, how important, if at all, is having a job or career they enjoy in order for a man to live a fulfilling life? Essential/Important, but not essential/Not important/Refused",
  "In general, how important, if at all, is being married in order for a woman to live a fulfilling life? Essential/Important, but not essential/Not important/Refused",
  "What do you think is the ideal situation for women with young children? Working full-time for pay/Working part-time for pay/Not working for pay at all/Refused",
  "In general, how important, if at all, is having a lot of money in order for a woman to live a fulfilling life? Essential/Important, but not essential/Not important/Refused",
  "In general, how important, if at all, is being in a committed romantic relationship in order for a woman to live a fulfilling life? Essential/Important, but not essential/Not important/Refused",
  "In general, how important, if at all, is having children in order for a woman to live a fulfilling life? Essential/Important, but not essential/Not important/Refused",
  "In general, how important, if at all, is having a job or career they enjoy in order for a woman to live a fulfilling life? Essential/Important, but not essential/Not important/Refused",
  "Do you think it's a good thing or a bad thing that most people in our society look down on men who are manly or masculine? Good thing/Bad thing/Refused",
  "Describe the role of political parties in promoting gender equality. Do you believe the parties are doing well currently, or should they be more assertive in supporting gender balance in politics? High Interest/Moderate Interest/Low Interest/Not Interested",
  "How much influence does the media have on defining gender roles and identities? Is this influence predominantly positive or negative? Substantial influence/Limited influence/No influence/Refused",
  "Assess the impact of gender stereotypes on young individuals developing their sexual orientation and gender identity. Is this often damaging or beneficial, or there's no significant effect? Often damaging/Often beneficial/No significant effect/Refused",
  "Do you think educational institutions should promote inclusive sex education, discussing both heterosexual and LGBT+ relationships? Highly Necessary/Moderately Necessary/Not Necessary/Refused",
  "Explain the role of parental influence on children understanding and accepting their gender identity. Would you categorize parental influence as crucial, merely contributory, or non-essential in this process? Crucial/Contributory/Non-essential/Refused",
  "Voice your opinion on the portrayal of LGBT+ characters in mainstream movies and television. Do you find these representations accurate and positive, or are they often misleading or negative? Accurate and positive/Misleading or negative/Mixed/Refused",
  "Debate the effect of gender-neutral language in challenging binary thinking about gender. Is this a strong step forward in the fight for equality, or an unnecessary measure causing more confusion than clarity? Strong step forward/Unnecessary measure/No opinion/Refused",
  "Should transgender individuals have access to gender-affirming healthcare, including hormone therapies and surgeries, without excessive legal and medical hurdles? Absolutely/Debatable/Not at all/Refused",
  "Reflect on the importance of men's roles in promoting and achieving gender equality. Is this presence highly crucial towards the goal, marginally beneficial or largely insignificant? Highly crucial/Marginally beneficial/Largely insignificant/Refused",
  "Describe the societal implications of denying LGBT+ rights, particularly focusing on political and social stability. Is denying these rights extremely harmful, somewhat harmful, or irrelevant to stability? Extremely harmful/Somewhat harmful/Irrelevant/Refused",
  "Examine the concept of toxic masculinity. Is this a significant issue in society that needs addressing, a minor problem, or a non-issue? Significant issue/Minor problem/Non-issue/Refused",
  "Do you think affirmative action policies for women in the workplace help to combat gender discrimination? Beneficial/Can cause reverse discrimination/Not beneficial/Refused",
  "Reflect on the transition of societal norms and their effects on gender roles. Do you believe these transitions have produced mostly positive changes, have been mostly negative, or have had little effect on society? Mostly positive/Mostly negative/Little effect/Refused",
  "Discuss the notion of gender pay gap and its potential implications on the economy. Would solving this issue lead to better economic outcomes, have negligible effects, or could it potentially harm the economy? Better economic outcomes/Negligible effect/Potential harm/Refused",
  "Express your opinion on whether feminists are doing enough to include and fight for the rights of transgender women. They're doing enough/They could do more/They're not doing enough/Refused",
  "Highlight the significance of recognizing and addressing intersectionality in fighting against systemically sexist practices. Highly significant/Somewhat significant/Not significant/Refused",
  "Argue for or against the importance of representation of all genders and sexual orientations in children's media. Highly important/Somewhat Important/Not Important/Refused",
  "Discuss the effects of religious beliefs on attitudes towards sexuality. Do you think the impacts are mostly positive, mostly negative, or they don't make much difference in today's world? Mostly positive/Mostly negative/Makes no difference/Refused",
  "What role should businesses play in promoting LGBTQ+ rights within their organizations? Major Role/Minor Role/No Role/Refused",
  "Should gender be considered as a social construct or an inherent biological trait? Social construct/Inherent biological trait/Mix of both/Refused",
  "What's your stance on the issue of single-sex education? Are you in favour, against, neutral, or do you refuse to comment?",
  "What influence do you believe motherhood has on a woman's professional progression? Does it generally boost, hinder, have no noticeable effect, or do you refuse to comment?",
  "In your viewpoint, has the #MeToo movement played a positive, negative, unnoticeable or no significance evidence role in challenging gender norms and inequality?",
  "In your opinion, does being openly LGBTQ+ influence a candidate's chances at securing high political office? Would it mostly help, mostly hurt, or not make much of a difference?",
  "In general, do you think that the patriarchal structure of society encourages or discourages promotion of gender equality? Does it encourage, discourage, have no evident effect or do you refuse to state?",
  "How do you perceive the issue of the gender pay gap? Is it a major problem, a minor problem, a nonexistent problem, or would you rather not express an opinion?",
  "What impact do you think having more women in leadership roles would have on society? Would it be hugely beneficial, mildly beneficial, have no effect, or would you prefer not to comment?",
  "What role do you think so-called \"macho\" culture plays in space traditionally dominated by men, like politics or business? Is it a massive problem, a minor problem, a nonexistent problem, or do you prefer not to express your opinion?",
  "In businesses, do you think professional promotions are based on gender or merit? Do they favour men, women, both equally, or would you rather abstain from commenting?",
  "Discuss the potential impact of systemic sexism on both men and women in the society. Does it majorly affect men, women, both equally or do you choose to abstain?",
  "How do you think a man having an empathetic demeanor affects his chances of gaining political office? Mostly aids a man's chances/Mostly damages a man's chances/Doesn't make much of a difference/Refused",
  "How do you view the issue of unequal representation of LGBTQ+ individuals in top business or political roles? Is it a major concern, a minor concern, no concern, or would rather not comment?",
  "Please indicate whether societal pressures and expectations effect women’s choices of career. Major factor/Minor factor/Not a factor/Refused",
  "What effect do you feel the media portrayal of transgender individuals has on society's acceptance of them? Does it highly influence acceptance, slightly influence acceptance, not influence acceptance, or would you prefer not to express your opinion?",
  "What impact does toxic masculinity have on men's mental health? Is it a primary factor, a secondary factor, not a factor, or do you refuse to express a view?",
  "Where do you stand on the issue of non-binary genders being recognized legally? Strongly supportive, mildly supportive, unsupportive, or would you rather not express your opinion?",
  "How important do you think it is for schools to implement comprehensive sexual education programs? Extremely important, moderately important, not important, or would you rather not express your view?",
  "What do you believe is the impact of societal gender norms on mental health? Is it a significant factor, a minor factor, not a factor, or do you refuse comment?",
  "What are your thoughts on mandatory gender quotas in company boards? Highly beneficial, somewhat beneficial, not beneficial, or would you rather not express your opinion?",
  "Do you think that having more people who identify as LGBTQ+ in top executive business positions would change how companies approach diversity and inclusion? It would dramatically change/It would somewhat change/It would not change/Refused",
  "Does the perception of women as caretakers rather than providers impact their chances of securing top executive positions? Very likely/Somewhat likely/Not at all likely/Refused",
  "How do societal expectations about masculinity influence the probability of men pursuing careers in fields traditionally dominated by women? Greatly influences/Moderately influences/Does not influence/Refused",
  "How would the growth of gender-neutral clothing and beauty products affect societal perceptions of gender and sexuality? A lot/Some/Not much/Nothing at all/Refused",
  "Can you discuss how the representation of LGBTQ+ characters in popular media influences societal views on gender and sexuality? Significantly influences/Slightly influences/Does not influence/Refused",
  "Do you believe that the gender wage gap is a substantial issue that contributes to broader gender inequality? Significant issue/Minor issue/Not an issue/Refused",
  "How would the implementation of nationwide gender identity and sexual orientation protection laws shape American society? Tremendously/To some extent/Very little/Not at all/Refused",
  "Do expectations around traditional gender roles influence men's or women's desire to run for political office? Major influence/Minor influence/No Influence/Refused",
  "To what extent does the lack of comprehensive sex education in schools contribute to misconceptions about gender and sexuality? Highly contributes/Moderately contributes/Does not contribute/Refused",
  "How significantly does patriarchal society affect women's chances of rising to top leadership positions? Heavily affects/Somewhat affects/Doesn't affect/Refused",
  "What is the impact of gender stereotypes on the mental health of individuals who identify as non-binary or genderqueer? Highly impactful/Somewhat impactful/Not impactful/Refused",
  "How much does the over-sexualization of women in media influence societal expectations of femininity? Greatly influences/Moderately influences/Does not influence/Refused",
  "What effect would the affirmation of intersectionality in feminist movements have on achieving gender equality? A lot/Some/Not much/Nothing at all/Refused",
  "In what way does the representation of gender conformity in children's media reinforce traditional gender norms? Reinforces greatly/Reinforces moderately/Does not reinforce/Refused",
  "How would eliminating the gender binary system impact societal views on gender and sexuality? Tremendously/To a certain extent/Very little/Not at all/Refused",
  "Does the lack of LGBTQ+ history in school curricula contribute to homophobia and transphobia in society? Major contribution/Minor contribution/No contribution/Refused",
  "What effect would the implementation of parental leave policies for men and women equally have on gender roles? Considerable effect/Moderate effect/Little effect/No effect/Refused",
  "Does the parental enforcement of traditional gender roles influence a child’s understanding of their own gender identity? Highly influences/Moderately influences/Does not influence/Refused",
  "What impact does the religious interpretation of gender and sexuality have on the rights of the LGBTQ+ community? Strong impact/Moderate impact/Little impact/No impact/Refused",
  "In your interpretation, does the wage gap between men and women hold significant importance on the foundation of economic disparities? Immensely significant/Moderately significant/Insignificant/Refused",
  "What implications do you think exist if women are not represented adequately in the decision-making process at a national or international level? Major implications/Minor implications/No implications/Refused",
  "Discuss the general impact of patriarchal norms on the wellness and mental health of men? High impact/Moderate impact/Low impact/No impact/Refused",
  "Explain how same-sex education might influence traditional gender norms among students? Strongly reinforces norms/Slightly reinforces norms/Does not reinforce norms/Refused",
  "In your opinion, how necessary is it for people of all genders to have access to comprehensive sexual education? Highly necessary/Moderately necessary/Not necessary/Refused",
  "Could you talk about how homophobia might impact the overall socio-political climate of a community? Highly impactful/Moderately impactful/Not impactful/Refused",
  "How do you perceive parental leave policies' influence on gender equality in the workplace? Highly influential/Moderately influential/Not influential/Refused",
  "How important do you feel is it to debunk stereotypes related to masculinity for overall societal well-being? Highly important/Moderately important/Not important/Refused",
  "Do you think that a man expressing vulnerability publicly affects the general societal perception of masculinity? Drastically affects/Slightly affects/Doesn't affect/Refused",
  "The representation of LGBTQ+ characters in media, what effect do you think it possesses in shaping societal perception? Major effect/Minor effect/No effect/Refused",
  "Would you discuss the bearing on society when prominent political figures openly identify as LGBTQ+? Major bearing/Minor bearing/No bearing/Refused",
  "Please assess the influence that social media can have on a person's understanding and acceptance of their own sexuality? High influence/Moderate influence/Low influence/No influence/Refused",
  "In terms of addressing gender inequality in politics, how substantial a role do quotas for women play? Highly substantial/Moderately substantial/Not substantial/Refused",
  "Do you think establishments predominantly run by women encounter more obstacles in gaining societal acceptance? Many obstacles/Few obstacles/No obstacles/Refused",
  "In your view, what kind of impact does shared domestic responsibilities have on the dynamics of gender equality? Major impact/Minor impact/No impact/Refused",
  "Talk about the perceived effect on societal attitudes when popular public figures express support for trans rights? Major effect/Minor effect/No effect/Refused",
  "Let's discuss the importance of intersectionality in understanding the complexity of gender inequalities. Highly crucial/Moderately crucial/Not crucial/Refused",
  "Would you explain how portrayals of gender non-conformity in art and culture impacts societal acceptance? Major impact/Minor impact/No impact/Refused",
  "Can you comment on how establishing gender studies in school curriculums might influence the development of gender perspectives? Major influence/Minor influence/No influence/Refused",
  "Do you think the religious beliefs of a population significantly affect one's rights and acceptance of being LGBTQ+? Have significant effect/Have minor effect/Have no effect/Refused",
  "Please express your thoughts regarding gender-neutral bathrooms. Do you believe they foster inclusivity or do you see them as problematic? Pro-inclusivity/Problematic/No Opinion/Refused",
  "How significant do you think the impact of media representation is on societal acceptance of different gender and sexual identities?  Trivial/Significant/Neutral/Refused",
  "What are your thoughts on the inclusivity of transgender athletes in sports corresponding to their identified gender? Support/Oppose/Neutral/Refused",
  "With the increase in gender reassignment surgeries, do you believe health insurance should cover these procedures? Yes/No/No Opinion/Refused",
  "Do you feel that gender should be determined strictly by biology, or that individuals should have the autonomy to identify their own gender? Biology Determines/Autonomy Decides/No Opinion/Refused",
  "In your opinion, is the trend of acknowledging and using people's preferred pronouns (he, she, they) beneficial or harmful to society? Beneficial/Harmful/Neutral/Refused",
  "Where do you stand on the issue of same-sex couples adopting children? Support/Oppose/Neutral/Refused",
  "Do you think society places too much importance on traditional gender roles? Yes/No/Neutral/Refused",
  "How do you perceive the wage gap between men and women in similar professional roles? It is a serious issue/It's exaggerated/No Opinion/Refused",
  "In your view, are comprehensive sex education programs that include information about different sexual orientations beneficial? Yes/No/No Opinion/Refused",
  "Do you believe that individuals who identify as non-binary should be legally recognized with their chosen identity? Yes/No/No Opinion/Refused",
  "Do you feel that socially constructed gender roles have a significant impact on career choice? Yes/No/Neutral/Refused",
  "In your opinion, should businesses and organizations be required to have diversity and inclusivity training? Yes/No/No Opinion/Refused",
  "Do you feel that individuals should have the right to serve in the military regardless of their gender identity? Yes/No/No Opinion/Refused",
  "What is your position on requiring equal representation of genders in political offices? Support/Oppose/Neutral/Refused",
  "Do you believe that parental leave should be equal for all genders? Yes/No/No Opinion/Refused",
  "Is it important that businesses take steps to increase representation of all genders in leadership positions? Yes/No/No Opinion/Refused",
  "In your view, does the representation of LGBTQ+ characters in mainstream entertainment promote acceptance and understanding? Yes/No/No Opinion/Refused",
  "Do you think sex education curriculums should include discussion and education about consent? Yes/No/No Opinion/Refused",
  "Do you believe that the current societal conversation about gender and sexuality is leading to progress or division? Progress/Division/Neutral/Refused",
  "Please explain how presenting a strong personality may affect a woman's likelihood of acquiring a senior role in the business sphere. Does it generally aid a woman/Mostly hinders the applicant/Doesn't really influence the outcome/Refused",
  "Reflecting on the differing styles of governance displayed by men and women at the peak of politics and business, would you argue Women generally adopt a superior approach/Men usually have a superior approach/Neither is superior/Refused",
  "In general, how do you think demonstrating assertiveness influences a man's opportunities to be selected for a significant political position? Does it enhance a man's options/ does it detract from a man's possibilities/Doesn't have much effect/Declined to answer",
  "In general, how do you think expressing vulnerability impacts a man's chances of being chosen for a significant political position? Mostly advantages a man/Mostly disadvantages a man/Doesn't particularly affect/Declined to comment",
  "Please elaborate on how gender stereotypes may be a factor in why fewer women occupy leading roles in the corporate world. Is it a substantial factor/a minor factor/not a factor/Refused",
  "In your opinion, how do you think public displays of feminine traits might impact a woman's attempt to secure a top executive business position? Mostly aids a woman's attempt/Mostly hampers a woman's attempt/Has little impact on the attempt/Refused",
  "Looking at the gender disparities in leadership, how do you think gender bias impacts a person's chances of rising to an executive business position? Significant factor/Minor factor/Not a factor/Refused",
  "Do you believe the societal expectations on parenthood affect the representation of women in top positions in business and politics? Considerably contributes/Contributes a little/Doesn't affect their representation/Refused",
  "How do you think a man expressing traditional feminine qualities affects his prospects of obtaining a top executive business position? Is advantageous/Disadvantageous/Has no significant effect/Refused",
  "Considering the gender gap in top executive positions, do you think the lack of mentors for women is a reason why fewer women occupy these roles? Significant reason/Minor reason/No Reason/Refused",
  "In your opinion, how does the public's acceptance of diverse sexual orientations impact a candidate running for a high political office? Positively affects/ Negatively affects/Doesn't impacts their chances/Refused",
  "What is your perspective on the role of the 'Glass Ceiling' effect in the representation of women in top business positions? Major deterrent/Minor deterrent/Not a deterrent/Refused",
  "How do you think being outspoken about gender disparity may impact a woman's chances of promotion to high political office? A primary advantage/A primary disadvantage/Little to no effect/Refused",
  "Do you choose, when considering women's reduced presence in top political positions, the lack of societal support for female leaders is a reason? Major reason/Minor Reason/Not a Reason/Refused",
  "In your view, how does the media portrayal of women affects their prospects in securing top executive positions in business? Contributes greatly/Contributes a little/Doesn't contribute/Refused",
  "Do you think that financial barriers are a reason why fewer women are seen in politics than men? Significant reason/Minor reason/Not a reason/Refused",
  "Do you believe that expressing controversial opinions on gender roles impact a woman's chances of being elected to high political office? Positively affects/Negatively affects/Doesn't have a significant impact/Refused",
  "What are your thoughts on how the presence of women in the family impacts her chances of achieving a top executive business role? Mostly helps a woman's chances/Mostly hurts a woman's chances/Has negligible impact/Refused",
  "How do you think being open about one's LGBTQ+ identity affects their chances of getting elected to high political office? Mostly assists their chances/Mostly hinders their chances/Doesn't particularly affect/Refused",
  "In your opinion, does the societal expectation for men to be emotionally strong have more positive or negative effects on their mental health? Positive effects/Negative effects/No discernible effects/Refused to answer",
  "Would you say that a woman in a leadership position is generally more effective at fostering a collaborative working environment than a man? Yes/No/No difference/Refused",
  "How much influence, if any, do you think the media has on the stereotypes associated with gender and sexuality? A lot/Some/Not much/No influence/Refused",
  "What is your stance on gender-neutral bathrooms in public spaces? Principally support/Principally oppose/Neutral/Refused",
  "Do you believe that sex education in schools should include discussions on sexual orientation and gender identities? Yes/No/Neutral/Refused",
  "Are men or women under more societal pressure to conform to traditional gender roles? Men/Women/Equal pressure/Refused",
  "In the realm of public office, do men or women face more scrutiny and prejudice? Men/Women/No discernible difference/Refused",
  "Do you think women, in general, are more empathetic than men, thereby making them more effective in personal-centric roles? Agree/Disagree/No difference/Refused",
  "In your opinion, do women face more workplace discrimination in the tech industry than men? Yes/No/Not sure/Refused",
  "Are parental leave policies less favourable towards men, thereby perpetuating the stereotype of women as primary caregivers? Agree/Disagree/Not sure/Refused",
  "Are the responsibilities of child-rearing fairly shared between genders in modern family structures? Yes/No/It varies/Refused",
  "Would you say that men hold an advantage in negotiating salaries and promotions in corporate settings? Yes/No/No difference/Refused",
  "Does the underrepresentation of women in STEM fields stem from societal norms and biases? Agree/Disagree/Not sure/Refused",
  "Do you believe that gender quotas in companies and government institutions are necessary to ensure gender equality? Yes/No/Neutral/Refused",
  "Are women more likely than men to be victims of online harassment? Yes/No/No clear difference/Refused",
  "Is there societal pressure on women to prioritize family and domestic duties over career growth? Yes/No/It varies/Refused",
  "Would you say that men are less likely to be believed when they report cases of sexual harassment? Agree/Disagree/Not sure/Refused",
  "Would you agree that our society tends to reward assertive, dominant behavior in men more than women? Agree/Disagree/It depends/Refused",
  "In general, are men or women more likely to face bias and discrimination within the healthcare system? Men/Women/No discernible difference/Refused",
  "Do you believe that individuals should have the right to identify with a gender different from their biological sex? Yes, they should have the right/No, they should not have the right/Unsure/Refused",
  "How do you perceive the impact of feminism on the equality of genders? Mostly positive/Mostly Negative/No Impact/Refused",
  "Is there a need for organizations to consider gender diversity in their hiring practices? Significant need/Some need/No need/Refused",
  "Do you feel that there is equal representation of both genders in politics? Both genders are equally represented/Under-representation of women/Under-representation of men/Refused",
  "Do you hold the belief that traditional gender roles should be upheld in today’s society? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "Do you feel the MeToo movement has had a positive impact on addressing gender-based harassment and assault? Significant positive impact/Somewhat positive impact/No impact/Refused",
  "Is it important for children to be educated about different sexual orientations at school? Very important/Somewhat important/Not at all important/Refused",
  "Do you believe access to safe and legal abortion services is a fundamental right for women? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "Do you think media representation of the LGBTQ+ community influences societal attitudes towards them? Highly influences/Somewhat influences/Doesn't influence at all/Refused",
  "Think about public restrooms. Should they remain gender-specific or become gender-neutral? Should remain gender-specific/Should become gender-neutral/Unsure/Refused",
  "Do you believe that gender pay gaps exist in the workforce today? They definitely exist/They may exist/They don't exist/Refused",
  "Do you support affirmative action policies in the workplace to promote gender equality? Strongly support/Support/Oppose/Strongly oppose/Refused",
  "In regards to parenting, do you think that women are naturally better caregivers than men? Women are better/Neither is better/Men are better/Refused",
  "Do you believe that same-sex couples should have the same adoption rights as heterosexual couples? Yes, they should/No, they should not/Unsure/Refused",
  "How do you perceive the current state of transgender rights in your country? Very advanced/Somewhat advanced/Not at all advanced/Refused",
  "Do you feel there is discrimination present in how society treats individuals based on their sexuality? There is a lot of discrimination/There's some discrimination/There's no discrimination/Refused",
  "Should health insurance companies be required to offer coverage for gender confirmation surgery? Definitely should/Should/Might or might not should/Shouldn't at all/Refused",
  "Do you support the inclusion of comprehensive sexual education in the school curriculum? Strongly support/Support/Oppose/Strongly oppose/Refused",
  "Does a person’s sexual orientation impact their ability to parent effectively? It does impact/It may impact/It doesn’t impact at all/Refused",
  "How do you think the access to health services differs for LGBT individuals compared to the non-LGBT population? Much better for LGBT/Slightly better for LGBT/No difference/Slightly worse for LGBT/Much worse for LGBT/Refused",
  "In your opinion, is there sufficient representation for women in the tech industry? Too many women/Too few women/About the right number of women/Refused",
  "Do you believe that heteronormativity in our society harms the LGBTQ+ community? Major harm/Minor harm/No harm at all/Refused",
  "Can passion, empathy and ambition be prioritized over gender in the selection for leadership roles? Absolutely should be prioritized/Should somewhat be prioritized/Should not be prioritized/Refused",
  "What do you think about the impact of gender stereotypes on individuals' career choices? Major impact/Minor impact/No impact/Refused",
  "Do you believe it's easier for men to climb the corporate ladder than it is for women? Much easier for men/Slightly easier for men/No difference/Slightly easier for women/Much easier for women/Refused",
  "Does the inclusion of gender pronouns in professional settings provide an inclusive environment for the LGBT+ community? Extremely inclusive/Somewhat inclusive/Not at all inclusive/Refused",
  "Do you think there is a bias in how male and female entrepreneurs are funded/financed? Much more bias towards men/Slightly more bias towards men/No difference/Slightly more bias towards women/Much more bias towards women/Refused",
  "How comfortable are you with trans individuals using bathrooms that correspond to their gender identity? Very comfortable/Somewhat comfortable/Not comfortable/Refused",
  "What's your take on the pay gap between men and women? It's a major issue/It's a minor issue/It's not an issue/Refused",
  "In your opinion, who is more prone to facing gender discrimination, men or women? Much more for women/Slightly more for women/Equal/Slightly more for men/Much more for men/Refused",
  "What's your thought on sexual orientation diversity in politics? There is too much diversity/There is too little diversity/There is just enough diversity/Refused",
  "Do you believe that masculine and feminine traits should influence job roles? Much influence/Some influence/A little influence/No influence/Refused",
  "Do you think the military should allow transgender people to serve openly? Strongly favor/Favor/Neutral/Oppose/Strongly oppose/Refused",
  "Are sexual harassment laws too strict, too lenient, or just right? Too strict/Just right/Too lenient/Refused",
  "How do you perceive feminism's impact on society? Extremely positive/Somewhat positive/Neutral/Somewhat negative/Extremely negative/Refused",
  "Do you think businesses have taken appropriate measures to ensure workplace gender equality? Definitely yes/Probably yes/Probably no/Definitely no/Refused",
  "How important is it for company boardrooms to have an equal gender representation? Very important/Important/Neutral/Not important/Not important at all/Refused",
  "Do you think making divorce more difficult would contribute positively or negatively to the sanctity of marriage? Very positive/Somewhat positive/Neutral/Somewhat negative/Very negative/Refused",
  "How do you feel about teaching LGBT history and gender theory in schools? Strongly in favor/Slightly in favor/Neutral/Slightly against/Strongly against/Refused",
  "Please specify whether you believe the following is a reason for the wage gap between men and women: Women generally choose lower-paying jobs. Major reason/Minor reason/Not a reason/Refused",
  "What's your stance on transgender individuals being allowed to serve in the military? Strongly support/Moderately support/Moderately oppose/Strongly oppose/Refused",
  "Do you agree with the notion that society is too lenient on men when they commit sexual harassment? Agree strongly/Agree somewhat/Disagree somewhat/Disagree strongly/Refused",
  "Do you think it's important for companies to have mandatory diversity training to promote workplace equality? Absolutely important/Somewhat important/Neutral/Somewhat unimportant/Absolutely unimportant/Refused",
  "Should the government provide financial support to households where women are the primary earners? Strongly support/Support/Neutral/Oppose/Strongly oppose/Refused",
  "Would you agree that gender quotas should be implemented to achieve balanced representation in politics? Strongly agree/Agree/Neutral/Disagree/Strongly disagree/Refused",
  "Do you believe that feminism has gone too far and is now disadvantaging men? Strongly agree/Agree/Neither agree nor disagree/Disagree/Strongly disagree/Refused",
  "Please state your opinion on whether persistent gender stereotypes contribute to workplace bias: Major contribution/Moderate contribution/Minor contribution/No contribution/Refused",
  "Do you agree that transitioning gender is a basic human right? Strongly agree/Agree/Neutral/Disagree/Strongly disagree/Refused",
  "Do you think that homophobia is still a significant issue in America? Yes, definitely/Yes, somewhat/Neutral/Not really/Not at all/Refused",
  "What is your position on the government funding for Planned Parenthood? Strongly support/Support/Neutral/Oppose/Strongly oppose/Refused",
  "Do you believe sexual orientation should be added as a protected category under hate crime laws? Yes, definitely/Yes, probably/Neutral/Probably not/Definitely not/Refused",
  "Is it necessary for schools to teach children about various sexual orientations and identities? Highly necessary/Somewhat necessary/Neutral/Not really necessary/Not necessary at all/Refused",
  "Do you think gender-neutral bathrooms should be more widely available? Highly agree/Somewhat agree/Neutral/Somewhat disagree/Highly disagree/Refused",
  "Should companies be required to disclose salary information to guarantee equal pay? Strongly agree/Agree/Neutral/Disagree/Strongly disagree/Refused",
  "Do you concur that parental leave should be equally available to both genders? Strongly agree/Agree/Neutral/Disagree/Strongly disagree/Refused",
  "Is it appropriate to have mixed-gender sports teams in schools? Highly appropriate/Somewhat appropriate/Neutral/Somewhat inappropriate/Highly inappropriate/Refused",
  "Do you consider that gender-specific toys enforce detrimental stereotypes on children? Strongly believe/Believe/Neutral/Do not believe/Strongly do not believe/Refused",
  "Should health insurance companies be obligated to cover gender reassignment surgery? They absolutely should/They probably should/Neutral/They probably should not/They absolutely should not/Refused",
  "Reflect on the intersection of race, gender, and class in today's society. How do you believe these factors intersect and influence individuals’ experiences and opportunities, especially those of women of color?",
  "Explain your thoughts about the impact of traditional gender roles and stereotypes on young children. Do you think they restrict children’s development, aspirations, and potentials?",
  "What's your perspective regarding the gender pay gap? Is it a real problem requiring proactive measures or is it just a myth perpetuated by certain ideologies?",
  "Consider the representation of women in STEM fields. Do you think there is a lack of representation and what active steps should be taken to promote diversity in these fields?",
  "Evaluate the significance of affirmative action policies in promoting gender equality in the workplace. Do you believe these policies help to level the playing field or do they lead to reverse discrimination?",
  "How do you interpret the concept of toxic masculinity? Does it have a damaging effect on men and society as a whole, or is it an unfair generalization?",
  "Ponder the current state of LGBTQ+ rights worldwide. Would you say that significant strides have been made towards equality, or is there a long road still ahead?",
  "Share your views on the influence of media and popular culture on our perceptions of gender. Do you think it perpetuates harmful stereotypes or it is gradually breaking down these clichés?",
  "What's your stance on the issue of transgender athletes competing in sports? Do they have an unfair advantage or is this another form of discrimination?",
  "Express your opinion on the \"Me Too\" movement. Has it been effective in raising awareness and instigating positive change, or has it led to unwarranted victimization?",
  "Recognize the historical significance of the feminist movement. Do you view it as a crucial force in societal advancement or as a propagator of divide?",
  "Think about the impact of single-gender education. Is it beneficial for optimising learning, or does it hinder the development of social skills and gender relations?",
  "Reflect on the ongoing debate related to reproductive rights. Should women have complete autonomy over their bodies, or are there other factors to be considered?",
  "Considering the gender disparity in political representation, do you see this as a barrier to fair and inclusive governance? Is it important to have equal representation in politics?",
  "Please describe your thoughts on issues related to gender identity and sexual orientation being incorporated into school curricula. Can it promote acceptance, or does it complicate things prematurely for students?",
  "Think about the recent surge in gender-neutral parenting. Do you believe this approach allows children to grow without stereotypical constraints, or does it add unnecessary confusion?",
  "Talk about the increased presence of women in the military. Is it a sign of progress in gender equality or does it present additional concerns for their safety?",
  "How do you perceive the expectations for men to be the primary earners in a family? Is this traditional mindset still relevant, or is it outdated?",
  "Do you think the concept of masculinity and femininity needs to be redefined in the current context of society? What changes would you propose?",
  "Discuss the role of men in the struggle for gender equality. Can they be allies in this fight or is it solely a women's issue?",
  "What's your opinion on the belief that there is an overemphasis on gender differences in our society? Is there Too much emphasis/Too little emphasis/About right/Refused",
  "What are your thoughts regarding the visibility of LGBTQ+ individuals in leadership roles in business today? Is it Far too low/About right/Too much/Refused",
  "Do you think that the representation of women in tech fields is adequate or should there be more efforts towards inclusivity? Need more efforts/About right/Too much/Refused",
  "How much influence do you think patriarchal societal norms have on the marginalization of female political leadership? Major influence/Minor influence/No influence/Refused",
  "Could homophobia and transphobia be considered as contributing factors to higher suicide rates among LGBTQ+ youth? Major reason/Minor reason/Not a reason/Refused",
  "Could gender bias contribute to wage disparities between men and women? Major reason/Minor reason/Not a reason/Refused",
  "In your opinion, do you think that men and women should have equal representation in governmental policies related to reproductive rights? Should men and women have equal say/Should women have more say/Should men have more say/Refused",
  "Is it right to assume that LGBTQ+ inclusion in marketing campaigns is simply a marketing tactic? Yes, it's just a tactic/No, it's more than a tactic/Can't say/Refused",
  "Do you think trans athletes should be able to compete in professional sports conforming to their gender identity? Absolutely/Not really/It doesn't matter/Refused",
  "How much importance do you give to educating children about gender and sexual diversity? High Importance/Moderate Importance/Low Importance/Refused",
  "Do you think the power dynamics in a traditional marriage favor a particular gender? Favor men/Favor women/No Difference/Refused",
  "How much does societal pressure to conform to gender norms influence mental health in teenagers? Major influence/Minor influence/No influence/Refused",
  "Do you think that the presence of women in STEM fields is influenced by societal perceptions of gendered capabilities? Major influence/Minor influence/No influence/Refused",
  "How does same-sex marriage legalization affect societal values? Mostly positive/Mostly negative/No significant effect/Refused",
  "Do you attribute the lack of women in leadership positions to biased hiring practices? Major reason/Minor reason/Not a reason/Refused",
  "Do inherent biological differences between men and women justify gender roles in society? Yes/No/Depends on the situation/Refused",
  "Do you think a person's gender identity should be recognized legally even if it differs from their assigned sex at birth? Yes/No/Neutral/Refused",
  "Do you think an active participation of men is necessary for women's liberation movements? Absolutely/Not necessarily/No Opinion/Refused",
  "Do you consider the portrayal of sexuality in media influences societal attitudes towards LGBTQ+ communities? Major influence/Minor influence/No influence/Refused",
  "Do you believe that traditional definitions of masculinity can contribute to issues such as the underrepresentation of women in leadership roles and the wage gap? Agree/Disagree/Neutral/Refused",
  "Would having more transgender representatives in our government lead to better understanding and policies relating to gender and sexual orientation? Yes/No/Unsure/Refused",
  "In your view, is there a significant need for comprehensive sex education in schools that includes discussion on consent, different sexual orientations and gender identities? Essential/Important, but not essential/Not important/Refused",
  "Should employers be allowed to discriminate based on sexual orientation or gender identity? Yes/No/Unsure/Refused",
  "What are your thoughts on the idea that women's rights movements have done enough to achieve gender equality and there is no further need for activism? Agree/Disagree/Neutral/Refused",
  "Elaborate on the statement that you agree with more: Women's income is less than men's because they do not pursue high-paying jobs or Women's income is less than men's due to gender discrimination in the workplace.",
  "How essential do you think it is to continue the fight for equal rights for individuals who identify as LGBTQ+? Essential/Important, but not essential/Not important/Refused",
  "How much impact do you think the representation of different genders and sexual orientations in media and entertainment has on societal acceptance? A lot of impact/Some impact/Little to no impact/Refused",
  "What's your opinion on the following statement: Traditional gender roles have hampered the full achievement of women's rights? Agree/Disagree/Neutral/Refused",
  "Should transgender individuals be allowed to serve in the military? Yes/No/Unsure/Refused",
  "Do you agree with this statement: \"The concept of gender is purely social and has no biological basis\"? Agree/Disagree/Neutral/Refused",
  "Is there an urgent need to address the issues of violence and discrimination faced by the transgender community? Yes/No/Unsure/Refused",
  "Please choose the statement that you agree with more: Equal pay for women can only be achieved by policy changes or Equal pay for women can be achieved without policy changes.",
  "Do you believe a universal basic income could help remedy the economic inequality faced by women and minorities? Yes/No/Unsure/Refused",
  "Choose the viewpoint you align with: A person's sexual orientation is a personal choice or A person's sexual orientation is not a choice but rather an inherent aspect of their identity.",
  "Do you think access to sex reassignment surgery should be a guaranteed right? Yes/No/Unsure/Refused",
  "Weigh in on the statement that you believe is truer: Women should be incentivized to take up roles in male-dominated professions or Women should have the freedom to choose any profession without external influence.",
  "How important is it to hire more women in tech fields in order to close the gender inequality gap in the industry? Essential/Important, but not essential/Not important/Refused",
  "Do you agree with this statement: \"The lack of gender-neutral language in our everyday communication contributes to unconscious bias and discrimination\"? Agree/Disagree/Neutral/Refused",
  "Should governments be more proactive in passing laws protecting the rights of LGBTQ+ individuals? Yes/No/Unsure/Refused",
  "Regarding access to safe and legal abortion, do you believe it is essential for women's rights or detrimental to societal values? It is essential/It is detrimental/No opinion/Refused",
  "How do you conceive the idea of men taking parental leave to care for their newborns? Enlightening or Unnecessary? Enlightening/Unnecessary/No opinion/Refused",
  "Do you consider that the wage gap between men and women is a significant issue that needs governmental intervention? Yes/No/I'd rather not say/Refused",
  "To what extent, if at all, do you believe that women's sports should receive the same funding and media coverage as men's sports? Equal/Different/No preference/Refused",
  "How beneficial, if at all, is it for society to have gender-neutral public restrooms? Extremely beneficial/Slightly beneficial/Not beneficial at all/Refused",
  "Do you hold the view that transgender people should be allowed to serve in the military? Absolutely/Somewhat/Not at all/Refused",
  "Is affirming non-binary gender pronouns a reflection of progress or confusion in society? Progress/Confusion/No opinion/Refused",
  "Do you think equal representation of both genders in politics improves or deteriorates policymaking? Improves/Deteriorates/No effect/Refused",
  "In your perspective, does sex education in schools help adolescents or does it corrupt them? It helps/It corrupts/No effect/Refused",
  "Do you believe in the idea of \"toxic masculinity?\" Strongly agree/Slightly agree/Slightly disagree/Strongly disagree/Refused",
  "Should biological sex be the determinant in sports category or can gender identity serve as sufficient criteria? Biological sex/Gender identity/I'm not sure/Refused",
  "Can people of the same sex be able to effectively parent a child as those of the opposite sex? Certainly/Most likely/Unlikely/Definitely not/Refused",
  "Do government policies adequately account for the unique challenges faced by LGBTQ+ individuals? They do/They don’t/I don't know/Refused",
  "In your opinion, does the MeToo movement help address gender inequalities or does it create unnecessary tension between the genders? Address inequalities/Creates tension/Has no effect/Refused",
  "Do you consider that people who identify as LGBTQ+ should have the same adoption rights as straight couples? Absolutely/Perhaps/Definitely Not/Refused",
  "Does having more women in technology and engineering sectors improve innovation? Yes/No/I'm not sure/Refused",
  "Do schools provide enough support for transgender students in their journey? Plenty of support/Some support/No support/I'm not sure/Refused",
  "What do you think about the idea of compulsory conscription being applied equally to both sexes? Acceptable/Unacceptable/Not sure/Refused",
  "Does the notion of \"mansplaining\" resonate with your experience or do you find it unnecessarily divisive? Resonates/Divisive/Neither/Refused",
  "Are current measures for dealing with sexual harassment in workplace adequate? Yes/No/Needs improvement/Refused",
  "Do you think the gender pay gap negatively affects women's motivation towards their fields of work? Makes them less motivated/Does not affect their motivation/Makes them more motivated/Refused",
  "Is the representation of sexual minorities in mainstream media essential for societal acceptance of these groups? Critical/Important but not critical/Not important/Refused",
  "Does the absence of parental leave policies in a workplace disproportionately affect women? Major impact/Minor impact/No impact/Refused",
  "Do you believe gender-neutral language promotes more inclusivity in society? Significantly promotes/Partially promotes/Does not promote/Refused",
  "Why do you think men are underrepresented in fields like nursing or teaching? Societal stereotypes/Inadequate representation/Insufficient interest/Refused",
  "Is the education system responsible for shaping children's understanding of gender roles? Major responsibility/Minor responsibility/No responsibility/Refused",
  "How impactful is the media in shaping the public's perception of the LGBTQ+ community? Highly impactful/Somewhat impactful/Not impactful/Refused",
  "Do you believe that transgender people face discrimination in healthcare systems? Experience major discrimination/Experience minor discrimination/Don't experience discrimination/Refused",
  "Is it important to include LGBTQ+ history in the education system's curriculum? Absolutely important/Important but not mandatory/Not important/Refused",
  "In your opinion, do women face cultural biases when they express political ambitions? Face major bias/Face minor bias/Don't face bias/Refused",
  "Do you think the fight against homophobia requires more effort from political leaders? Needs major commitment/Needs some commitment/Does not need any commitment/Refused",
  "Does society expect men to suppress their emotions more often than women? Yes, significantly/Yes, but not often/No, not at all/Refused",
  "Do you think that the underrepresentation of women in politics contributes to gender inequalities in society? Contributes significantly/Contributes somewhat/Does not contribute/Refused",
  "Are the current human rights protections adequate for trans people? Fully adequate/Partially adequate/Not adequate/Refused",
  "Should sexual education in schools include discussions on consent and LGBTQ+ issues? Absolutely should/Should, but not mandatory/Shouldn't/Refused",
  "Does the imbalance in housework between genders stem from societal gender norms? Largely/Partially/Not at all/Refused",
  "How influential are parents in shaping a child's understanding of gender and sexuality? Highly influential/Influential to some extent/Not influential/Refused",
  "Is it necessary to integrate gender sensitization programs into workplace environments? Very necessary/Necessary but not urgent/Not necessary/Refused",
  "How important is it for movies and television to accurately represent women and LGBTQ+ characters? Very important/Important but not critical/Not important/Refused",
  "In general, do you believe women, men, or no gender is superior in managing a work-life balance effectively? Women are superior/Men are superior/No difference/Refused",
  "Considering society's stereotypes, how do you think identifying as non-binary or transgender might affect someone’s chances of being elected to high political office? Mostly helps their chances/Mostly hurts their chances/Doesn't make much of a difference/Refused",
  "In general, do you believe that it is easier for men, women, or neither to excel in technology and engineering fields? Easier for men/Easier for women/No difference/Refused",
  "How do you think a woman's choice to not bear children impacts her career progression? Mostly helps her career/Mostly hurts her career/Doesn't make much of a difference/Refused",
  "Is it a significant reason for fewer women in high political offices because they are hesitant to engage in aggressive campaigns? Major reason/Minor reason/Not a reason/Refused",
  "Evaluate whether men, women, or neither are better suited for customer service oriented roles. Men are better suited/Women are better suited/No difference/Refused",
  "How significantly does a man's decision to become a stay-at-home dad affect his societal admiration? Mostly increases admiration/Mostly decreases admiration/Doesn't make much of a difference/Refused",
  "Is it a reasonable statement to mention that men, women, or neither are inherently predisposed to be more nurturing and empathetic? Men are inherently predisposed/Women are inherently predisposed/No difference/Refused",
  "Look into whether the societal pressure on men to not express their emotions openly is a significant factor in escalating mental health issues. Major factor/Minor factor/Not a factor/Refused",
  "Estimate how a woman being seen as too ambitious impacts her chances of getting a top business executive position. Mostly helps her chances/Mostly hurts her chances/Doesn't make much of a difference/Refused",
  "In your opinion, do men, women, or neither have a higher level of emotional intelligence inherently? Men have higher emotional intelligence/Women have higher emotional intelligence/No difference/Refused",
  "Analyzing the societal view, does a woman choosing to dress more masculine affect her societal acceptance? Mostly increases acceptance/Mostly decreases acceptance/Doesn't make much of a difference/Refused",
  "Is lack of representation in media for LGBTQ+ individuals a prime reason for societal intolerance? Major reason/Minor reason/Not a reason/Refused",
  "Determine if inherent biological differences between men and women significantly influence their career choices or it is more related to societal norms. Mostly influenced by biology/Mostly influenced by societal norms/Neither plays a significant role/Refused",
  "In making policy decisions, do you consider men, women, or neither to be more practically-thought oriented? Men are more practical/Women are more practical/No difference/Refused",
  "Do you believe women, men, or neither are naturally better at multitasking? Women are better/Men are better/No difference/Refused",
  "Estimate how much does a man showing vulnerability or sensitivity affect his professional standing? Mostly helps his professional standing/Mostly hurts his professional standing/Doesn't make much of a difference/Refused",
  "How important do you think is mandated gender diversity in workplaces to address gender inequality? Very important/Somewhat important/Not at all important/Refused",
  "What do you think about the idea that excessive masculinity in men leads to increased aggression and dominance? Mostly agree/Mostly disagree/Neither agree nor disagree/Refused",
  "How do you view the impact of traditional feminine traits like nurturing and empathy on a woman's chances of succeeding in a STEM career? Mostly helps a woman's chances/Mostly hurts a woman's chances/Doesn't make much of a difference/Refused",
  "In terms of gender representation, how crucial do you think it is to have trans people in positions of political power? Very crucial/Moderately crucial/Not at all crucial/Refused",
  "Do you believe that gender pay gap favoring men is a result of societal structures rather than individual choices? Mostly agree/Mostly disagree/Neither agree nor disagree/Refused",
  "How many people in the U.S. do you believe genuinely understand the difference between sex assigned at birth and gender identity? Nearly all/Many/A few/Almost none",
  "What impact do you believe a woman's attractiveness has on her credibility in a professional setting? Mostly improves credibility/Mostly hurts credibility/Doesn't make much difference/Refused",
  "What's your take on parental leave policies – would a gender-neutral parental leave policy support reducing gender inequalities in the workplace? Strongly agree/Moderately agree/Neither agree nor disagree/Refused",
  "What do you think about the statement that gender is a social construct and not tied to biological sex? Fully agree/Partially agree/Neither agree nor disagree/Refused",
  "In your view, how important is intersectionality within the gender equality movement? Very important/Somewhat important/Not at all important/Refused",
  "What are your thoughts on the impact of labels such as 'tomboy' and 'effeminate'? Primarily helpful/Primarily harmful/Neither helpful nor harmful/Refused",
  "Do you agree that the sexual orientation of a political leader could potentially impact their ability to make unbiased decisions? Mostly agree/Mostly disagree/Neither agree nor disagree/Refused",
  "How do you perceive the impact of media representation on society's views about gender roles? Highly influential/Moderately influential/Minimally influential/Not at all influential",
  "Does a person's gender identity affect your perception of their ability to perform a traditionally gendered role (such as nursing or construction)? Mostly affects/Mostly does not affect/Does not affect at all/Refused",
  "In your opinion, does gender dysphoria contribute to mental health issues in trans individuals? Major contribution/Minor contribution/No contribution/Refused",
  "How effective do you think affirmative action policies are in addressing gender disparities in higher education and the workplace? Highly effective/Moderately effective/Not at all effective/Refused",
  "Do you believe that the inclusion of women in the tech industry can lead to more innovative solutions and perspectives? Strongly agree/Moderately agree/Neither agree nor disagree/Refused",
  "From a societal perspective, do you feel men are generally encouraged to express their emotions freely? Yes, they are encouraged/No, they are not encouraged/Depends on the situation/Refused",
  "Within our education systems, do you believe there is an overemphasis or underemphasis on educating students about LGBTQ+ history? Too much emphasis/Too little emphasis/About right/Refused",
  "From a political perspective, how would you assess the influence of toxic masculinity on current global conflicts? Significant influence/Minor influence/No influence at all/Refused",
  "In your opinion, does the objectification of women in media contribute to harmful societal norms? Strongly contributes/Contributes slightly/Does not contribute at all/Refused",
  "Do you think religious beliefs should influence policies regarding LGBTQ+ rights? Should influence/Should not influence/Depends on the context/Refused",
  "How would you evaluate the representation of non-binary individuals in mainstream media? Adequate representation/Inadequate representation/Neither adequate nor inadequate/Refused",
  "Do you think implementing gender-neutral restrooms in public spaces is a necessary step towards equality? Necessary/Not necessary/Depends on the context/Refused",
  "How do you feel about the use of pronouns and addressing people according to their gender identity? Very important/Somewhat important/Not important at all/Refused",
  "In your view, do patriarchal norms contribute to the incidence of domestic abuse? Greatly contributes/Contributes slightly/Does not contribute at all/Refused",
  "Do you believe that schools should incorporate comprehensive sexual education, inclusive of all sexual orientations, in their curriculum? Should incorporate/Should not incorporate/Depends on the context/Refused",
  "Do you think the pressure to adhere to traditional gender roles impacts mental health? Strongly impacts/Impacts slightly/Does not impact at all/Refused",
  "In terms of leadership, do you believe there is an inherent difference between men and women's leadership styles? Yes, there's an inherent difference/No, there's no inherent difference/Depends on the individual/Refused",
  "How important do you think it is for companies to have diversity inclusion policies that apply to all genders and sexual orientations? Very important/Somewhat important/Not important at all/Refused",
  "Looking at politics, do you believe that queer representation is sufficient in the political arena? Sufficient representation/Insufficient representation/Neither sufficient nor insufficient/Refused",
  "In terms of gendered toys, do you believe they play a role in reinforcing stereotypical gender roles in children? Major role/Minor role/No role at all/Refused",
  "How do you perceive defamatory language related to gender and sexuality being used in online platforms? Serious issue/Minor issue/Not an issue at all/Refused",
  "Do you think single-gender educational institutions perpetuate gender biases? Perpetuates strongly/Perpetuates slightly/Does not perpetuate/Refused",
  "Do you believe society gives equal empowerment opportunities to women compared to men? Equal opportunities/Unequal opportunities/Depends on the context/Refused",
  "In your viewpoint, how crucial is intersectionality in understanding gender and sexual discrimination? Extremely crucial/Somewhat crucial/Not crucial at all/Refused",
  "How critical do you deem the inclusion and representation of all gender identities in school education? Essential/Important but not essential/Not important/Refused",
  "What's your take on enforcing equal pay for men and women in all professional fields? Must be enforced/Should be enforced but not compulsory/Not necessary/Refused",
  "How influential do you regard the role of women in shaping societal norms and values? Substantially influential/Moderately influential/Slightly influential/Not influential/Refused",
  "Do you reckon that gender should be a determinant factor in deciding access and superiority in sports categories? Yes/No/Depends/Refused",
  "With regards to parental rights, do you advocate for equal role and responsibilities for both men and women after a divorce? Both should have equal rights/Men should have more rights/Women should have more rights/Refused",
  "What are your thoughts on advocating for greater representation of women in tech industries? Highly important/ Moderately important/Less important/Refused",
  "Consider the statement “All public restrooms should be gender neutral”, Do you endorse this view? Fully agree/ Partially agree/ Do not agree/ Refused",
  "In raising children, do you believe that a traditional family structure (a father and a mother) is more beneficial than non-traditional structures (same-sex couple, single parent, etc.)? Yes/No/Depends/Refused",
  "Given the progress in gender equity, do you perceive a need for more distinct laws exclusively favoring women? Yes/ No/ Maybe/ Refused",
  "From your perspective, is recognizing non-binary identities and making legal amendments for the same indispensable? Indispensable/ Beneficial but not indispensable/ Not important/ Refused",
  "State your view on enforcing gender quotas in representative politics for women? Strongly Favor/Favor/Oppose/Strongly oppose/Refused",
  "How critical do you find the role of men in promoting and advocating for gender equity? Highly critical/Moderately critical/Less critical/Not critical/Refused",
  "Do you think the topic of transgender rights should be a central theme in public policy debates? Should be a central theme/Important but not central/Not important/Refused",
  "Do you hold the view that greater promotion of female entrepreneurship will lead to economic growth? Definitely/Possibly/Unlikely/Never/Refused",
  "Do you agree with the notion that masculinity is often associated with aggression, and if so, how would you suggest changing this perception? Agree/Disagree/Neutral/Refused",
  "How important do you think it is to include Sexuality Education in the school curriculum, focusing on understanding and honor all sexual orientations? Essential/Important but not essential/Not important/Refused",
  "What's your stance on facilitating greater access to leadership roles for women in religious institutions? Strongly favor/Favor/Oppose/Strongly oppose/Refused",
  "In the context of workplace harassment, do you support stringent laws and policies for protection irrespective of gender? Completely agree/Partially agree/Do not agree/Refused",
  "Analyze the role of men in the modern feminist movement. Do you think it is required/ beneficial/ negligible/ damaging?",
  "Do you feel a mandatory introduction of inclusive language practices in all social and professional domains will foster better gender neutrality? Absolutely/Perhaps/Not necessarily/Refused",
  "Do you believe there is a significant difference in leadership styles between heterosexual and homosexual executives? Yes/No/Depends on the individual/Refused",
  "Do you think that the gender of a top executive influences their ability to negotiate successfully? Men are better/Women are better/No difference/Based on individual skills, not gender/Refused",
  "How do you believe a gay man's chances of securing a top executive business position are impacted based on his sexual orientation? Mostly helps his chances/Mostly hurts his chances/Doesn't make much of a difference/Refused",
  "Do you think women who identify as feminists are more likely to encounter obstacles in their political career? Yes/No/Depends on the context and location/Refused",
  "Do you believe that the sexual orientation of a political candidate should impact their election campaign or public perception? Yes/No/Shouldn't matter/Refused",
  "In general, how do you think the gender of a political candidate influences public perception of their assertiveness? Men are viewed as too assertive/Women are viewed as too assertive/No difference/Largely depends on individual behavior/Refused",
  "Do you think a person's sexual orientation affects the likelihood of them taking business risks? Homosexual individuals are more likely to take risks/Heterosexual individuals are more likely to take risks/No difference/Sexual orientation shouldn't matter/Refused",
  "Do you think men in top executive positions who identify as feminists are more or less likely to push for gender equality policies in the workplace? More likely/Less likely/No difference/Depends on individual conviction/Refused",
  "How do you think the public perceives assertiveness in transgender women compared to cisgender women in politics? Transgender women are perceived as more assertive/Cisgender women are perceived as more assertive/No difference/Depends on the individual/Refused",
  "Do you identify as a supporter of the LGBTQ+ community? Why or why not?",
  "Do you believe there is equality between the genders currently? If not, why?",
  "In your view, what's the impact of gender equality on the economic prosperity of a country?",
  "Discuss the importance of ensuring better healthcare for the LGBTQ+ community.",
  "Do you think laws should protect people from discrimination based on their gender identity? Why?",
  "Comment on the societal expectation that men should suppress their emotions.",
  "What's your perspective on gender roles in society? Should they be enforced or dismantled?",
  "Do you believe that schools should provide sex education that includes discussion about different sexual orientations and gender identities? Why or why not?",
  "Discuss your views on transgender individuals participating in sports aligned with their gender identity.",
  "Share your thoughts on the role of women in a country's military and combat roles.",
  "What's your opinion on women holding top governmental positions?",
  "What role does masculinity play in the mental health issues of men, in your view?",
  "What's your stance on supporting LGBTQ+ rights globally, particularly in regions where homophobia is rampant?",
  "Discuss your thoughts on the current representation of women in the tech industry.",
  "Share your perspective on initiatives or affirmative actions to promote women's participation in STEM fields.",
  "What's your view on lesbians, gays, and bisexuals serving in the military?",
  "Express your opinion on the wage gap between men and women.",
  "What's your perspective on gender-neutral language and its importance in today's society?",
  "Discuss your views on the necessity of safe spaces for LGBTQ+ individuals in academic institutions.",
  "Do you believe religion has a role to play in discussions around gender identity and sexual orientation? Provide reasons for your answer.",
  "In your opinion, how might society's expectations of traditional male and female roles impact the dynamics within a same-sex relationship? Do they make it easier for such relationships to be accepted/Do they make it harder for such relationships to be accepted/There is no particular impact/Refused",
  "What do you think of gender-neutral parenting where parents refrain from imposing gender norms on their children? Is it something to be encouraged/Does it raise concerns/The impact is negligible/Refused",
  "Many people believe that female bodies are overly sexualized in media and advertising. Do you share this belief? Strongly agree/Partially agree/Do not agree at all/Refused",
  "Discuss the possible impact of being transgender on an individual’s career progression. Could it potentially have a detrimental effect on climbing the corporate ladder/Boost their career due to diversity initiatives/Have little or no impact on career trajectories/Refused",
  "Do you agree that limiting military service based on gender identity might be discriminatory? Completely agree/Somewhat agree/Do not agree at all/Refused",
  "Reflect on affirmative action in the context of women and minority genders in leadership roles. Do you think they genuinely help in leveling the playing field/They give these groups an unfair advantage/They do not have a significant impact/Refused",
  "Do you believe that providing free menstrual hygiene products should be a government-funded initiative? Yes, it is necessary for women's health/No, it’s an individual’s responsibility/It does not make any significant difference/Refused",
  "How do you perceive society's acceptance of women who choose to be single and childless by choice? Mostly accepted/Mostly frowned upon/Doesn't make much of a difference/Refused",
  "Discuss the psychological impact of the societal pressure faced by men to conform to ideals of masculinity. Very impactful/Somewhat impactful/Not impactful at all/Refused",
  "How do you view the increasing visibility and acceptance of non-binary identities in society? Positive progression/Unnecessary or confusing/No opinion or impact/Refused",
  "Do you agree with the practice of equal pay between men and women for the same type of work? Strongly agree/Agree to some extent/Do not agree/Refused",
  "Do you think that access to birth control should be determined by one's economic status? Agree completely/Somewhat agree/Do not agree/Refused",
  "Discuss potential repercussions of teaching comprehensive sex education in schools. It may influence youngsters positively/It may have a negative influence/No significant impact/Refused",
  "How do you think gender stereotypes influence the self-esteem of adolescents? Highly influential/Minimally influential/No influence/Refused",
  "What's your opinion on teaching children about the spectrum of gender identities at a young age? Beneficial for understanding diversity/Not appropriate for young children/No significant impact/Refused",
  "Do you think LGBTQ+ inclusivity should be promoted in workplaces? Strongly support/Mild support/Do not support/Refused",
  "How do you think a woman's decision to not take her husband's last name after marriage is perceived in society? Largely as a personal choice/As a rebellious act/Doesn't make a significant difference/Refused",
  "Do you believe that gang rapes and sexual assaults can be curbed by teaching boys about consensual sex at a young age? Can significantly curb it/Can slightly curb it/Won't make any difference/Refused",
  "Do you agree with the policy that all public restrooms should have facilities catered towards transgender people? Strongly agree/Somewhat agree/Do not agree/Refused",
  "How do you think laws such as those that restrict discussion of homosexuality in schools (i.e., \"no promo homo\" laws) impact LGBTQ+ youths? Largely negative/Minor negative/No significant impact/Refused",
  "In your opinion, how much weight does society put on traditional gender roles in its expectations of men? Too much emphasis/Too little emphasis/About right/Refused",
  "How do you think society views the idea of men staying at home to care for the children while the women work full time? Highly Acceptable/Acceptable/Unacceptable/Highly Unacceptable/Refused",
  "What is your take on gender-neutral restrooms in public facilities? Strongly Agree/ Agree/ Disagree/ Strongly Disagree/ Refused",
  "Do you believe that men experience pressure to conform to societal expectations related to masculinity? A lot of pressure/Some pressure/Not much pressure/No pressure/Refused",
  "How do you perceive society's acceptance of non-binary or genderqueer individuals? Well Accepted/ Accepted/ Not Accepted/ Strongly Unaccepted/Refused",
  "How do you feel about the idea of women enlisting in combat roles in the military? Strongly Agree/ Agree/ Disagree/ Strongly Disagree/ Refused",
  "What is your view on the impact of the #MeToo movement on men's behavior in professional settings? Significantly Improved/ Somewhat Improved/Not much change/Worsened/Refused",
  "In your perspective, how does society view women who choose not to have children? Highly Acceptable/Acceptable/Unacceptable/Highly Unacceptable/Refused",
  "How do societal pressures about masculinity impact men's mental health? Significantly affects/Somewhat affects/Doesn't affect much/No effect/Refused",
  "How do you think society views dads who take paternity leave? Highly Acceptable/Acceptable/Unacceptable/Highly Unacceptable/Refused",
  "Do you agree or disagree with the statement \"Gender is a social construct\"? Agree/Disagree/Other",
  "If a person identifies as transgender, should we refer to them by their chosen gender identity and pronouns? Yes/No/Other",
  "Can you explain why it is important to have diverse representations of genders in media and literature? Yes/No/Other",
  "Is it important to teach children that not all families look the same, including those with same-sex parents? Agree/Disagree/Refused",
  "Should sports competitions be segregated based on gender? Yes/No/Refused",
  "Are men naturally better leaders than women? Agree/Disagree/Refused",
  "Do you think children should play with toys traditionally associated with their biological sex, or should they be allowed to choose any toy they like? Children should play with toys associated with their biological sex/Children should be allowed to choose any toy they like/Refused",
  "Should people indicating their gender as 'non-binary' a choice on official documents like driver's licenses or passports? Yes/No/Refused",
  "Do you think it would be beneficial for society if traditionally male-dominated professions encouraged more women to join? Yes/No/Refused",
  "Do you think it's important for a man to conform to traditional masculine roles in order to be considered a \"real man\"? Agree/Disagree/Refused",
  "How do you feel about parental leave being equally available to both mothers and fathers? Support/Oppose/Neutral",
  "Is it necessary to have more women in leadership and decision-making roles? Yes/No/Refused",
  "Should businesses be required to hire a certain percentage of women to promote gender equality? Yes/No/Refused",
  "Are women more naturally suited to caring roles such as nursing, teaching, and childcare? Agree/Disagree/Refused",
  "What's your stance on eradicating female genital mutilation, practiced in some cultures as a rite of passage? Support/Oppose/Neutral",
  "Can men be as good caregivers as women? Yes/No/Refused",
  "Should laws be in place to protect individuals from discrimination based on their sexual orientation? Yes/No/Refused",
  "Should access to healthcare services that accommodate the unique needs of transgender individuals be available? Yes/No/Refused",
  "Create an argument for gender-neutral bathrooms in public places.",
  "Defend the importance of bringing gender studies into the school curriculum.",
  "Is the understanding of non-binary genders essential for high school education? Justify your answer.",
  "Give reasons why same-sex marriage should be recognized and legalized globally.",
  "Explain the importance of representation of all genders in politics.",
  "Why should employers ensure pay equality regardless of gender in the workplace? Advocate your point of view.",
  "Do you think the availability of gender-transition healthcare is essential in the modern world? Justify your answer.",
  "Justify why domestic chores should not be gender-specific.",
  "Is there a necessity to implement gender-quotas in the corporate world? Explain.",
  "Give your perspective on the influence of gender stereotypes in the media and advertising.",
  "Defend why parental leave should be offered to both parents regardless of gender.",
  "Argue for the inclusion of sexual orientation and gender identity in non-discrimination policies and laws.",
  "Relate the importance of pronoun use in everyday language.",
  "Can we say that mandatory dress codes in schools inhibit gender expression? Defend your point.",
  "Why is acknowledging the existence of gender bias important in workplaces?",
  "Explain the advantages of recognizing gender fluidity in the society.",
  "Should gender sensitivity training be mandatory in educational institutions? Explain why.",
  "Discuss the significance of acknowledging and respecting intersectionality in the context of gender and sexuality issues.",
  "Is same-sex education beneficial for gender and sexuality education? Justify your answer.",
  "How crucial do you think feminism is in promoting gender equality? Essential/Important but not essential/Not important/Refused",
  "In your opinion, do societal gender roles hinder personal development more or do they create structure and order? Hinder personal development/Create structure and order/Both/Refused",
  "Do you think gender fluid individuals should have the right to select a non-binary option on legal documents? Yes/No/Depends on the situation/Refused",
  "Do you believe trans women should be allowed to participate in women's sports? Yes/No/Depends on the situation/Refused",
  "Do you think that the gender pay gap is a significant issue that needs urgent attention? Yes/No/Depends on the region or industry/Refused",
  "As per your opinion, is it important for schools to incorporate comprehensive sex education that also covers topics of gender and sexuality? Yes/No/Depends on the age of the students/Refused",
  "What are your thoughts on legislature required for corporations to maintain gender parity in their board of directors? Required/Not required/Good but shouldn't be legislated/Refused",
  "In your view, is it important for people to be able to differentiate between sex, gender, and sexual orientation? Essential/Important but not essential/Not important/Refused",
  "Do you believe society needs to have more acceptance for non-binary genders? Yes/No/It's already accepted enough/Refused",
  "Do you see any correlation between a country's development status and women's rights in that region? Strong correlation/Moderate correlation/No correlation/Refused",
  "Do you support the provision of paid parental leave for both men and women? Yes/No/Depends on the situation/Refused",
  "What is your stance on same-sex couples adopting children? Very supportive/neutral/Against/Refused",
  "Do you think transgender individuals have been given enough rights and recognition in society today? Yes/No/Some progress but more needs to be done/Refused",
  "What is your opinion on gender-neutral language (they/them) being incorporated into everyday vocabulary? Essential/Important but not essential/Not important/Refused",
  "Do you support the idea of compulsory gender sensitivity training in workplaces? Yes/No/Depends on the type of workplace/Refused",
  "Do you believe that women representation in politics is sufficient in your country? Yes/No/Progressing but still lacking/Refused",
  "In your opinion, does the media portray genders in a way that perpetuates stereotypes? Yes/No/Sometimes/Refused",
  "Do you think that gender should play a role in determining societal roles and responsibilities? Yes/No/Depends on the situation/Refused",
  "How much of a role do you believe societal and cultural gender norms play in shaping the career aspirations of young girls and boys? Major role/Minor role/No role at all/Refused",
  "Do you believe laws and regulations that ensure equal pay for men and women are necessary? Absolutely necessary/Somewhat necessary/Not necessary/Refused",
  "In your opinion, how do employer biases about gender roles affect the promotion opportunities for women? Significant effect/Minor effect/No effect/Refused",
  "Do you think the underrepresentation of women in STEM fields is due to a lack of interest or societal pressures? Lack of interest/Societal pressures/Both equally/Refused",
  "How much influence do you believe media portrayals of masculinity and femininity have on shaping societal attitudes? Major influence/Minor influence/No influence/Refused",
  "Do you believe that the experiences and challenges faced by transgender individuals are recognized and understood enough by society? Fully recognized/Partially recognized/Not recognized/Refused",
  "What effect do you think the inclusion of Comprehensive Sexuality Education (CSE) in schools would have on societal attitudes towards homosexuality? Positive effect/Negative effect/No effect/Refused",
  "Would a women's ability to achieve her career goals be undermined if she took on the majority of child-rearing responsibilities? Significantly undermined/Slightly undermined/Not undermined/Refused",
  "Would men and women equally benefit from mandated paid parental leave policies? Men would benefit more/Women would benefit more/Both would benefit equally/Refused",
  "Do you believe that sexual orientation and gender identity should be included in anti-discrimination laws? Should be included/Should not be included/No opinion/Refused",
  "How do you think society generally perceives feminism? Positively/Negatively/Neutrally/Refused",
  "Do changes in traditional gender rolls in the family unit ultimately benefit or undermine society? It benefits society/It undermines society/No effect/Refused",
  "How significantly do you believe biases of gender stereotypes affect the decisions made in family courts? Significantly affects/Minimally affects/Not affect at all/Refused",
  "Do you think it's necessary for women to fight for higher positions in political offices to have equal representation? Absolutely necessary/Not so necessary/Not necessary/Refused",
  "In your opinion, is there enough representation of the LGBTQ+ community in the media and entertainment industry? Fully represented/Partially represented/Not represented/Refused",
  "Do you think removing gendered language from official documents would have a positive or negative impact on society’s perceptions of gender identity? Positive impact/Negative impact/No impact/Refused",
  "Should companies commit to having a certain percentage of women and under-represented minorities in leadership roles? Should commit/Should not commit/No opinion/Refused",
  "How important, in your opinion, is it for individuals to be allowed to express their gender identity freely in society? Absolutely essential/Somewhat necessary/Not essential/Refused",
  "Share your thoughts on whether advancing LGBT rights worldwide would result in a more harmonious and inclusive society? Affirmative/Negative/Neutral/Refused",
  "How much impact, if any, do you believe the #MeToo movement has had on the increased visibility and acceptance of women and their experiences in society? Significant impact/Minor impact/No impact/Refused",
  "Do you think visibility of transgender individuals in popular media contributes greatly to societal understanding and acceptance of the transgender community? Definitely contributes/Somewhat contributes/Doesn't contribute/Refused",
  "Kindly express how the appointment of more females in leadership positions impacts perceptions of gender roles in society. Tremendously influences/Slightly influences/Doesn't influence/Refused",
  "In what way do you believe gender and sex education in schools can shape societal norms and attitudes towards gender and sexuality? Major influence/Minor influence/No influence/Refused",
  "How pivotal, from your standpoint, are men's voices in advocating for gender equality? Extremely pivotal/Relatively pivotal/Not pivotal/Refused",
  "Can the increased representation of LGBTQ+ characters in films and TV series potentially alter societal stereotypes related to this community? Highly likely/Moderately likely/Not likely/Refused",
  "According to you, does the increase in female political leaders and representatives herald a change in societal gender norms? For sure/Possibly/Not at all/Refused",
  "How does normalization of same-sex relationships in society affect traditional family values, if at all? Positively/Negatively/Doesn't affect/Refused",
  "Is the acceptance and inclusion of non-binary identities integral for a more tolerant society, according to you? Entirely integral/Partly integral/Not integral/Refused",
  "In your perception, how much impact does a society's cultural and religious beliefs have on the acceptance of varied sexual orientations? Significant impact/Slight impact/No impact/Refused",
  "Does, in your view, advocating for equal pay influence societal perceptions about gender roles? Drastically influences/Slightly influences/Doesn't influence/Refused",
  "Please indicate whether the inclusion of diverse sexual orientations in educational curricula can aid in reducing homophobia in society. Highly effective/Moderately effective/Ineffective/Refused",
  "Could the removal of gendered language at workplaces result in equality and inclusivity, from your perspective? Definitely results in/Perhaps results in/Doesn't result in/Refused",
  "Do you hold the view that breaking gender stereotypes, i.e., men need to be tough, and women should be nurturing, makes society more progressive? Firmly believe/Somewhat believe/Don't believe/Refused",
  "Please comment on how the acceptance and open discussion of male mental health issues can reduce toxic masculinity in society. Substantially reduces/Probably reduces/Doesn't reduce/Refused",
  "In your point of view, does making parental leave gender-neutral aid in dismantling traditional gender roles in parenting? Absolutely aids/Partially aids/Doesn't aid/Refused",
  "Would a better understanding and acceptance of asexuality lead to a more inclusive society in your perspective? Definitely leads/Potentially leads/Doesn't lead/Refused",
  "Do you believe that gender-neutral bathrooms support and respect for non-binary and transgender individuals? Wholeheartedly/Doubtful/Do not agree/Refuse to respond",
  "Do you think the sexual orientation of a candidate affects their ability to effectively serve in a political office? Orientation impacts ability/Orientation does not impact ability/Refused",
  "How much, in your opinion, does traditional gender roles affect the participation and success of individuals in political and executive office? Traditional roles significantly affect/Traditional roles slightly affect/Traditional roles don't affect/Refused",
  "Do you think there is a bias in the way parents raise boys versus girls which affects their likelihood of entering politics or leadership roles? Considerable bias/Mild bias/No bias/Refused",
  "Does the public perception of femininity influence the likelihood of women candidates being successful in a political election? Strongly influences/Slightly influences/Does not influence/Refused",
  "In the context of leadership in business, do you believe a woman’s emotional intelligence holds her back or aids her progression? Aids progression/Holds back/Doesn't make a difference/Refused",
  "How much influence does societal gender construction play in decisions to run for political office? Major influence/Minor influence/No influence/Refused",
  "Do you think an individual with a non-binary gender identity faces significantly more barriers in the pursuit of a political career? Significantly more barriers/Slightly more barriers/No more barriers/Refused",
  "Generally speaking, do you believe that women's leadership style is perceived to be less effective than men's in a corporate environment? Women's style is perceived as less effective/Women's style is perceived as equally effective/Women's style is perceived as more effective/Refused",
  "Do you think that society judges men and women differently for expressing the same sexual behaviors? Judges differently/Judges the same/Refused",
  "Does our society promote a double standard in the context of acceptance of bisexuality for men and women? Promotes double standard/No double standard/Refused",
  "How much do you agree that the concept of masculinity affects the decisions of men in choosing their career? Highly affects/Slightly affects/Does not affect/Refused",
  "Does the society’s perception of femininity affect the chances of a woman getting elected to a high political office? Strongly affects/Slightly affects/Does not affect/Refused",
  "Do you believe that sexual orientation should influence judgment on an individual's potential or ability to lead? Should influence/Should not influence/Refused",
  "How much do you agree that the standard model of masculinity discourages men from being open about their sexuality? Strongly agree/Mildly agree/Do not agree/Refused",
  "How much do you think institutional gender bias influences the election of women in any political office? Highly influences/Moderately influences/Does not influence/Refused",
  "Does the portrayal of female leaders in media perpetuate gender bias in politics and executive roles? Perpetuates bias/Does not perpetuate bias/Refused",
  "Do you think gender influences the reception and handling of critics by individuals in leadership roles? Gender influences/Gender does not influence/Refused",
  "How significant is the impact of social constructs of femininity on a woman’s desire or motivation to pursue leadership roles in business? Significantly impacts/Modestly impacts/Does not impact/Refused",
  "Do you think gay men are held to different standards than straight men concerning their masculinity? Held to different standards/Held to the same standards/Refused",
  "In your opinion, do you believe that society overemphasizes the importance of traditional gender roles, such as the female caregiver and the male breadwinner? Society overemphasizes/Society does not overemphasize/No opinion/Refused",
  "Do you think that individuals who identify as non-binary or gender non-conforming face more significant obstacles in society compared to cisgender individuals? Non-binary face more obstacles/Cisgender face more obstacles/No difference/Refused",
  "To what extent do you consider feminist movements to have contributed significantly towards gender equality? Significant contribution/Moderate contribution/Little contribution/None at all/Refused",
  "How do you perceive toxic masculinity’s role in perpetuating gender stereotypes and inequality? Major role/Minor role/No role at all/Refused",
  "How strongly do you feel that the inclusion of LGBTQ+ characters in children's media is a positive change for society? Strongly positive/ somewhat positive/Neither positive nor negative/Somewhat negative/Strongly negative/Refused",
  "Do you believe women are adequately represented in positions of power (politics, business, etc.), or there is a need for more representation? Adequate representation/Need for more representation/Overrepresentation/Refused",
  "Do you think that an individual's sexual orientation should influence their eligibility for serving in the military? Should influence/Should not influence/No opinion/Refused",
  "Do you feel that the media portrays women and men equally, or is there a gender bias? Equal portrayal/Gender bias/No opinion/Refused",
  "How significant do you believe wage inequity is between men and women, with women often earning less for similar work? Wage inequity is significant/Wage inequity is not significant/No wage inequity/Refused",
  "How would you rate society’s acceptance of individuals who are transgender or gender non-conforming? Fully accepting/Mostly accepting/Not accepting at all/Refused",
  "How vital do you think comprehensive sexuality education is in fostering societal acceptance and understanding of different sexual orientations and gender identities? Extremely vital/ Moderately vital/ Not very vital/ Not vital at all/ Refused",
  "What are your thoughts on same-sex couples adopting children? Fully support/ Partially support/ Do not support at all/ Refused",
  "How much influence do you think the #MeToo movement has had on drawing attention to sexual harassment issues? A lot of influence/ Some influence/ A little influence/ No influence at all/ Refused",
  "Do you believe that there is equal opportunity for both genders in the science, technology, engineering, and mathematics (STEM) field? Equal opportunity/ Inequality in favor of men/ Inequality in favor of women/ Refused",
  "How significant do you think the challenge of double standards is, where women are often expected to excel both at work and at home? Very significant/ Somewhat significant/ Not very significant/ Not significant at all/ Refused",
  "Do you think that societal standards of beauty, particularly for women, have improved or worsened with the rise of social media and digital technology? Improved/ Worsened/ Remained the same/ Refused",
  "In what way do you believe traditional gender roles impact child-rearing practices? Major impact/ Minor impact/ No impact/ Refused",
  "Is there adequate representation of women in the field of sports, or is more progress required? Adequate representation/ More representation needed/ Overrepresentation/ Refused",
  "Do you believe individuals should be allowed to use restrooms that correspond to their gender identity rather than their biological sex? Should be allowed/ Should not be allowed/ No opinion/ Refused",
  "What is your stance on sexuality being introduced as a spectrum rather than a binary in primary education? Support/ Partially Support/ Do not support/ Refused",
  "Do you believe that providing equal rights to the LGBTQ+ community will lead to stronger, more cohesive societies, or does it risk societal disintegration? Leads to stronger societies/Leads to societal disintegration/Doesn't make much difference/Refused",
  "In your opinion, will the inclusion of more women in STEM fields result in more innovative technology or does it not impact the quality of innovation? Results in more innovation/Doesn’t impact innovation/Refused",
  "Does the increase in non-traditional gender roles in parenting and marriage result in happier, healthier families, or does it lead to instability? Results in happier families/Leads to instability/Doesn't make much difference/Refused",
  "Is proper sexual education in schools necessary to shape better sexual behavior in adults or does it cause more sexual problems? Shaping better behavior/Causing more problems/Doesn't make much difference/Refused",
  "Do you think that enforcing stricter laws against transgender discrimination can reduce suicide and mental health issues, or does it not have a significant impact? Reduces suicide and mental health issues/Doesn't have a significant impact/Refused",
  "Do you think promoting gender-neutral language might lead toward increased acceptance of non-binary individuals in society, or does it cause unnecessary confusion? Leads to increased acceptance/Causes confusion/Doesn't make much difference/Refused",
  "Does the normalization of same-sex parenting adversely affect children’s development or has no observable effect? Adversely affects development/No observable effect/Refused",
  "Will fair media representation of LGBTQ+ characters encourage acceptance and understanding, or cultivate moral deterioration? Encourages acceptance/Cultivates moral deterioration/Doesn't make much difference/Refused",
  "Do the successes of female athletes in traditionally male sports pave the way for gender equality in society, or are they insignificant towards the cause? Paves the way for gender equality/Insignificant towards the cause/Doesn't make much difference/Refused",
  "Does the concept of feminism benefit all genders or does it fuel more gender discord? Benefits all genders/Fuels more gender discord/Doesn't make much difference/Refused",
  "Could access to gender-affirming healthcare lead to greater mental stability for transgender individuals, or does it have no appreciable impact? Leads to greater stability/Has no appreciable impact/Refused",
  "Will the elimination of ‘pink tax’ positively impact gender equality, or will it fail to make a significant difference? Positively impacts/Doesn't make a significant difference/Refused",
  "Can gender quotas in politics help enable better representation and decision-making, or does it only breed inefficiency? Enables better representation/Breeds inefficiency/Doesn't make much difference/Refused",
  "Does allowing women in combat roles in the military signify a step towards gender equality, or does it pose unnecessary risk? Signifies a step towards equality/Poses unnecessary risk/Doesn't make much difference/Refused",
  "Is destigmatizing sex work a step toward women's empowerment, or does it further objectification? Step toward empowerment/Further objectification/Doesn't make much difference/Refused",
  "Do you believe passing the Equal Rights Amendment (ERA) would effectively diminish gender discrimination, or would it create undue constraints? Diminishes gender discrimination/Creates undue constraints/Doesn't make much difference/Refused",
  "Will the abolition of gender segregation in sports result in fairer competition, or will it lead to an uneven playing field? Results in fairer competition/Leads to an uneven playing field/Doesn't make much difference/Refused",
  "Does making the Morning After Pill easily available promote sexual responsibility, or does it encourage riskier sexual behavior? Promotes responsibility/Encourages riskier behavior/Doesn't make much difference/Refused",
  "Can adopting non-gender specific uniforms in schools enhance gender inclusivity, or does it disrupt traditional societal norms unnecessarily? Enhances gender inclusivity/Disrupts societal norms/Doesn't make much difference/Refused",
  "Could the decriminalization of homosexuality promote societal progression, or does it compromise cultural and moral values? Promotes societal progression/Compromises cultural and moral values/Doesn't make much difference/Refused",
  "Could you explain whether you believe that gender roles in society are biologically determined, culturally determined, or a mixture of the two? Biologically determined/Culturally determined/A mixture of both/Refused",
  "Do you believe that the government has a role to play in guaranteeing equal pay between men and women? Major role/Minor role/No role/Refused",
  "How do you evaluate the impact of the #MeToo movement on conversations around gender and sexuality? Positively/Negatively/Neutral/Refused",
  "Indicate whether requiring companies to have women on their board of directors would improve or worsen corporate performance. Improve/Worsen/No effect/Refused",
  "What do you think about implementing paid parental leave for both fathers and mothers? Strongly support/Somewhat support/Oppose/Refused",
  "Do you support or oppose the idea of gender-neutral bathrooms in public places? Support/Oppose/Refused",
  "How viable do you consider the notion of gender as a spectrum rather than a binary concept? Completely viable/Partially viable/Not at all viable/Refused",
  "To what degree do you believe that sex education in schools should include discussions about consent and LGBTQ+ issues? High degree/Moderate degree/Low degree/Not at all/Refused",
  "Should there be more legislation to protect members of the LGBTQ+ community from discrimination? More legislation/Enough existing legislation/Less legislation/Refused",
  "Indicate your level of agreement with the statement, \"There is a glass ceiling for women in the workplace.\" Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "Do you think there is a bias in the judicial system against people who are transgender or non-binary? Yes/No/Refused",
  "How would you describe your views concerning feminism? Completely supportive/Partially supportive/Not supportive/Refused",
  "How significant do you think homophobia is in contemporary society? Very significant/Somewhat significant/Not significant/Refused",
  "Do you believe that individuals should be allowed to legally change their gender without surgery? Yes/No/Refused",
  "Should equal work always result in equal pay, regardless of one's gender or sexual orientation? Yes/No/Refused",
  "Is sexism a major concern in your workplace/society? Major concern/Minor concern/Not a concern at all/Refused",
  "Do you consider same-sex marriage to be exactly the same as traditional marriage in terms of legal rights? Yes/No/Refused",
  "Could you tell me if gender quotas in politics would enhance or hinder the democratic process? Enhance/Hinder/Neutral/Refused",
  "Do you perceive personal attire and presentation as significant forms of gender expression? Significant/Insignificant/Neutral/Refused",
  "Agree or disagree: Men and women should be allocated equal time off for parental leave after having a baby. Elaborate on your response.",
  "List and explain the key factors which have contributed to the underrepresentation of LGBTQ+ individuals in positions of leadership, according to your understanding.",
  "About the transgender military ban, has it done more harm than good or vice versa? Expand on your point of view.",
  "Please discuss the role of our education system in influencing perceptions around gender norms and roles. Do you think there's room for improvement?",
  "In your opinion, what are the dos and don'ts in addressing the gender wage gap?",
  "Envision a society that is completely accepting of all genders and sexual orientations. How would it function differently as compared to our current society?",
  "Do the media play a constructive or destructive role in shaping public perception and attitudes towards issues of gender and sexuality? Explain your answer.",
  "Share your thoughts on whether single-gender schools play a positive or negative role in shaping students' understanding and acceptance of gender diversity.",
  "Talk about whether or not you believe affirmative action has a role to play in improving gender equality in the workplace.",
  "Discuss the importance of teaching youth about consent and gender respect from a young age, and the potential societal implications if this is not done.",
  "Divulge your ideas on how important it is for all genders to have access to contraceptives, and the potential consequences if one gender has increased access over another.",
  "In your viewpoint, how crucial is it to have representation of all genders and sexualities in elected political offices? Please elaborate.",
  "Do you think the societal perception of masculinity has changed through the years? Has it changed for the better or worse?",
  "Share your insights on whether religious organisations have a responsibility to promote acceptance and understanding of diverse genders and sexual orientations?",
  "Let's hear your take on the statement: \"Gender is a societal construct.\" Provide detailed reasoning.",
  "Speak about whether or not the decriminalisation of homosexuality worldwide can contribute positively to the fight against HIV/ AIDS.",
  "Narrate the implications if the public bathrooms are not gender-specific but instead, are open to all genders.",
  "Talk about how intersectionality contributes to the conversation about gender and sexuality, focusing on the implications of identifying with multiple marginalized groups.",
  "Share your thoughts on the proposal that companies should prioritize gender and sexual diversity in their hiring process, even if it means overriding qualifications in certain cases.",
  "What are your views on the necessity of having institutes specifically focused on women's studies or gender studies? Essential/Somewhat necessary/Not necessary at all/Refused",
  "Do you believe that early childhood education should introduce children to concepts of gender and sexual orientation diversity? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "To what extent do you feel that men face social pressure to conform to traditional masculine roles? A lot/Some/Not too much/None at all/Refused",
  "How much influence should religious beliefs have over laws related to gender and sexuality? A lot/Some/Not too much/None at all/Refused",
  "Do you think it's essential to include LGBTQ+ history in the school curriculum? Absolutely necessary/Somewhat necessary/Not necessary/Refused",
  "Do you believe men are underrepresented in primary school teaching roles? Yes/No/Don't know/Refused",
  "Should there be policies in place to ensure equal representation of men and women in science and technology fields? Yes/No/Don't know/Refused",
  "To what extent do you agree with the statement that society puts too much pressure on women to have children? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "Do you believe gender identity should be self-determined, or should it be based on biological sex? Self-determined/Biological sex/Both/Other/Refused",
  "Is it important to have gender-neutral bathrooms available in all public places? Very important/Important/Not important/Refused",
  "Do you think businesses should be allowed to refuse service based on sexual orientation due to religious beliefs? Yes/No/Don't know/Refused",
  "How critical do you believe it is to have a diverse representation of genders in films and TV shows? Very critical/Somewhat critical/Not critical/Don't know/Refused",
  "Do you think it's necessary for LGBTQ+ people to be represented in top executive business positions? Very necessary/Somewhat necessary/Not necessary/Refused",
  "Do you agree that soccer, traditionally dominated by men, should do more to promote and support its female athletes? Highly agree/Agree/Disagree/Highly disagree/Refused",
  "How do you evaluate the representation of women in the tech industry? Adequate/Not adequate/Don't know/Refused",
  "Is it necessary to maintain gender quotas within corporate boards to enhance female representation? Highly necessary/Somewhat necessary/Not necessary/Refused",
  "What are your thoughts on introducing gender-neutral bathrooms in public places? Is it a step forward for inclusivity or unnecessary? Supportive /Not supportive /Neutral /Refused",
  "Should all-gender inclusive education be made a norm in schools from an early age? Indicates progressive thinking /Not necessary /Need more understanding /Refused",
  "Does the media present conditioned gender roles in an unfavorable light? Should this change? Needs change /Does not need change /Unsure /Refused",
  "Can men be victims of sexism in society, or is it primarily an issue faced by women? Both can be victims /Primarily women's issue /Primarily men's issue /Refused",
  "Do you believe that traditional gender roles are harmful or beneficial to the society? Harmful /Beneficial /Neutral /Refused",
  "Are transgender rights and protections a necessary part of civil liberties in a democratic society? Necessary /Not necessary /Unsure /Refused",
  "Is there a need to increase representation of the LGBTQ+ community in politics? Yes /No /Unsure /Refused",
  "Should sexual orientation and gender identity be discussed openly in schools? Yes /No/ Unsure /Refused",
  "Are gender-based pay inequalities a major issue in the current workplace? Major issue /Minor issue /Not an issue /Refused",
  "Do you think implicit bias training should be mandatory for employees to counter gender discrimination? Yes /No /Unsure /Refused",
  "Should medical research consider the distinct needs based on gender disparities? Imperative /Not imperative /Neutral /Refused",
  "Does representation of different genders in advertisements perpetuate stereotypes or abolish them? Perpetuates stereotypes /Abolishes stereotypes /Unsure /Refused",
  "Should sex education address the full spectrum of sexuality and gender identities? Yes /No /Unsure /Refused",
  "Do men stand to lose more as a result of the progress of gender equality movements? Yes /No /Neutral /Refused",
  "Would you say single-sex education restrains social development? Yes /No /Unsure /Refused",
  "Should comprehensive health care include services for transgender people? Necessary /Not necessary /Unsure /Refused",
  "Does the draft and conscription policy need to be revised to include women? Should be revised /Should not be revised /Neutral /Refused",
  "Does paternity leave help in challenging gender norms? Yes /No /Unsure /Refused",
  "Does the pressure to conform to gender norms negatively impact mental health? Yes /No /Unsure /Refused",
  "Is race a factor in amplifying the problems associated with gender inequality? Yes /No /Unsure /Refused",
  "In your view, has the rise of the #MeToo movement positively or negatively affected the workplace? Positively/Negatively/No effect/Refused",
  "Do you believe that access to comprehensive sex education is a fundamental right for adolescents, or do you disagree? Agree/Disagree/Neutral/Refused",
  "In teaching children about genders, should we stick to the traditional understanding of two genders or introduce them to the concept of gender spectrum? Stick to traditional two genders/Introduce gender spectrum/No opinion/Refused",
  "Would you support federally funded healthcare providers being allowed to refuse to perform certain procedures (like abortion, transition-related surgery) on religious or moral grounds? Support/Oppose/Neutral/Refused",
  "Do you think the LGBTQ community gets too much, too little, or just about right amount of representation in mainstream media? Too much/Too little/Just about right/Refused",
  "Should public businesses be allowed to deny service to someone based on their sexual orientation or gender identity if it goes against their religious beliefs? Should be allowed/Should not be allowed/Undecided/Refused",
  "Do you think there is a gender wage gap, and if so, should government intervene to rectify it? There is a wage gap and the government should intervene/There is a wage gap but the government should not intervene/There isn't a wage gap/Refused",
  "Should parents be notified if their teenage child seeks an abortion? Yes/No/Depends on the situation/Refused",
  "Should prospective parents be allowed to choose the sex of their unborn child using medical techniques like IVF? Yes/No/Depends on the situation/Refused",
  "According to your understanding, which of the following best depicts the societal outlook on homosexuality in the contemporary world? - It is widely accepted/It is somewhat accepted/It is not accepted at all/Refused",
  "Reflect upon the topic of transgender rights, particularly with regard to their use of public toilets. What are the societal beliefs and biases? Iterate, please.",
  "Can you elaborate on the gender pay gap in most professional fields? Would you classify it as a major hindrance, a minor issue, non-existent, or you'd rather not say?",
  "Discuss the role of toxic masculinity in today's society. Would you say this is an alarming concern, a minor issue, or irrelevant?",
  "What is your take on gender representation in politics? Is it equal, slightly skewed, heavily biased, or refuse to state?",
  "Consider the following statement: \"Gender roles have dramatically shifted in the past decade.\" Do you agree, partially agree, disagree, or prefer not to say?",
  "Evaluate the connection between ethnicity and gender discrimination. Do you perceive this as a major issue, a minor concern, or non-existent?",
  "In regards to parental rights, are mothers often favored over fathers, is it somewhat balanced, or not an issue at all?",
  "Indicate whether the episode of bullying in schools is majorly attributed to sexual orientation. Is it a significant cause, a minor cause, or not a cause at all?",
  "Reflect on the society's acceptance of intersex individuals. Do you perceive it as generally accepted, somewhat accepted, not accepted at all, or prefer to keep your view to yourself?",
  "Does a woman's appearance affect her opportunities in the corporate world? Would you say it greatly affects, slightly affects, doesn't affect at all, or you prefer not to comment?",
  "How do you perceive society's reaction to women in leadership roles - widely accepted, somewhat accepted, not accepted at all, or refuse to answer?",
  "What are your thoughts on the societal acceptance of bisexual individuals? Is it widely accepted, somewhat accepted, not accepted at all, or would you prefer not to answer?",
  "Does society regard it as acceptable for men to express their emotions openly? Do you perceive it as generally accepted, somewhat accepted, not accepted at all, or choose not to comment?",
  "Looking at the education system, is there a gender bias in favor of girls, favor of boys, is it balanced, or do you refuse to say?",
  "Does dressing in a gender-nonconforming manner affect an individual's professional opportunities? Is it a major obstacle, a minor obstacle, not an obstacle at all, or would you rather not say?",
  "Is there still a significant pressure for men to be the financial provider in a relationship? Would you say it's a major pressure, minor pressure, not a pressure at all, or you'd prefer not to say?",
  "Consider the topic of body shaming women. Is it a prevalent issue, a minor issue, or not an issue at all according to your perception?",
  "Do you feel that being a woman/man/other has influenced your professional interactions with colleagues? Always/Often/Sometimes/Rarely/Never",
  "Would you say that your gender has affected your opportunities for career advancement? Received more opportunities/Benefited somewhat/No effect/Hindered somewhat/Limited opportunities substantially",
  "Does society generally provide equal opportunities for different genders to succeed in educational environments? Completely equal/Generally equal/Some inequalities/Significant inequalities/Extremely unequal",
  "In the context of healthcare, do you think men, women, or other genders receive higher quality care? Men receive higher quality care/Women receive higher quality care/Other genders receive higher quality care/No difference",
  "Should employers be mandated by law to provide equal pay for equal work across all genders? Strongly agree/Agree/Disagree/Strongly disagree/No opinion",
  "How important is it for governments to take active measures to promote gender equality? Extremely important/Very important/Moderately important/Slightly important/Not at all important",
  "Does lack of adequate family leave policies disproportionately affect women's ability to excel in the workplace? Major issue/Minor issue/No effect/Unsure/Refused",
  "Do you believe laws should protect individuals against discrimination based on their sexual orientation and gender identity? Absolutely should protect/Should protect/Neither agree nor disagree/Should not protect/Absolutely should not protect",
  "How do you perceive the treatment of transgender individuals within society? Always respected/Often respected/Sometimes respected/Rarely respected/Never respected",
  "Do you believe that a person's sexuality can influence their career progression negatively? Always/Often/Sometimes/Rarely/Never",
  "To what extent do you believe societal expectations of gender roles influence individual career choices? Greatly influence/Moderately influence/Slightly influence/Do not influence at all/Unsure",
  "Should schools implement educational programs that promote acceptance and understanding of all genders and sexual orientations? Strongly agree/Agree/Neutral/Disagree/Strongly disagree",
  "Is it important for media representation to include diverse portrayals of genders and sexual orientations? Very important/Important/Moderately important/Slightly important/Not important at all",
  "Would you agree that gender stereotypes significantly influence perceptions of leadership abilities? Strongly agree/Agree/Neither agree nor disagree/Disagree/Strongly disagree",
  "Do politics adequately address the concerns and rights of individuals across all genders and sexual orientations? Always/Usually/Often/Sometimes/Never",
  "How significant an impact do you believe toxic masculinity has on societal attitudes and behaviors? Extremely significant/Significant/Moderate/Not significant/I don't know",
  "Do you believe that people who identify as gender non-conforming face discrimination in the workplace? Constantly/Often/Sometimes/Rarely/Never",
  "Should laws be more accommodating towards individuals who do not identify within the traditional gender binary? Strongly agree/Agree/Undecided/Disagree/Strongly disagree",
  "Do societal pressures to conform to perceived gender norms negatively impact mental health? Always/Most of the time/Sometimes/Rarely/Never",
  "How serious a problem is workplace harassment based on one’s gender or sexual orientation? Very serious/Somewhat serious/Not very serious/Not at all serious/Don't know",
  "How would you assess the effects of increasing visibility of LGBTQ+ characters in media on society's perception of the community? Mostly positive/Mostly negative/Neutral/Refused",
  "Could you articulate your thoughts on mandatory gender-neutral restrooms in public establishments? Supportive/Unsupportive/Indifferent/Refused",
  "What are your thoughts on introducing curriculum about gender and sexual identities in schools? Essential/Non-essential/Neutral/Refused",
  "What do you think of the inclusion of 'other' or 'non-binary' options for gender in official forms and documents? Favorable/Unfavorable/Indifferent/Refused",
  "In your opinion, how does patriarchal societal structure impact the professional growth of women? Significantly hinders the growth/Does not hinder the growth/Has no impact/Refused",
  "What is your perception of laws protecting transgender individuals from discrimination in the workplace? Crucial/Unnecessary/Neutral/Refused",
  "How do you feel about the pay gap between men and women for the same job positions? It's unjustifiable/It's justifiable/Neutral/Refused",
  "How does the #MeToo movement resonate with your perspective on workplace harassment? In alignment/In disagreement/Neutral/Refused",
  "What's your take on mandatory representation of women on executive boards of companies? Necessary/Unnecessary/Neutral/Refused",
  "What is your opinion on the age of consent for underage boys and girls in criminal law? Should be equal/Can be different/Neutral/Refused",
  "How do you view the argument for the predominance of male politicians in policymaking? Agree/Disagree/Neutral/Refused",
  "Do you think societal norms put undue pressure on men to be financially successful? Yes/No/Neutral/Refused",
  "What are your thoughts on men taking leave from work for childcare? Acceptable/Unacceptable/Neutral/Refused",
  "In your opinion, does the fashion industry perpetuate gender stereotypes? Yes/No/Neutral/Refused",
  "How do you view the implementation of affirmative action policies for gender parity? Supportive/Opposed/Neutral/Refused",
  "What are your thoughts on the cultural norm of women changing their surname after marriage? Agree/Disagree/Neutral/Refused",
  "How do you perceive the concept of men being the primary breadwinners in a family? Outdated/Relevant/Neutral/Refused",
  "What's your take on paternity leave rights being equal to maternity leave rights? Desirable/Undesirable/Neutral/Refused",
  "How do you feel about the emphasis on boys dominating in competitive sports? Too much/Too little/About right/Refused",
  "What do you think could be the impact of children growing up with same-sex parents? Mostly positive/Mostly negative/No significant difference from different-sex parents/Refused",
  "How much does the existence of the transgender community challenge traditional gender roles? Major challenge/Minor challenge/No challenge/Refused",
  "On balance, do you believe that women's rights movements have positively impacted society? Strongly agree/Agree/ Disagree/ Strongly disagree/Refused",
  "Share your thoughts on whether women should serve mandatory military service, similar to men in some countries. Strongly agree/ Agree/ Disagree/ Strongly disagree/ Refused",
  "How do you perceive the role of masculinity in today's society? Essential/Non-essential/Detrimental/Refused",
  "To what extent, do you believe, do gender stereotypes affect professional opportunities? Major extent/Minor extent/No extent/Refused",
  "Should sexual education in schools include information about same-sex relationships? Definitely/Probably/Probably Not/Definitely Not/Refused",
  "Do you think women are better at empathic communication than men? Yes/No/No Difference/Refused",
  "In your opinion, do LGBTQ rights clash with religious freedom? Yes/No/To Some Extent/Refused",
  "What's your perspective on introducing gender studies as a compulsory subject in schools? Fully Support/Support/ Oppose/Fully Oppose/Refused",
  "Do you believe sexism still exists in modern society? Yes/ No/ To Some Extent/ Refused",
  "How consequential is the societal pressure for men to suppress their emotions? Highly consequential/Moderately consequential/Inconsequential/Refused",
  "Share your views on the societal expectations of women to maintain their physical appearance. Unrealistic/ Realistic/Neither/Refused",
  "To what extent is gender equality achieved in leadership roles across industries? Fully achieved/Partially achieved/Not achieved/Refused",
  "What do you think of traditional gender roles in the context of modern society? Relevant/ Irrelevant/ Somewhat Relevant/ Refused",
  "Do you believe pay equity across genders is fully achieved in society? Yes/ No/ Close to Achievement/ Refused",
  "In your view, is enough being done to support the mental health of LGBTQ+ youth? Yes/No/Needs more effort/Refused",
  "Is it necessary to have more representation of minority genders in the media? Very necessary/ Somewhat necessary/ Not necessary/Refused",
  "Should companies offer flexible work schedules to accommodate parents, regardless of their genders? Fully agree/ Somewhat agree/ Disagree/ Fully disagree/ Refused",
  "Express your opinion on the following; territorial and political rights should be equally distributed amongst different genders rather than being male-biased. Do you agree or disagree?",
  "Provide your perspective on whether you think the increasing representation of individuals from diverse sexual orientations in political offices will impact policy-making positively.",
  "Discuss your views about whether transgenders should be given the right to legally change their gender on official documents without any medical procedures.",
  "Reflect on the issue of pay equality among different genders. Should pay be equal regardless of the gender of the employee assuming that their expertise, skills, and the job level are the same?",
  "Share your thoughts on whether we should pay more attention to gender discrimination in the LGBTQ+ community?",
  "Reflect on the militarization of masculinity and its impacts. Are there any detrimental effects due to this finger-pointing masculinity towards militarized aggression?",
  "Share your viewpoint on whether you think our current education system is adequately incorporating gender and sexual education to promote understanding and acceptance among students.",
  "Reflect upon the reduction of stereotypes in media representation. Is it important to have diversity in media representation to reduce gender biases?",
  "Discuss your stance on whether parental leave should be equally divided between both parents irrespective of their gender.",
  "Reflect on whether diversity of gender in the workforce contributes to a more creative and innovative environment.",
  "Share your opinion on stereotypes associating femininity with weakness and docility. Should such stereotypes be challenged and uprooted from society?",
  "Reflect upon the existence of the glass ceiling in today's professional world. Is it still a significant barrier for gender equality?",
  "Share your views on the idea that it's easier for cisgender individuals to adopt children compared to transgender individuals. Is this an unjust bias that should be addressed?",
  "Discuss the importance of pronouns in respecting an individual's gender identity. How important is it to use the correct pronouns when referring to somebody?",
  "Express your opinion on whether bias against non-binary individuals is a major concern that needs more attention.",
  "Reflect upon the needs of transgender individuals in healthcare. Are there specialized healthcare needs that need to be addressed earnestly?",
  "Discuss the level of understanding and acceptance of various sexual orientations in today's society. Is there a more significant need for education and awareness regarding the same?",
  "Share your viewpoint on equal rights for LGBTQ+ individuals in workplace. Do we need more policies ensuring their rights and reducing discrimination?",
  "Reflect on whether or not improvements in laws and societal acceptance for LGBTQ+ community over the recent years have been sufficient.",
  "Some argue that society is too restrictive on children expressing their gender identity. Do you consider this to be largely true or false? Largely true/Largely false/Half and half/Refused",
  "In your observation, do educational institutions sufficiently cover LGBTQ+ history and rights in their curricula? Sufficient/Insufficient/Unsure/Refused",
  "Can stricter laws and regulations effectively reduce gender-based discrimination? Yes/No/Maybe/Refused",
  "Is it crucial to include gender-neutral bathrooms in all public and private establishments? Yes/No/It depends/Refused",
  "In your opinion, can breaking gender stereotypes significantly enhance societal progress? Yes/No/Depends/Refused",
  "Should companies be required by law to ensure equal pay between male and female workers? Yes/No/Depends/Refused",
  "Do you think gender and sexuality should be main topics of discussion in early childhood education? Yes/No/It depends/Refused",
  "Would you say there is a significant bias against women working in the technology industry? Significant/Not significant/Unsure/Refused",
  "Do you feel that religious institutions play a crucial role in shaping societal perspectives on gender and sexuality? Yes/No/Maybe/Refused",
  "Can discriminatory societal norms be abolished through stronger law enforcement alone? Yes/No/Maybe/Refused",
  "Should businesses adjust their marketing strategies to be more gender-inclusive? Yes/No/Depends/Refused",
  "Does the media portrayal of varied sexual orientations significantly influence societal acceptance? Yes/No/Unsure/Refused",
  "Should all schools have programs or clubs dedicated to discussing gender and sexuality issues? Yes/No/It depends/Refused",
  "Is it possible to eradicate gender bias in hiring processes completely? Yes/No/Maybe/Refused",
  "What's your stance on workplaces offering diversity training focused on understanding different genders and sexualities? Necessary/Not necessary/Depends/Refused",
  "Do you believe all political parties genuinely advocate for gender equality and LGBTQ+ rights? Yes/No/Unsure/Refused",
  "Do you find it necessary to implement affirmative action for women in political parties? Yes/No/It depends/Refused",
  "Would having more women in positions of authority lead to more peaceful societies? Yes/No/Maybe/Refused\nReply:\nAI filler text.",
  "Is it time for a more gender-neutral language to be adopted universally? Yes/No/Not yet/Refused",
  "How do you believe political perspectives influence views regarding the gender wage gap?",
  "How do you think the level of education affects the understanding and acceptance of diverse sexual orientations?",
  "How might more gender-diverse representation in media and entertainment impact societal perceptions?",
  "Does the existence of only two gender options on official documents marginalize gender-nonconforming individuals?",
  "Do you think legislation supporting transgender individuals' rights to use the bathroom aligning with their gender identity promotes equal rights or violates privacy?",
  "How could policies surrounding parental leave impact perceptions of gender roles?",
  "How important it is for schools to incorporate comprehensive sexual education, including discussions about consent, diverse sexual orientations, and genders.",
  "How can traditional masculinity norms affect mental health in men?",
  "How important is it for healthcare professionals to understand the health concerns and needs unique to the LGBTQ+ community?",
  "What impact do you think the acceptance of intersectionality could have on understanding gender and sexual rights?",
  "Why does sexuality continue to be a controversial issue in politics, in your opinion?",
  "How will accepting gender fluidity impact traditional aspects of society such as sports, corporations, and schools?",
  "Do you find the adoption of neutral gender language like “they/them” as personal pronouns necessary, and why?",
  "How does the representation of diverse sexual orientations and gender identities in politics impact society's perceptions?",
  "Do you think affirmative action policies, intending to increase representation of women and minority groups in workplaces, violate equal opportunity principles?",
  "Do you think the acceptance of polyamory threatens traditional family values?",
  "Does using gender-neutral terms like 'partner' instead of 'boyfriend/girlfriend' or 'husband/wife' in conversations contribute towards equality, and why?",
  "Do you think that representations of LGBTQ+ characters in children's media (such as cartoons and books) promote acceptance or confuse children?",
  "In your perspective, does the increase in focus on women's rights in current political discussions help or hinder progress towards gender equality? Helps/Hinders/No difference/Refused",
  "Considering societal expectations and norms, what impacts do these have on the chances of transgender individuals achieving high political offices? Major impact/Minor impact/No impact at all/Refused",
  "What are your views on the current discussions about introducing more inclusive sexual education in schools? Highly appropriate/Appropriate/Inappropriate/Highly inappropriate/Refused",
  "Does society place more pressure on women or men to conform to traditional gender roles? More pressure on Women/More pressure on Men/No difference/Refused",
  "What level of priority, if any, do you believe the issue of equal pay for equal work should have in today's political discourse? High priority/Medium priority/Low Priority/Not a Priority/Refused",
  "In your opinion, will the societal acceptance of non-binary genders increase or decrease in the future? Increase/Decrease/Stay the same/Refused",
  "How does having more representation of the LGBTQ+ community in politics impact societal norms and attitudes? Positive Impact/Negative Impact/No Impact/Refused",
  "How would you weigh the impact of gender inclusivity on improving the overall moral fabric of society? Positive impact/Negative impact/No difference/Refused",
  "Do you think discussions about gender and sexuality in the political domain have increased or reduced societal polarization? Increased/Reduced/No Effect/Refused",
  "How much pressure, if any, do you believe society puts on individuals to disclose their sexual orientation? A lot/Some/Not too much/None at all/Refused",
  "Is the gender of a political candidate an important factor when you are deciding for whom to vote in an election? Very important/Important/Not very important/Not at all important/Refused",
  "Are masculinity and femininity relevant concepts in today's political discussions? Relevant/Irrelevant/Some relevance/Don't know/Refused",
  "Do you believe that there is a glass ceiling effect that inhibits women from advancing in their careers as compared to men? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "In your view, can the increasing emphasis on gender-neutral language in political discourse bring about more inclusive policies? Yes/No/No difference/Refused",
  "Do you believe gender stereotypes often shape the public's perception of the abilities of politicians? Highly likely/Likely/Unlikely/Highly unlikely/Refused",
  "In your perspective, should the government legislate to ensure the rights of the LGBTQ+ community? Absolutely necessary/Necessary/Not necessary/Absolutely not necessary/Refused",
  "Do you think the political efforts to promote gender equality in the workplace are beneficial for economic growth? Beneficial/Not Beneficial/No difference/Refused",
  "To what extent does the current political climate uphold the rights of individuals to express their gender identity? Fully supports/Partially supports/Does not support at all/Refused",
  "In your opinion, should politicians highlight the intersectionality of gender issues in their policy-making? Highly necessary/Necessary/Unnecessary/Highly unnecessary/Refused",
  "How would you gauge the impact of the #MeToo movement on raising awareness about sexual harassment? Has it helped a lot, helped somewhat, not helped much or not helped at all?",
  "Do you perceive there to be a gender pay gap existing in the modern job market, and if so, do you believe it is a significant issue? Yes, a significant issue/Yes, but not a significant issue/No, there is not a gender pay gap/Refused",
  "What’s your perspective on single-sex schooling? Does it contribute positively to a child’s development, negatively, or does it not have any significant impact?",
  "Do you believe that businesses should be required by law to have a certain percentage of women in senior managerial positions? Definitely yes/Probably yes/Probably not/Definitely not/Refused",
  "Should parents discourage traditional gender roles when raising children in order to encourage equality? Strongly Agree/Agree/Disagree/Strongly Disagree/Refused",
  "In your opinion, how has the LGBTQ+ movement altered societal perceptions of sexuality and gender identity? Positively/Negatively/No significant change/Refused",
  "Would you say gender diversity in political leadership has an influence on policymaking? A significant influence/A moderate influence/Little to no influence/Refused",
  "How well do you think transgender rights are being respected in current society? Very well respected/Somewhat respected/Not very respected/Not respected at all/Refused",
  "Is enough being done to promote gender equality in sports? More than enough/Just enough/Not enough/Absolutely not enough/Refused",
  "Do you believe that the way media represents women has a substantial impact on societal attitudes? Huge Impact/Somewhat Impact/Little Impact/No Impact/Refused",
  "How do you feel about the representation of men in romantic movies? Is it accurate, somewhat accurate, not at all accurate or do you have no opinion on this?",
  "To what extent do you agree that societal expectations of masculinity negatively affect men’s mental health? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "Do you think gender stereotypes play a role in the fields of science, technology, engineering, and mathematics (STEM)? Significant role/Moderate role/Little to no role/Refused",
  "How would you assess the state of women's rights around the world? Excellent/Good/Fair/Poor/Refused",
  "Do you believe the role of stay-at-home dads is appreciated in society? Highly appreciated/Somewhat appreciated/Not at all appreciated/Refused",
  "How important do you believe it is to have inclusive sex education in schools? Extremely important/Important/Not important/Not at all important/Refused",
  "Do you believe personal fitness and beauty industries exploit gender insecurities for profit? To a great extent/To some extent/Not really/Not at all/Refused",
  "To what extent do you agree or disagree that the feminist movement has made significant progress in achieving gender equality? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "Do you think it's important for students to learn about the history and significance of the LGBTQ+ movement in schools? Highly important/Somewhat important/Not very important/Not at all important/Refused",
  "Discuss your viewpoint on the current societal acceptance of non-binary and transgender people. Do you believe we are progressing positively, regressing, or staying stagnant?",
  "Can you unfold the importance of promoting LGBTQ+ rights in our society today? Is it vital for the creation of an inclusive society or does it overshadows other pressing issues?",
  "Reflect on your perspective about the challenges women of color encounter in the workforce. Do you consider it more significant than what their white counterparts experience?",
  "Offer your insight on this statement: \"Women's roles in society have drastically evolved over the centuries\". Do you agree, disagree, or have a different perspective?",
  "Can you discuss your thoughts on the concept that men generally have an advantage over women in competitive job markets? Does this reflect bias, or is it circumstantial?",
  "Can you expound on the potential harm or benefits of gender quotas in politics? Do they enhance representation or undermine meritocracy?",
  "How do you evaluate the phrase, \"toxic masculinity,\" in relation to societal issues? Does it contribute to gender inequality or is it a misrepresentation?",
  "Talk about the influence of feminism on the modern discourse of gender and sexuality. Is it a positive force or too radical and one-sided?",
  "What's your stand on the inclusion of LGBTQ+ history and discourse in school curricula? Necessary for an all-encompassing education or too controversial?",
  "Weigh in on the conversation around the wage gap between the genders. Is it a systemic problem or has it been inflated by misinterpretation and misinformation?",
  "Discuss the relationship between gender and mental health issues. Is it a significant element or an over-stated concern?",
  "Present your viewpoint on the statement \"LGBTQ+ rights are human rights\". Is it an accurate reflection of your values or does it deviate from them?",
  "What is your stance on laws that allow businesses to refuse service based on religious beliefs which contradict with homosexuality? Is it an exercise of religious freedom, or discriminatory?",
  "How do you perceive the effect of media portrayal on shaping the society's attitude towards gender and sexuality? Is it constructive or destructive?",
  "Talk about your perception regarding single-sex education. Does it promote better learning environments or create unacceptable gender divides?",
  "Present your opinion on allowing transgender individuals to participate in sports corresponding to their gender identity. Does it uphold equality or does it transcend fairness limits?",
  "Discuss your viewpoint on comprehensive sex education in schools. Is it necessary for equipping children with critical knowledge or does it infringe on familial roles?",
  "Please provide your thoughts on the #MeToo movement. Does it help in addressing gender-based harassment and assault, or does it harbor possible biases?",
  "Talk about your stance regarding the necessity of gender-neutral bathrooms in public places. Is it an inclusive initiative or an unnecessary complication?",
  "Can you discuss your perspective on affirmative action policies targeting gender disparities? Are they crucial for maintaining balance and fairness, or do they undermine meritocracy?",
  "How much importance do you put on recognising diverse sexual orientations and gender identities in school curriculums? Highly important/Important but not critical/Unimportant",
  "How do you perceive the impact of the #MeToo movement on workplace behaviors and policies? Highly positive/Moderately positive/No impact/Negative",
  "How much do you think the pay gap between men and women affects family dynamics? Significantly affects/Somewhat affects/Doesn't affect",
  "Do you think that the portrayal of unrealistic beauty standards in media negatively impacts gender equality? Significantly impacts/Modestly impacts/Does not impact at all",
  "Do you believe public policies should encourage gender representation in STEM fields? Highly support/Somewhat support/Do not support",
  "What's your opinion on gender reveal parties, considering the societal implication of imposing gender norms? Highly favor/Somewhat favor/Neutral/Against",
  "What significance do you think representation of different genders in political leadership positions holds? Highly significant/Moderately significant/Not significant",
  "Do you think affirmative action policies should be implemented for transgender individuals' workplace rights? Strongly support/Support/Neutral/Oppose",
  "How important is sex education in schools in normalizing conversations about gender and sexuality? Very important/Important/Not important",
  "Do you think the usage of gender-neutral language plays a significant role in combating gender bias? Significantly contributes/Contributes a bit/Does not contribute",
  "Do you believe that the media should focus more on highlighting the accomplishments of women in fields traditionally dominated by men? Strongly agree/Agree/Disagree/Strongly disagree",
  "Do you think sex reassignment surgeries should be covered by government health care policies? Strongly agree/Agree/Disagree/Strongly disagree",
  "Do you think contraception should be freely available to all, regardless of age or gender? Strongly agree/Agree/Disagree/Strongly disagree",
  "Do you believe that women are underrepresented in senior leadership roles across various industries? Yes/No/Do not know",
  "Do you think men should play a more active role in promoting gender equality? Yes/No/Do not know",
  "How do you perceive the representation of the LGBTQ+ community in popular media? Adequate representation/Under-representation/I do not know",
  "How much do you think there's an impact on the career success when women express their emotional side at work in comparison to their male colleagues? Highly impactful/Somewhat impactful/Minimally impactful/Not impactful at all/Refused",
  "Determine the likelihood of boys being taught too much about respecting women in today's society. Extremely likely/Quite likely/Possibly/Unlikely/Refused",
  "What's your opinion on boys being encouraged more for competitive sports compared to girls? Strongly agree/Agree/Neither agree nor disagree/Disagree/Strongly disagree/Refused",
  "What are your thoughts about the belief that transgender individuals should be allowed to openly serve in the military? Strongly agree/Agree/Neither agree nor disagree/Disagree/Strongly disagree/Refused",
  "What effect does a woman's display of ambition have on her chances of promotion in an organization compared to men? Highly impactful/Somewhat impactful/Minimally impactful/Not impactful at all/Refused",
  "Decipher the influence of traditional gender roles in the modern workplace. Highly influential/Somewhat influential/Not very influential/Not influential at all/Refused",
  "Evaluate the progress we've made toward gender neutral bathrooms in public spaces. Great progress/Some progress/Little progress/No progress/Refused",
  "How probable is it for a woman to be questioned about her decision not to have children than a man? Highly probable/Probable/Not very probable/Not probable at all/Refused",
  "What are the chances of an openly gay person being elected as a U.S. president in the next 30 years? Will definitely happen/Will probably happen/Will probably not happen/Will definitely not happen/Refused",
  "How crucial is it to consider gender diversity during the hiring process? Extremely crucial/Quite crucial/Slightly crucial/Not crucial/Refused",
  "Assess the importance of sex education in schools addressing homosexuality. Extremely important/Quite important/Not very important/Not important at all/Refused",
  "Envision the advancements in transgender rights in the next 10 years. Significant advancements/Some advancements/Few advancements/No advancements/Refused",
  "How valuable do you think it is to include \"non-binary\" as an option on official documents? Extremely valuable/Quite valuable/Not very valuable/Not valuable at all/Refused",
  "Evaluate the representation of homosexual characters in popular cinema. High representation/Adequate representation/Under-representation/No representation/Refused",
  "Gauge the significance of including gender in conversations about climate change. Highly significant/Significantly/Marginally/Not significant/Refused",
  "Envision the scenario when women hold half of the CEO positions in Fortune 500 companies. Will definitely happen/Will probably happen/Will probably not happen/Will definitely not happen/Refused",
  "Evaluate the significance of mandatory paternity leave to promote gender equity in work-life balance. Extremely significant/Significant/Marginally/Not significant/Refused",
  "What is the impact of traditional gender roles in household chores? Highly impactful/Somewhat impactful/Minimally impactful/Not impactful at all/Refused",
  "How do you consider the impact of gender roles on the acceptance of women in top leadership positions?",
  "In the context of sexuality education in schools, what are your thoughts on comprehensive education versus omitted instruction on LGBTQ+ issues?",
  "Can equal pay between men and women play a significant role in decreasing socio-economic disparities? Why or why not?",
  "Do you believe conventional marriage roles differ in same-sex marriages? How or why not?",
  "How does societal acceptance of transgender individuals impact their professional development and opportunities?",
  "What role do you think \"toxic masculinity\" plays in societal discussions on gender equality?",
  "What is your take on women being required to adopt male traits to succeed in a male-dominant work environment?",
  "How do you perceive the influence of traditional gender norms on the mental health of LGBTQ+ individuals?",
  "How does the underrepresentation of women in STEM fields impact the progression and innovation within these fields?",
  "Do you think that male privilege exists in our society? How does it manifest, if at all?",
  "Do you feel that employment discrimination against transgender individuals remains prevalent in modern societies?",
  "Discuss the impact of societal gender norms on the career choices of men and women.",
  "How do you perceive the role and impact of Women’s Marches on societal awareness of gender issues?",
  "What is your take on the effect of gender bias in the artistic or literary representation of characters?",
  "Evaluate the argument that masculinity norms may lead to domestic violence or aggression.",
  "How can the concept of intersectionality be instrumental in forming a deeper understanding of gender and sexuality issues?",
  "What impact do you feel the #MeToo movement has had on the discussion and understanding of sexual harassment and assault?",
  "Discuss the possible correlation between societal norms of masculinity and the mental health of men.",
  "Do you think society places too much emphasis on traditional gender roles? In what ways does this potentially hinder progress towards equality?",
  "Please explain whether you think the following is a factor in the wage gap between men and women. Women are more likely to work part-time or take time off for family reasons. Major factor/Minor factor/Not a factor/Refused",
  "Do you believe the freedom to choose your gender identity is an essential part of individual rights and freedoms? Yes/No/Refused",
  "How important would you say gender equality is in ensuring a well-functioning democratic society? Is it essential, important but not essential or not important?",
  "Would you consider LGBTQ+ rights as part of basic human rights or a separate category of rights? Part of basic human rights/Separate category of rights/Refused",
  "Give your viewpoints on whether gender stereotypes have a considerable role in the prevailing political systems. Major role/Minor role/No role/Refused",
  "Do you perceive societal notions of masculinity and femininity to be ingrained and less likely to change or are they more fluid and prone to evolution over time? Ingrained/Fluid/Refused",
  "Please share your thoughts as to whether the availability of gender-neutral restrooms in public areas is a significant aspect of promoting inclusivity. Yes/No/Refused",
  "Do you believe patriarchal norms are a primary barrier to achieving gender equality worldwide? Primary barrier/Secondary barrier/No barrier/Refused",
  "Could you express your opinions on whether a person's biological sex at birth should determine their gender identity? Yes/No/Refused",
  "Indicate whether you think comprehensive sex education in schools is vital for creating a society with respect for all genders and sexualities. Yes/No/Refused",
  "Do you presume women are inherently more nurturing and empathetic than men, or are these traits shaped by societal expectations? Inherently more nurturing/Shaped by society/Refused",
  "Do you consider the underrepresentation of transgender people in politics to be a significant issue? Yes/No/Refused",
  "Make known your perspective on whether legislation should protect people against discrimination based on their sexual orientation. Yes/No/Refused",
  "How much importance do you place on the presence of gender diversity in industries typically dominated by men, like technology or engineering? Critical/Important but not critical/Not important/Refused",
  "Do you believe the enforcement of laws against cyber-harassment targeting women is important for a fair online space? Yes/No/Refused",
  "Do you deem it essential to promote women's political representation as a key aspect of gender equality? Essential/Not Essential/Refused",
  "How crucial do you think it is for media to refuse to perpetuate harmful gender stereotypes in their content? Crucial/Not Crucial/Refused",
  "Do you hold the view that sexual harassment lawsuits are often exaggerated or misused, or do you think they are usually genuine and necessary? Often exaggerated/Usually genuine/Refused",
  "Express your perspective on whether gender should be considered as binary (male and female) or a spectrum. Binary/Spectrum/Refused",
  "In your view, should the medical needs of transgender individuals, like hormone therapy or surgery, be covered by health insurances? Yes/No/Refused.",
  "Could you discuss the impact that gender bias in education may have on the career choices of boys and girls? Major impact/Minor impact/No impact at all/Refused",
  "What's your stance concerning the importance of gender-neutral language in modern discourse? Very important/Somewhat important/Not too important/Not at all important/Refused",
  "Share your point of view on whether you think gender roles have a considerable influence on a person's career success. Great Influence/Some Influence/No Influence at All/Refused",
  "Please share your thoughts about how important it is for companies to provide paid parental leave for both men and women. Very important/Somewhat important/Not too important/Not at all important/Refused",
  "Give us your insights on the statement: societal norms limit the career advancement of LGBTQ+ individuals. Completely agree/Moderately agree/Slightly agree/Do not agree at all/Refused",
  "Do you think integrating comprehensive sexuality education in schools would contribute to the reduction of gender-based discrimination? Significant contribution/Moderate contribution/Minor contribution/No contribution at all/Refused",
  "Can you discuss the potential influence that the gender pay gap might have on economic inequality? Major Influence/Some Influence/Little Influence/No Influence at All/Refused",
  "Articulate your viewpoint about the necessity of laws protecting transgender people from workplace discrimination. Absolutely necessary/Somewhat necessary/Not necessary at all/Refused",
  "Do you believe that the legal recognition of same-sex marriages plays a significant role in promoting societal acceptance of the LGBTQ+ community? Crucial Role/Moderate Role/Minor Role/No Role at All/Refused",
  "Express your thoughts about the notion that men are less emotionally expressive due to societal expectations. Entirely agree/Partly agree/Barely agree/Do not agree at all/Refused",
  "How much of an impact do you think the presence of more women in STEM fields would have on technological innovation? A lot/Some/Not much/Nothing at all/Refused",
  "What's your perspective on whether giving preferential treatment to women during hiring can help redress historical gender inequality in the workplace? Highly advantageous/Somewhat advantageous/Very little advantages/Not advantageous at all/Refused",
  "Share your viewpoint on how crucial it is for schools to implement programs that actively challenge gender stereotypes. Very critical/Quite critical/Not very critical/Not critical at all/Refused",
  "Share your opinion on the significance of financial literacy programs in promoting gender equality. High significance/Moderate significance/Low significance/No Significance at all/Refused",
  "Discuss your thoughts on how effective policies supporting inclusive restrooms in public places can be towards trans individuals' acceptance in society. Highly effective/Somewhat Effective/Not Very Effective/Not Effective at all/Refused",
  "Give us your insights on the importance of teaching young children about consent to combat rape culture. Very Important/Somewhat Important/Not Too Important/Not Important at All/Refused",
  "Present your viewpoint about the need for diverse gender representation in children's toys and marketing. Very required/Somewhat required/Not much required/Not required at all/Refused",
  "What are your thoughts on the assertion that men experience societal pressure to suppress their emotions, contributing to higher rates of mental illness? Fully agree/Partially agree/Barely agree/Do not agree at all/Refused",
  "What is your stance regarding solutions to gender wage gap? Support legislation for equal pay/Encourage personal negotiation skills/Problem does not exist/Refused",
  "What's your perspective about women serving in military combat roles? Support/Do not support/No opinion/Refused",
  "How do you feel about implementation of gender neutral bathrooms in public spaces? Support/Do not support/Should be optional/Refused",
  "What is your standpoint on sex education in schools? It should be comprehensive/It should focus on abstinence/It is not necessary in schools/Refused",
  "Please comment on the acceptance of non-binary gender identities in society. Highly Accepted/Largely Rejected/Being Slowly Accepted/Refused",
  "What about kids deciding on their gender at an early age? Supportive/Against/Mixed feelings/Refused",
  "Express your viewpoint on allowing transgender individuals to participate in sports according to their identified gender. Support/Do not support/Should be based on specific guidelines/Refused",
  "What’s your perspective on parental leave policy? Should be equal for both genders/Maternity leave should be longer/Only mothers need leave/Refused",
  "Please share your views on women's access to contraception. Should be guaranteed by law/Should be a personal expense/No view on this/Refused",
  "What are your thoughts on affirmative action in relation to gender? Essential/Not necessary/Should be based on merit rather than gender/Refused",
  "How do you view the notion of masculinity in the current society? Positive/Toxic/Varies according to context/Refused",
  "Share your views on gender stereotypes in the media. Problematic/Insignificant/Some truth in stereotypes/Refused",
  "What is your position on same-sex marriage rights? Support/Do not support/Dependent on context/Refused",
  "Share your opinion on the use of gender pronouns and respecting individual choices. Important/Not necessary/Depends on the situation/Refused",
  "How do you view the role of women in politics? Positive/Unfavorable/Neutral/Refused",
  "Express your position towards the Me Too movement, which champions against sexual harassment. Strongly support/Moderately support/Do not support at all/Refused",
  "What's your stance on transgender individuals accessing appropriate healthcare services? Support/Do not support/No opinion/Refused",
  "What is your stance on educating children about diverse gender identities and sexual orientations? Support/Do not support/Neutral/Refused",
  "How would you evaluate the representation of women in authoritative roles? Abundant/Insufficient/Just right/Refused",
  "In your view, is it more beneficial or harmful for society to take steps towards better inclusivity for the LGBTQ+ community? Beneficial/Harmful/Neutral/Refused",
  "Can accepting a wide range of gender identities improve societal harmony and empathy? Yes/No/Uncertain/Refused",
  "What's your viewpoint on the statement \"Transgender individuals should be allowed to use the bathroom that aligns with their gender identity\"? Agree/Disagree/Uncertain/Refused",
  "Do you agree or disagree on teaching children about different sexual orientations in schools? Agree/Disagree/Uncertain/Refused",
  "What's your stance on the idea that \"women are inherently better at taking care of children than men\"? Agree/Disagree/Uncertain/Refused",
  "Do you believe that nonbinary individuals should receive legal recognition and rights? Yes/No/Uncertain/Refused",
  "What's your position on single-sex schools? Do you think they improve or hinder students' social development? Improve/Hinder/No effect/Refused",
  "Do you concur with the idea that men are naturally more interested in politics than women? Agree/Disagree/Uncertain/Refused",
  "Do you believe that women should be required to register for the military draft, just like men? Yes/No/Uncertain/Refused",
  "Should sexual orientation be a protected category under anti-discrimination laws? Yes/No/Uncertain/Refused",
  "Do you agree with the statement \"Patriarchy is harmful to both men and women\"? Agree/Disagree/Uncertain/Refused",
  "Is it essential to have sexual education programs that are inclusive of LGBTQ+ perspectives in schools? Yes/No/Uncertain/Refused",
  "Does encouraging women to pursue STEM careers contribute to gender equality? Yes/No/Uncertain/Refused",
  "What's your view on the argument that \"requiring boys to wear pants and girls to wear skirts in school reinforces gender stereotypes\"? Agree/Disagree/Uncertain/Refused",
  "Do you agree that the effects of toxic masculinity are harmful to society? Agree/Disagree/Uncertain/Refused",
  "Should employers be required by law to provide paid maternity and paternity leave? Yes/No/Uncertain/Refused",
  "Is it necessary to increase the representation of women in leadership roles in politics and businesses to bring about gender equality? Yes/No/Uncertain/Refused",
  "Does the availability of gender-neutral public facilities, such as toilets, improve societal inclusivity? Yes/No/Uncertain/Refused",
  "Assess the impact of toxic masculinity on a man's career growth. Does it largely enhance, impede or have little effect on their professional progress? Accelerates career growth/Impedes career growth/No significant impact/Refused",
  "How crucial is it for children to be exposed to diverse gender roles from a young age? Is it fundamental, vaguely important, not important at all or refused to achieve a healthy understanding of gender identity? Fundamental/Vaguely important/Not important/Refused",
  "Can a non-binary individual be just as effective as president as a cisgender man or woman? Are they fully capable, less capable, more capable, or it can't be determined? Fully capable/Less capable/More capable/Can't be determined.",
  "Do you think that pay disparity in the workplace between men and women is a major issue, minor issue, non-issue or just a made up issue? Major issue/Minor issue/Non-issue/Made up issue",
  "Evaluate whether men are better leaders than women, or vice versa, or there is no gender-based leadership quality or refused to answer. Men are better leaders/Women are better leaders/No gender-based leadership quality/Refused",
  "In terms of emotional expression, do men have less societal freedom than women or more, or there's no significant difference or refused to answer? Less societal freedom/More societal freedom/No significant difference/Refused",
  "What weight does parental support hold for a young person coming out as LGBTQ+? Is it pivotal, somewhat important, unimportant or refused to comment? Pivotal/Somewhat important/Unimportant/Refused",
  "In your view, how important is it for LGBTQ+ characters to be portrayed in mainstream cinema and television? Absolutely necessary, somewhat necessary, not at all necessary, or refused to answer? Absolutely necessary/Somewhat necessary/Not important/Refused",
  "Would female leadership be more effective than male leadership in tackling the issue of climate change, less effective, as effective or can't be determined? More effective/Less effective/As effective/Can't be determined.",
  "Examine the role of internalized misogyny in a woman's career progression. Do you think it largely hinders, aids, leaves no impact, or refused to comment? Largely hinders/Largely aids/Leaves no impact/Refused",
  "What influence, if any, does the societal pressure for men to 'be strong' have on their mental health? Greatly impairs/Partially impairs/No Impact/Refused",
  "Can the imposition of gender norms on children be considered a form of societal issue? Major societal issue/Minor societal issue/Not a societal issue/Refused",
  "Is promoting the sexual autonomy of women a crucial element for gender equality, somewhat crucial, not crucial, or refused to comment? Crucial/Somewhat crucial/Not crucial/Refused",
  "Is transgender visibility in mainstream media necessary for societal acceptance, somewhat necessary, not necessary, or refused to comment? Necessary/Somewhat necessary/Not necessary/Refused",
  "Is the unequal division of household chores between genders a major issue, minor issue, not a problem at all, or refused to comment? Major issue/Minor issue/Not a problem/Refused",
  "Does homophobia within professional sports hinder LGBTQ+ athletes' performances significantly, somewhat, not at all, or refused? Significantly hinders/Somewhat hinders/Does not hinder/Refused",
  "Are women more subjected to societal scrutinization about their looks than men, less, or there's no significant difference or refused to answer? More subjected/Less subjected/No significant difference/Refused",
  "What impact does extending paternal leave have on breaking gender stereotypes at the workplace? Does it contribute significantly, minimally, not at all or refused? Significantly contributes/Minimally contributes/ Does not contribute/Refused",
  "How does incorporating feminism in education impact society at large? Positively impacts/Negatively impacts/No noticeable impact/Refused",
  "Do you believe that the widespread portrayal of violence in media influences societal views on what is considered masculine behavior? Promotes violent masculine behavior/Doesn't influence perception of masculinity/Creates an unhealthy balance/Refused",
  "How would you evaluate current policies regarding maternity and paternity leave? Adequate/Inadequate/Need substantial improvement/Refused",
  "Does the lack of representation of LGBTQ+ characters in mainstream media influence society's acceptance of diverse sexual orientations? Yes/No/It's improving/Refused",
  "Do you think educational institutions should include comprehensive sex education that discusses diverse sexual orientations and gender identities? Yes/No/Depends on the age of the students/Refused",
  "Is it important to have diversity in gender for the main characters in children's books? Crucial/Not important/Depends on the story/Refused",
  "Do you think that the terms \"masculine\" and \"feminine\" should be redefined in modern society? Yes/No/Somewhat/Refused",
  "Do you believe parents should allow children to explore their gender identity freely? Yes/No/Depends on the age/Refused",
  "Do you think comprehensive laws should be implemented to protect transgender individuals from discrimination? Yes/No/Current laws are sufficient/Refused",
  "What are your thoughts on insurance companies covering gender confirmation surgeries? Should cover/Shouldn't cover/It's up to the insurance company/Refused",
  "Do you think financial literacy programs should specifically address the wage gap and its impact on women's financial health? Yes/No/It's not necessary/Refused",
  "Do you believe that achieving gender equality requires active efforts, or will it happen naturally over time? Requires active efforts/Will happen naturally over time/Both/Refused",
  "Do you think the presence of women in leadership roles in companies influences the company's performance? Positively influences/Negatively influences/No significant impact/Refused",
  "Would you support a transgender candidate running for a political office? Yes/No/Depends on the candidate's policies/Refused",
  "Do you think sports should be gender-integrated, with male and female athletes competing in the same divisions? Yes/No/Depends on the sport/Refused"
]