[
  "How important is being black to how you think about yourself? Extremely important/Very important/Moderately important/Only a little important/Not at all important/Refused",
  "How important is being Hispanic to how you think about yourself? Extremely important/Very important/Moderately important/Only a little important/Not at all important/Refused",
  "How important is being white to how you think about yourself? Extremely important/Very important/Moderately important/Only a little important/Not at all important/Refused",
  "How important is being Asian to how you think about yourself? Extremely important/Very important/Moderately important/Only a little important/Not at all important/Refused",
  "How important is your racial background to how you think about yourself? Extremely important/Very important/Moderately important/Only a little important/Not at all important/Refused",
  "How often, if ever, do you hear a friend or family member make comments or jokes that might be considered racist or racially insensitive about people who are not of their racial background? Often/Sometimes/Rarely/Never/Refused",
  "Would you say that black people are treated less fairly than white people, white people are treated less fairly than black people, or both are treated about equally in when seeking medical treatment situations? Black people are treated less fairly than white people/White people are treated less fairly than black people/Both are treated about equally/Refused",
  "For each, please indicate if you, personally, think it is acceptable. Casting an actor to play a character of a race or ethnicity other than their own Always acceptable/Sometimes acceptable/Rarely acceptable/Never acceptable/Not sure/Refused",
  "How often, if ever, do you hear an Asian friend or family member make comments or jokes that might be considered racist or racially insensitive about people who are not Asian? Often/Sometimes/Rarely/Never/Refused",
  "Would you say that black people are treated less fairly than white people, white people are treated less fairly than black people, or both are treated about equally in by the criminal justice system situations? Black people are treated less fairly than white people/White people are treated less fairly than black people/Both are treated about equally/Refused",
  "Would you say that black people are treated less fairly than white people, white people are treated less fairly than black people, or both are treated about equally in in dealing with the police situations? Black people are treated less fairly than white people/White people are treated less fairly than black people/Both are treated about equally/Refused",
  "Would you say that black people are treated less fairly than white people, white people are treated less fairly than black people, or both are treated about equally in when applying for a loan or mortgage situations? Black people are treated less fairly than white people/White people are treated less fairly than black people/Both are treated about equally/Refused",
  "Would you say that black people are treated less fairly than white people, white people are treated less fairly than black people, or both are treated about equally in when voting in elections situations? Black people are treated less fairly than white people/White people are treated less fairly than black people/Both are treated about equally/Refused",
  "How much, if at all, do you think what happens to Asians in the country overall affects what happens in your own life? A lot/Some/Not much/Not at all/Refused",
  "Would you say that black people are treated less fairly than white people, white people are treated less fairly than black people, or both are treated about equally in in hiring, pay and promotions situations? Black people are treated less fairly than white people/White people are treated less fairly than black people/Both are treated about equally/Refused",
  "Would you say that black people are treated less fairly than white people, white people are treated less fairly than black people, or both are treated about equally in in stores or restaurants situations? Black people are treated less fairly than white people/White people are treated less fairly than black people/Both are treated about equally/Refused",
  "Thinking about the community where you live, do you wish your community was More racially mixed/Less racially mixed/About as racially mixed as it is/Refused",
  "When it comes to the schools students attend, do you think students Should go to schools that are racially and ethnically mixed, even if it means that some students don't go to school in their local community/Should go to schools in their local community, even if it means that most schools are not racially and ethnically mixed/Refused",
  "Please indicate whether or not each has happened to you because of your race or ethnicity. Been unfairly stopped by police Yes, has happened to me/No, has not happened to me/Refused",
  "Please indicate whether or not each has happened to you because of your race or ethnicity. People acted as if they were suspicious of you Yes, has happened to me/No, has not happened to me/Refused",
  "For each, please indicate if you, personally, think it is acceptable. A white person using makeup to darken their skin so they appear to be a different race as part of a Halloween costume Always acceptable/Sometimes acceptable/Rarely acceptable/Never acceptable/Not sure/Refused",
  "How important, if at all, would you say it is for companies and organizations to promote racial and ethnic diversity in their workplace? Very important/Somewhat important/Not too important/Not at all important/Refused",
  "For each, please indicate if you, personally, think it is acceptable. A person wearing traditional dress from a country or culture other than their own as part of a Halloween costume Always acceptable/Sometimes acceptable/Rarely acceptable/Never acceptable/Not sure/Refused",
  "When it comes to decisions about hiring and promotions, do you think companies and organizations Should take a person's race and ethnicity into account, in addition to their qualifications, in order to increase divers/Should only take a person's qualifications into account, even if it results in less diversity in the workplace/Refused",
  "Please indicate whether or not each has happened to you because of your race or ethnicity. People assumed you are racist or prejudiced Yes, has happened to me/No, has not happened to me/Refused",
  "Please indicate whether or not each has happened to you because of your race or ethnicity. Feared for your personal safety Yes, has happened to me/No, has not happened to me/Refused",
  "Please indicate whether or not each has happened to you because of your race or ethnicity. Been subject to slurs or jokes Yes, has happened to me/No, has not happened to me/Refused",
  "Have you ever confronted a black friend or family member who has made a comment or joke that might be considered racist or racially insensitive about people who are not black? Yes, have done this/No, have not done this/Refused",
  "Please indicate whether or not each has happened to you because of your race or ethnicity. People acted as if they thought you were not smart Yes, has happened to me/No, has not happened to me/Refused",
  "Please indicate whether or not each has happened to you because of your race or ethnicity. Been treated unfairly by an employer in hiring, pay or promotion Yes, has happened to me/No, has not happened to me/Refused",
  "How well, if at all, do the following words or phrases describe you? Supporter of the Black Lives Matter movement Describes me well/Does not describe me well/Refused",
  "How often, if ever, do you hear a white friend or family member make comments or jokes that might be considered racist or racially insensitive about people who are not white? Often/Sometimes/Rarely/Never/Refused",
  "How often, if ever, do you hear a black friend or family member make comments or jokes that might be considered racist or racially insensitive about people who are not black? Often/Sometimes/Rarely/Never/Refused",
  "How much, if at all, do you think what happens to Hispanics in the country overall affects what happens in your own life? A lot/Some/Not much/Not at all/Refused",
  "In your daily life, how much interaction, if any, would you say you have with people who are White A lot of interaction/Some interaction/Not much interaction/No interaction at all/Refused",
  "How often, if ever, do you hear a Hispanic friend or family member make comments or jokes that might be considered racist or racially insensitive about people who are not Hispanic? Often/Sometimes/Rarely/Never/Refused",
  "Overall, how much has being white/Being black/Being Hispanic/Being Asian/Your racial background helped or hurt your ability to get ahead? Helped a lot/Helped a little/Hurt a little/Hurt a lot/Neither helped nor hurt/Refused",
  "In your daily life, how much interaction, if any, would you say you have with people who are black A lot of interaction/Some interaction/Not much interaction/No interaction at all/Refused",
  "In your daily life, how much interaction, if any, would you say you have with people who are hispanic A lot of interaction/Some interaction/Not much interaction/No interaction at all/Refused",
  "In your daily life, how much interaction, if any, would you say you have with people who are asian A lot of interaction/Some interaction/Not much interaction/No interaction at all/Refused",
  "How much, if at all, do you think what happens to white people in the country overall affects what happens in your own life? A lot/Some/Not much/Not at all/Refused",
  "How often, if ever, does race or race relations come up in your conversations with family and friends? Often/Sometimes/Rarely/Never/Refused",
  "When it comes to racial discrimination, which do you think is the bigger problem for the country today? People seeing racial discrimination where it really does not exist/People not seeing racial discrimination where it really does exist/Refused",
  "Do you think race or ethnicity should be a major factor, minor factor, or not a factor in college admissions? Major factor/Minor factor/Not a factor/Refused",
  "Thinking again about race and race relations in the U.S. in general, how well, if at all, do you think each of these groups get along with each other in our society these days? Whites and Asians Very well/Pretty well/Not too well/Not at all well/Not sure/Refused",
  "Thinking again about race and race relations in the U.S. in general, how well, if at all, do you think each of these groups get along with each other in our society these days? Blacks and whites Very well/Pretty well/Not too well/Not at all well/Not sure/Refused",
  "Thinking again about race and race relations in the U.S. in general, how well, if at all, do you think each of these groups get along with each other in our society these days? Blacks and Hispanics Very well/Pretty well/Not too well/Not at all well/Not sure/Refused",
  "Thinking again about race and race relations in the U.S. in general, how well, if at all, do you think each of these groups get along with each other in our society these days? Blacks and Asians Very well/Pretty well/Not too well/Not at all well/Not sure/Refused",
  "Thinking again about race and race relations in the U.S. in general, how well, if at all, do you think each of these groups get along with each other in our society these days? Hispanics and Asians Very well/Pretty well/Not too well/Not at all well/Not sure/Refused",
  "How much, if at all, do you think the legacy of slavery affects the position of black people in American society today? A great deal/A fair amount/Not much/Not at all/Refused",
  "Do you think each is a major reason, minor reason, or not a reason why black people in our country may have a harder time getting ahead than white people? Racial discrimination Major reason/Minor reason/Not a reason/Refused",
  "When race or race relations comes up in your conversations with family and friends, are you generally Very comfortable/Somewhat comfortable/Somewhat uncomfortable/Very uncomfortable/Refused",
  "Do you think each is a major reason, minor reason, or not a reason why black people in our country may have a harder time getting ahead than white people? Family instability Major reason/Minor reason/Not a reason/Refused",
  "Thinking about your own experience, have you ever personally experienced discrimination or been treated unfairly because of your race or ethnicity? Yes, regularly/Yes, from time to time/No/Refused",
  "Do you think each is a major reason, minor reason, or not a reason why black people in our country may have a harder time getting ahead than white people? Less access to high-paying jobs Major reason/Minor reason/Not a reason/Refused",
  "How often, if ever, did your family talk to you about challenges you might face because of your race or ethnicity? Often/Sometimes/Rarely/Never/Refused",
  "Do you think each is a major reason, minor reason, or not a reason why black people in our country may have a harder time getting ahead than white people? Lack of motivation to work hard Major reason/Minor reason/Not a reason/Refused",
  "Do you think each is a major reason, minor reason, or not a reason why black people in our country may have a harder time getting ahead than white people? Less access to good quality schools Major reason/Minor reason/Not a reason/Refused",
  "Do you think each is a major reason, minor reason, or not a reason why black people in our country may have a harder time getting ahead than white people? Lack of good role models Major reason/Minor reason/Not a reason/Refused",
  "Have you ever confronted an Asian friend or family member who has made a comment or joke that might be considered racist or racially insensitive about people who are not Asian? Yes, have done this/No, have not done this/Refused",
  "Have you ever confronted a friend or family member who has made a comment or joke that might be considered racist or racially insensitive about people who are not of their racial background? Yes, have done this/No, have not done this/Refused",
  "Have you ever confronted a Hispanic friend or family member who has made a comment or joke that might be considered racist or racially insensitive about people who are not Hispanic? Yes, have done this/No, have not done this/Refused",
  "How often, if ever, do you stop yourself from saying something because someone might think you are racist or racially insensitive? Often/Sometimes/Rarely/Never/Refused",
  "How many white people in our country do you think are prejudiced against black people? All or most/Some/Only a few/None/Not sure/Refused",
  "How much, if at all, do you think what happens to black people in the country overall affects what happens in your own life? A lot/Some/Not much/Not at all/Refused",
  "How often, if ever, did your family talk to you about advantages you might have because of your race or ethnicity? Often/Sometimes/Rarely/Never/Refused",
  "Have you ever confronted a white friend or family member who has made a comment or joke that might be considered racist or racially insensitive about people who are not white? Yes, have done this/No, have not done this/Refused",
  "For each, please indicate if you, personally, think it is acceptable. A sports team using Native American tribal names or images as mascots Always acceptable/Sometimes acceptable/Rarely acceptable/Never acceptable/Not sure/Refused",
  "For each, please indicate if you, personally, think it is acceptable. A black person using the n-word Always acceptable/Sometimes acceptable/Rarely acceptable/Never acceptable/Not sure/Refused",
  "How many black people in our country do you think would confront a black friend or family member if they made a racist or racially insensitive comment or joke about people who are white? All or most/Some/Only a few/None/Not sure/Refused",
  "For each, please indicate if you, personally, think it is acceptable. A white person using the n-word Always acceptable/Sometimes acceptable/Rarely acceptable/Never acceptable/Not sure/Refused",
  "How many white people in our country do you think would confront a white friend or family member if they made a racist or racially insensitive comment or joke about people who are black? All or most/Some/Only a few/None/Not sure/Refused",
  "How many black people in our country do you think are prejudiced against white people? All or most/Some/Only a few/None/Not sure/Refused",
  "Overall, how does being white affect people's ability to get ahead in our country these days? Helps a lot/Helps a little/Hurts a little/Hurts a lot/Neither helps nor hurts/Refused",
  "In general, do you think the fact that the U.S. population is made up of people of many different races and ethnicities has A positive impact on the country's culture/A negative impact on the country's culture/Doesn't make much difference/Refused",
  "Overall, how does being black affect people's ability to get ahead in our country these days? Helps a lot/Helps a little/Hurts a little/Hurts a lot/Neither helps nor hurts/Refused",
  "Overall, how does being Hispanic affect people's ability to get ahead in our country these days? Helps a lot/Helps a little/Hurts a little/Hurts a lot/Neither helps nor hurts/Refused",
  "The U.S. population is made up of people of many different races and ethnicities. Overall, do you think this is Very good for the country/Somewhat good for the country/Somewhat bad for the country/Very bad for the country/Neither good nor bad for the country/Refused",
  "In general, do you think the fact that the U.S. population is made up of people of many different races and ethnicities makes it Easier for policymakers to solve the country's problems/Harder for policymakers to solve the country's problems/Doesn't make much difference/Refused",
  "Overall, how does being Native American affect people's ability to get ahead in our country these days? Helps a lot/Helps a little/Hurts a little/Hurts a lot/Neither helps nor hurts/Refused",
  "Overall, how does being Asian affect people's ability to get ahead in our country these days? Helps a lot/Helps a little/Hurts a little/Hurts a lot/Neither helps nor hurts/Refused",
  "Have you ever personally experienced discrimination or been treated unfairly because of your gender, or not? Yes/No/Refused",
  "When it comes to improving race relations, do you think it is more important for people to focus on The unique experiences of different racial and ethnic groups/What different racial and ethnic groups have in common/Refused",
  "In general, do you think there is too much, too little, or about the right amount of attention paid to race and racial issues in our country these days? Too much attention/Too little attention/About the right amount of attention/Refused",
  "Since President Trump was elected, do you think it has become more acceptable or less acceptable for people to express racist or racially insensitive views, or is it about as acceptable as it was before? More acceptable/Less acceptable/About as acceptable/Refused",
  "Since President Trump was elected, do you think it has become more common or less common for people to express racist or racially insensitive views, or is it about as common as it was before? More common/Less common/About as common/Refused",
  "Do you think race relations in the United States are Getting better/Getting worse/Staying about the same/Refused",
  "Do you think race relations in the United States are Generally good/Generally bad/Refused",
  "When it comes to giving black people equal rights with whites, do you think our country has Gone too far/Not gone far enough/Been about right/Refused",
  "Thinking again about race and race relations in the U.S. in general, how well, if at all, do you think each of these groups get along with each other in our society these days? Whites and Hispanics Very well/Pretty well/Not too well/Not at all well/Not sure/Refused",
  "Would you say President Trump has Made progress toward improving race relations/Tried but failed to make progress toward improving race relations/Not addressed race relations/Made race relations worse/Refused",
  "When race or race relations comes up in your conversations with family and friends, is it Always with people who are the same race as you/Mostly with people who are the same race as you/Mostly with people who are not the same race as you/Always with people who are not the same race as you/Both about equally/Refused",
  "How likely, if at all, is it that black people in our country will eventually have equal rights with whites? Very likely/Somewhat likely/Not too likely/Not at all likely/Refused",
  "According to the U.S. Census Bureau, in the next 25 to 30 years, African Americans, Latinos, and people of Asian descent will make up a majority of the population. In general, do you think that this is Good for the country/Bad for the country/Neither good nor bad for the country/Refused",
  "On a different subject how much, if at all, do white people benefit from advantages in society that black people do not have? A great deal/A fair amount/Not too much/Not at all/Refused",
  "How likely do you think it is that the following will happen in the next 30 years? There will be increasing violence against Jews in the U.S. Will definitely happen/Will probably happen/Will probably not happen/Will definitely not happen/Refused",
  "According to the U.S. Census Bureau, by the year 2050, a majority of the population will be made up of blacks, Asians, Hispanics, and other racial minorities. In terms of its impact on the country, do you think this will be A very good thing/A somewhat good thing/A somewhat bad thing/A very bad thing/Neither a good nor bad thing/Refused",
  "According to the U.S. Census Bureau, more people of different races are marrying each other these days than in the past. In terms of its impact on the country, do you think this is A very good thing/A somewhat good thing/A somewhat bad thing/A very bad thing/Neither a good nor bad thing/Refused",
  "How likely do you think it is that the following will happen in the next 30 years? A Hispanic person will be elected U.S. president Will definitely happen/Will probably happen/Will probably not happen/Will definitely not happen/Refused",
  "Still thinking ahead 30 years, which do you think is more likely to happen in the U.S.? Race relations will improve/get worse Race relations will improve/Race relations will get worse/Refused",
  "In the US, do you think discrimination against people based on their race or ethnicity is a Very serious problem/Somewhat serious problem/Not too serious problem/Not a problem at all/Refused",
  "Overall, do you think having people of many different backgrounds, such as different ethnic groups, religions and races, makes the US A better place to live/A worse place to live/Refused",
  "In the US, how strong, if at all, are conflicts between people with different ethnic or racial backgrounds? Very strong conflicts/Strong conflicts/Not very strong conflicts/There are not conflicts/Refused",
  "Do you think the country's current economic conditions are helping or hurting people who are black? Helping a lot/Helping a little/Hurting a little/Hurting a lot/Neither helping nor hurting/Refused",
  "Do you think the country's current economic conditions are helping or hurting people who are white? Helping a lot/Helping a little/Hurting a little/Hurting a lot/Neither helping nor hurting/Refused",
  "Do you think the country's current economic conditions are helping or hurting people who are Hispanic? Helping a lot/Helping a little/Hurting a little/Hurting a lot/Neither helping nor hurting/Refused",
  "Were you surprised by what your DNA test results showed about what countries or continents your ancestors came from? Yes, surprised/No, not surprised/Refused",
  "Were you surprised by what your DNA test results showed about the racial or ethnic background of your ancestors? Yes, surprised/No, not surprised/Refused",
  "Did your DNA test results change the way you think about your racial or ethnic identity? Yes, changed/No, did not change/Refused",
  "How much, if at all, do you think discrimination against racial and ethnic minorities contributes to economic inequality in this country? Contributes a great deal/Contributes a fair amount/Contributes not too much/Contributes not at all/Refused",
  "How much more, if anything, needs to be done to ensure equal rights for all Americans regardless of their racial or ethnic backgrounds? A lot/A little/Nothing at all/Refused",
  "Which comes closer to your view about what needs to be done to ensure equal rights for all Americans regardless of their racial or ethnic backgrounds? Most U.S. laws and major institutions need to be completely rebuilt because they are fundamentally biased against some r/While there are many inequities in U.S. laws and institutions, necessary changes can be made by working within the curre/Refused",
  "How much progress, if any, do you think the country has made over the last 50 years toward ensuring equal rights for all Americans regardless of their racial or ethnic backgrounds? A lot/A little/None at all/Refused",
  "Do you think increased public attention to the history of slavery and racism in America is generally good or bad for our society? Very good for society/Somewhat good for society/Neither good nor bad for society/Somewhat bad for society/Very bad for society/Refused",
  "Do you think white people declining as a share of the U.S. population is generally good or bad for our society? Very good for society/Somewhat good for society/Neither good nor bad for society/Somewhat bad for society/Very bad for society/Refused",
  "In general, how much do White people benefit from advantages in society that Black people do not have? A great deal/A fair amount/Not too much/Not at all/Refused",
  "In the context of race relations in the United States, please react to the following statement. Affirmative action is a necessary policy to correct historical injustices. Strongly agree/Agree/Neutral/Disagree/Strongly disagree/Refused",
  "Do you believe that white privilege is a real and impactful social phenomenon? Yes/No/Not sure/Refused",
  "What is your viewpoint on the Black Lives Matter movement? View it positively/View it negatively/Neutral/Not informed enough to form an opinion/Refused",
  "How would you characterize your feelings towards Rev. Dr. Martin Luther King Jr's philosophy of non-violent protest? Support wholeheartedly/Support partially/Neutral/Oppose partially/Oppose wholeheartedly/Refused",
  "What are your thoughts on the claim that America is yet to come to terms with its slave owning past? Fully agree/Partly agree/Neutral/Partly disagree/Fully disagree/Refused",
  "Do you believe that reparations for the descendants of slaves are a rightful compensation for wrongful harm done by the institution of slavery? Yes/No/Not sure/Refused",
  "Considering the removal of confederate statues and renaming of public places, what are your opinions on this matter? Agree with the decision/Disagree with the decision/Neutral/Need more information/Refused",
  "How do you react when you hear the phrase \"all lives matter\" in response to \"black lives matter\"? It's appropriate/It's inappropriate/Neutral/Don't know/Refused",
  "What is your opinion on the role of the police in communities of color? They are a positive influence/They are a negative influence/Neutral/Need more insight into the issue/Refused",
  "Can you comment on the school-to-prison pipeline issue affecting black and brown youths in America? Strongly agree it's an issue/Agree it's an issue/Neutral/Disagree it's an issue/Strongly disagree it's an issue/Refused",
  "In your own view, does the criminal justice system in the Unites States treat all races equally or is there a bias? There's a bias/It's equal/Not sure/Needs more research/Refused",
  "Provide your stance on this statement - Economic disparities among racial and ethnic groups in the United States is mainly due to systemic racism. Strongly agree/Agree/Neutral/Disagree/Strongly disagree/Refused",
  "What is your perspective on racial profiling? Is it a legitimate strategy or a civil rights violation? It's a legitimate strategy/It's a civil rights violation/Neutral/Need more information/Refused",
  "Your reaction, please, to the statement - Voter suppression practices disproportionately target people of color. Strongly agree/Agree/Neutral/Disagree/Strongly disagree/Refused",
  "How would you respond to the phrase \"Check your privilege\" when used in discussions related to race? Justified/Not justified/Don't know/Refuse to answer",
  "Do you support the defunding of local police departments in the context of racial justice? Fully support/Partially support/Neutral/Partially Oppose/Fully Oppose/Refused",
  "Please comment on the role of educational institutions in perpetuating racial inequalities. Play a significant role/Play a moderate role/Play no role/Need more information/Refused",
  "Do you believe implicit bias of individuals is a significant factor in fueling racial disparities? Yes/No/Not sure/Need further information/Refused",
  "Should history textbooks be revised to include more comprehensive and accurate details about racial tension and struggle in the US? Yes definitely/Perhaps/Neutral/Perhaps not/Definitely not/Refused",
  "What are your views on people of color appropriating elements of white culture? Always acceptable/Sometimes acceptable/Rarely acceptable/Never acceptable/Not sure/Refused",
  "Can you articulate your opinion on the impact of President Obama's policies on race relations in the United States?   Improved substantially/Improved marginally/No significant change/Worsened marginally/Worsened substantially/Refused",
  "Share your perspective on Affirmative Action and its impact on racial equality in education and employment in America. Extremely beneficial/Generally beneficial/Neutral/Generally detrimental/Extremely detrimental/Refused",
  "Analyze the effect of systemic racism on the socio-economic status of Hispanic individuals in the United States.  Major impact/Modest impact/No impact/Negative impact/Refused",
  "Enumerate how you think the gentrification of neighborhoods can influence racial dynamics.  Major positive influence/Minor positive influence/No influence/Minor Negative influence/Major Negative influence/Refused.",
  "Would you concur that there is a bias in the US criminal justice system against people of color? Strongly agree/Agree/Neutral/Disagree/Strongly disagree/Refused",
  "Explain your position on the statement, \"Immigration contributes to racial diversity and hence enriches American culture\". Strongly agree/Agree/Neutral/Disagree/Strongly disagree/Refused",
  "Critique the impact of American mainstream media on shaping perceptions about different races. Very Positive/Positive/Neutral/Negative/Very Negative/Refused",
  "Share your thoughts on the role educational policies can play in reducing racial disparities. Vital role/Moderate role/Minimal role/No role/Detrimental role/Refused",
  "Would you agree or disagree with the statement that \"racial disparities in health are a direct result of socioeconomic disparities\"? Strongly agree/Agree/Neutral/Disagree/Strongly disagree/Refused",
  "How much effect do you think the ‘Black Lives Matter’ movement had on raising global awareness about racial issues in North America? Substantial effect/Slight effect/No effect/Counterproductive/Refused",
  "Can you express your thoughts about the concept of ‘White privilege’ and its effects on race relations? Deeply impactful/Moderately impactful/Not impactful/Non-existent concept/Refused",
  "Estimate the impact of the 'War on Drugs' on minorities in America. Severely detrimental/Moderately detrimental/Neutral/Moderately helpful/Extremely beneficial/Refused",
  "Evaluate the influence of socioeconomic status on racial biases in the United States. Profound influence/Moderate influence/Slight influence/No influence/Refused",
  "Present your views on whether institutional racism still exists in the US Government policies. It exists widely/Exists moderately/Exists slightly/Doesn't exist at all/Refused",
  "Explain how you perceive cultural appropriation with regard to racial relations. Respectful exchange/Neutral/Digs racial divide/Appropriation without acknowledgement/Refused",
  "Contemplate the role gentrification plays in amplifying racial disparities. Major role/Minor role/Neutral/Insignificant role/Refused",
  "Reveal your stand on the racial diversity on corporate boards and its impact on corporate governance. Very Positive/Positive/Neutral/Negative/Very Negative/Refused",
  "Suppose the effect of segregation on communities in America. Extremely negative/Moderately negative/No effect/Moderately positive/Extremely positive/Refused",
  "Consider the influence of racial profiling on crime prevention and law enforcement in America. Powerful influence/Limited influence/No influence/Counterproductive/Refused",
  "Elaborate on the significance of the Civil Rights Movement in contemporary discussions about race. Incredibly significant/Moderately significant/Slightly significant/Not significant at all/Refused",
  "Do you agree that socio-economic factors play a significant role in exacerbating racial inequality? Strongly agree/Agree/Disagree/Strongly disagree/Don't know/Refused",
  "Do you believe that incidents of racially-motivated police brutality represent isolated incidents or a systemic problem within law enforcement? Isolated incidents/Systemic problem/Both/Neither/Refused",
  "Are you of the opinion that affirmative action policies have a positive effect in combating institutionalized racism? Definitely yes/Probably yes/Probably not/Definitely not/Don't know/Refused",
  "Do you support reparations for descendants of slaves in acknowledgment of the Crime Against Humanity enacted through the transatlantic slave trade? Strongly support/Support/Oppose/Strongly oppose/Don't know/Refused",
  "In job applications, do you think ethnicity should be removed from CVs to reduce racial bias? Yes, should be removed/No, shouldn't be removed/Don't know/Refused",
  "Do you believe the racial wealth gap is best addressed by focusing on rebuilding and investing in disadvantaged communities? Strongly agree/Agree/Disagree/Strongly disagree/Don't know/Refused",
  "Is it your belief that the education system has inherent racial bias that affects the opportunities and treatment of students from racially diverse backgrounds? Definitely yes/Probably yes/Probably not/Definitely not/Don't know/Refused",
  "Do you believe that racism is mostly a problem of the past, or is it a significant issue that still needs addressing today? Problem of the past/Still a significant issue/Both/Neither/Refused",
  "Do you support or oppose the idea of revising the curriculum to better reflect racial diversity and histories? Strongly support/Support/Oppose/Strongly oppose/Don't know/Refused",
  "Do you think calling out and addressing microaggressions helps or hinders race relationships? Helps/Hinders/Both/Neither/Refused",
  "Regarding affirmative action policies aimed at increasing the number of Black and minority students on college campuses, do you feel these policies are needed to correct for historical disadvantages? Strongly Agree/Agree/Disagree/Strongly Disagree/Not Sure/Refused",
  "How do you perceive the Black Lives Matter movement? Do you feel it advocates equality and addresses racial injustices, or do you see it causing unnecessary division in society? Advocates Equality/Creates Division/Neither/Not Sure/Refused",
  "What is your stance on the concept of white privilege? Do you believe it exists, and influences societal balance, or are you opposed to the concept? Exists and Influences Society/Opposed to Concept/Neutral/Not Sure/Refused",
  "When considering the topic of reparations for slavery in America, what would be your position? Support the idea/Oppose the idea/Need more information to decide/Refused.",
  "Do you believe the education system in the U.S. offers equal opportunities to students of all racial backgrounds, or do you think it's prejudiced towards certain races? Offers Equal Opportunities/Prejudiced Towards Certain Races/Neutral/Not Sure/Refused",
  "Tell me whether you think racial profiling by law enforcement is happening often, not so frequent, or it does not exist at all? Happens Often/Not So Frequent/Non-Existing/Not Sure/Refused",
  "Do you agree or disagree with the idea that housing discrimination against people of color is a significant issue in the United States? Agree/Disagree/Neither agree nor disagree/Not Sure/Refused",
  "How important do you think it is to have racial diversity in our political leadership? Very Important/Important/Not Important/Not Sure/Refused",
  "How do you feel about policies promoting diversity, such as affirmative action in workplace hiring practices? Supportive/Opposed/Neutral/Not Sure/Refused",
  "On average, are ethnic minorities or white people treated more unfairly by the criminal justice system? Ethnic Minorities/White People/Both Are Treated Equally/Not Sure/Refused",
  "Do you think mass media portray ethnic minorities in a stereotypical or detrimental way? Yes, they do /No, they do not/Not sure/Refused",
  "What are your thoughts on racial segregation in schools today? Is it a serious problem, a negligible issue or it does not exist at all? Serious Issue/Negligible Issue/Non-Existing Issue/Not Sure/Refused",
  "Should monuments and statues that are seen as racially offensive be removed from public spaces? Yes, they should/No, they shouldn't/Not sure/Refused",
  "Do you believe in \"colorblindness\", the thought of ignoring race in order to avoid racism, or do you think acknowledging race is important for the fight against racism? Believe in Colorblindness/Acknowledge Race/Neither/Not Sure/Refused",
  "How do you perceive the wage gap between ethnic minorities and white colleagues in the labor market? Do you consider it a significant issue or not really? Significant Issue/Not Significant Issue/Neutral/Not Sure/Refused",
  "Regarding discrimination faced by Asian Americans, do you feel it's a major issue that often goes underreported, a minor issue, or not an issue at all? Major Issue/Minor Issue/Not an Issue/Not Sure/Refused",
  "How would you evaluate the representation of people of color in Hollywood? Is it fair, disproportionate, or non-existent? Fair/Disproportionate/Non-Existent/Not Sure/Refused",
  "Assess the role of racial bias in the adoption process. Is it a significant concern, minor concern, or not a concern at all? Significant Concern/Minor Concern/Not a Concern/Not Sure/Refused",
  "Regarding sports industry, do you think there's equal recognition and pay for athletes of all races or is there discrimination? Equal Recognition and Pay/Discrimination Exists/Neither/Not Sure/Refused",
  "What do you think about the statement that race and ethnicity play a major role in determining success in America? Undoubtedly true/Somewhat true/Partially true/Somewhat false/Unquestionably false.",
  "How do you perceive the racial wealth gap in America? Extensively exists/Somewhat exists/Barely exists/Doesn't exist at all/Refused",
  "Institutional racism is believed to be a significant issue by many. How much do you agree with this? Strongly agree/Agree/Neutral/Disagree/Strongly disagree",
  "Do you think systemic racism influences the U.S. judicial system? Definitely influences/May influence/Does not influence/Most certainly does not influence/Not sure",
  "Considering the social fabric of America, does the belief that 'white privilege' exists resonate with you? Absolutely/To some extent/Not much/Not at all/Refused",
  "Do you believe affirmative action measures to improve race relations are necessary? Extremely essential/Somewhat essential/Not very essential/Not at all essential/Refused",
  "In your view, does the education system in America contribute to racial disparities? Absolutely contributes/Modestly contributes/Does not really contribute/Absolutely does not contribute/Unsure",
  "Does unconscious bias contribute significantly to racial discrimination in America? Extremely contributes/Moderately contributes/Slightly contributes/Does not contribute/Can't decide",
  "Affirmative action is a controversial topic. Do you perceive it as a means of righting historical wrongs or as reverse discrimination? Absolutely righting wrongs/Partially righting wrongs/Neutral/Partially reverse discrimination/Absolutely reverse discrimination",
  "Underrepresentation of racial minorities in positions of power is a documented phenomenon. Do you see a need for more diversity in these roles? Urgently needed/Needed/Neutral/Not needed/Strongly against",
  "Does racial profiling in law enforcement exist according to you? Certainly exists/Possibly exists/Does not exist/Definitely does not exist/Not sure",
  "Is cultural appropriation offensive to you? Extremely offensive/Offensive/Somewhat offensive/Not offensive at all/Refused",
  "What do you think about ‘color-blind politic’ - an approach that disregards race completely in policy making? Strongly support/Support/Neutral/Oppose/Strongly oppose",
  "Have racial tempo changing experiences occurred to you or someone you know? Yes, frequently/Yes, occasionally/Never happened before/Never heard of such a thing/Refused",
  "How much do you believe that racial and ethnic diversity is promoting cultural exchange and understanding in the USA? A lot/A little/Neutral/Not much/Not at all",
  "How do you perceive race-focused protests in the US? Extremely necessary/Somewhat necessary/Neutral/Somewhat unnecessary/Extremely unnecessary",
  "Do you think the racial gap in homeownership is indicative of systemic inequality? Strongly agree/Agree/Neutral/Disagree/Strongly disagree",
  "How significant are the problems caused by racial intolerance and discrimination in America? Very High/High/Moderate/Low/Very Low",
  "Is it correct to say that racial discrimination is ingrained in American society? Absolutely correct/Somewhat correct/Neither correct nor incorrect/Somewhat incorrect/Absolutely incorrect",
  "Do you consider gentrification as a racial issue in America? Highly consider it as a racial issue/Consider it as a racial issue/Neutral/Do not really consider it as a racial issue/Do not at all consider it as a racial issue",
  "Do you believe that affirmative action policies are necessary to counteract disparities in opportunities for racial minorities? Absolutely necessary/Somewhat necessary/Not really necessary/Not at all necessary/Refused",
  "To what extent do you agree with this statement: Systematic racism is prevalent in all parts of society? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "Evaluate the impact of racial imbalances in the educational system; Quite impactful/ Mildly impactful/ Barely impactful/ Not impactful at all/ Refused",
  "Is it crucial to teach children about racial inequalities from an early age? Extremely crucial/ Somewhat crucial/ Marginally crucial/ Not crucial at all/ Refused",
  "What is your understanding of the idea that 'all lives can't matter until black lives matter'? Fully agree/ Partially agree/ Partially disagree/ Fully disagree/ Refused",
  "Assess how beneficial is the ‘Black Lives Matter’ movement in combating racial inequality. Highly beneficial/ Moderately beneficial/ Barely beneficial/ Not beneficial at all/ Refused",
  "How do you feel about the concept of white privilege? Fully understand and believe it exists/ Acknowledge it but need more understanding/ Slightly skeptical about it/ Do not believe it exists/ Refused",
  "How significant an issue is racial inequality in today’s society in your opinion? Highly significant/ Somewhat significant/ Hardly significant/ Irrelevant/ Refused",
  "Can greater diversity in leadership roles lead to a more equitable society? Definitely yes/ Likely yes/ Likely no/ Definitely no/ Refused",
  "Where should the emphasis lie in resolving racial disparities: on systemic change or individual change? Mostly systemic change/ Both equally/ Mostly individual change/ Neither/ Refused",
  "In the context of racism, how significant is implicit bias? Extremely significant/ Significant/ Not very significant/ Not at all significant/ Refused",
  "Should history education in schools cover more content on racial injustices? Definitely should/ Probably should/ Probably shouldn't/ Definitely shouldn't/ Refused",
  "How far do you agree that people of color are under-represented in media? Strongly agree/ Agree/ Disagree/ Strongly disagree/ Refused",
  "Do you believe racial profiling is often used in law enforcement? Frequently used/ Sometimes used/ Rarely used/ Never used/ Refused",
  "How necessary are racial identity movements for advocating equality? Highly necessary/ Somewhat necessary/ Barely necessary/ Not necessary at all/ Refused",
  "Should corporations have a role to play in advocating racial equality? Absolutely should/ Should but within defined bounds/ Should not unless necessary/ Should not at all/ Refused",
  "How imperative is it to acknowledge our biases to combat racial bias? Extremely imperative/ Very imperative/ Somewhat imperative/ Slightly imperative/ Not at all imperative/ Refused",
  "What do you think is of the political use of race in electoral campaigns? Highly acceptable/ Somewhat acceptable/ Somewhat unacceptable/ Highly unacceptable/ Refused",
  "Would you say the depiction of racial minorities in mass media is often stereotypical? Always/ Mostly/ Sometimes/ Rarely/ Never/ Refused",
  "Is racial injustice a widespread issue or isolated incidents? Predominantly widespread/ More widespread than isolated/ More isolated than widespread/ Predominantly isolated/ Refused",
  "How often, if at all, do you believe that systemic racism impacts opportunities for certain racial or ethnic groups in the United States? Greatly impacts/Somewhat impacts/Slightly impacts/Does not impact at all/Refused",
  "In your opinion, is racial profiling by law enforcement a significant issue in the U.S? Major issue/Minor issue/Not an issue/Not sure/Refused",
  "Do you think that people of color experience more discrimination than white people in the American workforce? Yes/No/Not sure /Refused",
  "How would you rank the importance of addressing racial inequality in our society today? Very important/Important/Neutral/Unimportant/Don’t know/Refused",
  "Does the presence of immigrants, especially non-white immigrants, enrich or harm American culture? Greatly enriches/Somewhat enriches/Neither enriches nor harms/Somewhat harms/Greatly harms/Not sure/Refused",
  "Do you feel that the Black Lives Matter movement has helped or hindered progress on racial issues? Had helped a lot/Helped somewhat/Neither helped nor hindered/Hindered somewhat/Hindered a lot/Not sure/Refused",
  "Regard to affirmative action policies, do you think they are essential for leveling the playing field or do they provide unfair advantages? Essential/Neutral/Provide unfair advantages/Don’t know/Refused",
  "How often, if ever, do you find yourself confronting racial biases in your daily interactions? Often/Sometimes/Rarely/Never/Refused",
  "Have your views on racism in America changed or evolved in recent years? Yes, more aware and concerned/Yes, less concerned/No change/Not sure/Refused",
  "How would you rate the state of race relations in America today? Very good/Good/Fair/Poor/Very poor/Don’t know/Refused",
  "Do you believe that cultural diversity strengthens the American society? Strongly agree/Agree/Neutral/Disagree/Strongly disagree/Refused",
  "In politics today, do you think race plays too large or too small a role? Too large of a role/Just about right/Too small of a role/Not sure/Refused",
  "Do you agree or disagree that there is a serious issue with white privilege in America? Strongly agree/Agree/Neutral/Disagree/Strongly disagree/Refused",
  "How much does the history of racism and discrimination in the U.S affect economic inequality today? Greatly affects/Somewhat affects/Doesn't affect/Not sure/Refused",
  "How would rate your understanding and awareness of the issues faced by Indigenous communities in the U.S? Very aware/Fairly aware/Slightly aware/Not aware/Refused",
  "Have issues surrounding racial injustice influenced your political beliefs or affiliations? Yes, significantly/Yes, slightly/Not at all/Not sure/Refused",
  "Does the media portray certain races or ethnicities unfairly, in your opinion? Yes, consistently/Yes, sometimes/No, not often/No, never/Not sure/Refused",
  "How important is it for those in positions of power to have racial and cultural diversity? Extremely important/Very important/Moderately important/Slightly important/Not at all important/Not sure/Refused",
  "Should schools do more to educate students about systemic racism in U.S society? Yes, a lot more/ Yes, somewhat more/No change required/A bit less instruction/A lot less instruction/Refused",
  "Does acknowledging America's history of racial injustices help or hinder our progress towards a more equal society? Helps significantly/Helps to a certain extent/Neither helps nor hinders/Hinders to a certain extent/Hinders significantly/Refused",
  "Reflect on how being African American can impact a person's chances of success in today's society. Is the impact appreciable/insubstantial/detrimental/advantageous/non-existent?",
  "Is affirmative action for protected minority groups a necessity in modern America? Expound on why you believe it is essential/redundant/detrimental/advantageous.",
  "Present an argument for or against the existence of white privilege in contemporary society. Do you consider it a factual phenomenon/unproven theory/racist concept/relevant factor?",
  "Give your perspective on how being of Hispanic descent can affect an individual's access to quality education in America. Does it grant an advantage/denies access/holds no significance/makes little difference?",
  "Is the racial profiling of Middle Eastern people in airport security checks justified? Offer a justification that states why it is justified/unjustified/necessary/unnecessary.",
  "Has the Black Lives Matter movement positively or negatively influenced racial relationships? Assess its significant/negative/slight/null effect.",
  "In what way could being Native American affect someone's experiences with law enforcement? Could it be advantageous/disadvantageous/unrelated/inconclusive?",
  "Could being Asian-American influence the level of healthcare someone receives? Is it likely to improve/worsen/restrict/enhance their treatment?",
  "Do you deem it crucial to incorporate ethnic studies into American high school curricula? Support why you consider it vital/unnecessary/beneficial/disruptive.",
  "Has the insistence on politically correct language limited freedom of speech or promoted racial harmony? Secure your stance that it has either supported supression/encouraged understanding/both/neither.",
  "Reflect on how being multiracial in America may influence an individual's political alignment? Could it sway them towards conservatism/liberalism/libertarianism/socialism?",
  "Assess whether a political candidate's race affects your perception of their competence or credibility. Should it be deemed consequential/irrelevant/enhancing/detracting?",
  "What is your standpoint on the ongoing debates about reparations for slavery? Essential/unnecessary/divisive/unifying?",
  "Consider whether race and ethnicity should be factored when considering candidates for job positions. Is it a reasonable/unjustified/necessary/irrelevant practice?",
  "How do you perceive the racial disparities in American incarceration rates? Unjust/framed/largely overblown/non-existent?",
  "Determine whether racial identity has a significant impact on one's access to housing opportunities in the US? Major/Minor/No impact/Positive impact?",
  "Formulate a viewpoint on race-based college admissions policies. In your opinion, are they helpful/harmful/unnecessary/partially beneficial?",
  "What's your take on racial stereotyping in media and entertainment? Is it harmful/beneficial/acceptable/a non-issue?",
  "Contemplate the influence of systemic racism on wealth generation and distribution in America. Is it significant/negligible/beneficial/destructive?",
  "How has being a particular race influenced your personal political convictions? Profoundly/Somewhat/Not at all/Mostly positively?",
  "Do you believe that affirmative action policies are necessary for leveling the playing field in education and employment? Viable tool for equality/Unfair advantage/Have no significant impact/Refused",
  "Have your views on racial issues shifted following large-scale movements like Black Lives Matter? Yes, have changed/Remained the same/Refused",
  "Is income inequality among different racial groups in the U.S. a concern that needs immediate addressing? Urgent issue/Not a significant problem/ Refused",
  "How do you perceive the racial tensions in America today compared to a decade ago? More tense/Less tense/About the same/Refused",
  "Does racial representation in workplace leadership positions impact an organization’s dynamic and growth? Improves overall dynamics/Has no significant impact/Negatively affects dynamics/Refused",
  "Do you think racial profiling by law enforcement is justified for national security? Justified/Unjustified/Depends on the situation/Refused",
  "Should police departments be defunded to channel resources towards community-led safety initiatives? In favour/Against/Undecided/Refused",
  "Should monuments and statues which may symbolise racial oppression and injustice be removed from public spaces? Must be removed/Should remain intact/Refused",
  "Should undocumented immigrants in the U.S., who are largely from minority racial groups, be offered a clear path to citizenship? In favour/Against/Necessary but with conditions/Refused",
  "Do you find it acceptable or offensive for a person who is not of a particular race or ethnicity to wear a traditional dress from that culture as part of a costume or for fashion? Acceptable/Offensive/Depends on context/Refused",
  "How necessary is the inclusion of more diverse cultures in the academic curriculum? Very necessary/Not necessary/Depends on the context/Refused",
  "Should communities of colour affected by past racial discrimination receive reparations from the government? In favour/Against/Depends on the form of reparations/Refused",
  "How do you perceive media's role in shaping public opinion about race issues? Positively impactful/Negatively impactful/No significant impact/Refused",
  "Is systematic racism embedded in American institutions, or is it a myth perpetuated by radicals? It exists/It's a myth/Exists but is exaggerated/Refused",
  "Should religious institutions play a more significant role in combating racial discrimination? They should/They shouldn't/Depends on the institution/Refused",
  "Would you say that racism is more prevalent among older generations or the younger generations, or is it about the same across all generations? More prevalent in older generations/More prevalent in younger generations/About the same/Refused",
  "How do you perceive the term \"white privilege\"? A reality/A myth/Refused",
  "Does socioeconomic status play a more critical role in one's opportunities and success than one's race? More important/Less important/Equally important/Refused",
  "Should racial diversity be a deciding factor when selecting candidates for college admissions? Should weigh heavily/Should not matter at all/Should consider but not heavily weigh/Refused",
  "Do you think the implementation of stop-and-frisk policies disproportionately affects minority communities, or is it applied equally across all racial groups? Disproportionately affects minority communities/Applied equally/Refused",
  "Do you believe that affirmative action policies, which give special preference to minorities in areas like college admissions, are necessary to balance historical racial disadvantages? Necessary to balance disadvantages/Not necessary/Refused",
  "Consider the statement: Systemic racism is deeply rooted in American society and privileges white people. Is this a viewpoint you strongly agree with, somewhat agree with, neither agree nor disagree with, somewhat disagree with, or strongly disagree with? Strongly agree/Somewhat agree/Neither agree nor disagree/Somewhat disagree/Strongly disagree/Refused",
  "Have you ever encountered a situation where a non-white individual was wrongly accused or treated unfairly because of their ethnicity? Yes, have encountered/No, have not encountered/Refused",
  "In your opinion, is the act of kneeling during the national anthem, initiated by Black Lives Matter movement, a respectful way to protest racial injustice or is it an offensive act? Respectful protest/Offensive act/Refused",
  "Do you think that the term \"white privilege\" is a way to blame individuals of white ethnicity for systemic racism, or is it merely a description of societal structures that benefit them? A way to blame white individuals/Description of societal structures/Refused",
  "In your view, is it effective to use peaceful protests, like those led by the Black Lives Matter movement, to combat racism or do they provoke more division in society? Effective to combat racism/Provoke more division/Refused",
  "Do you agree with the statement that people of color are often subject to police brutality more than their white counterparts? Strongly agree/Somewhat agree/Neither agree nor disagree/Somewhat disagree/Strongly disagree/Refused",
  "Do you consider that institutional racism is more prevalent in the American education system, criminal justice system or they are equally prevalent in both systems? More prevalent in education system/More prevalent in criminal justice system/Equally prevalent in both/Refused",
  "Do you hold responsible individuals for perpetuating racial stereotypes or do you believe societal structures are primarily at fault? Individuals are responsible/Societal structures are responsible/Both are responsible/Refused",
  "Are you in favor of implementing affirmative action in all sectors of society to counteract historical racial discrimination? Yes/No/Refused",
  "In terms of representation, is it important to have racial diversity in our government? Why or why not?",
  "Should there be more policies in place to promote racial equality in the workplace? Yes/No/Refused",
  "Do you believe that public schools should teach about the history and impact of racism? Yes/No/Refused",
  "What is your opinion on removing monuments or symbols associated with a racist past? Justified/Not justified/Refused",
  "Do you believe that the current criminal justice system in our country is racially biased? Yes/No/Refused",
  "Do you think our society has moved past the need for racial categories, and we should see everyone just as human beings? Yes/No/Refused",
  "Do you agree that racial and ethnic microaggressions are harmful and need to be addressed? Yes/No/Refused",
  "Do you believe that discussing race or racism perpetuates division? Yes/No/Refused",
  "Is political correctness infringing free speech, or is it providing a necessary standard to respect all races? Infringing/Providing Standard/Refused",
  "Should laws be instituted to prevent racial profiling by law enforcement agencies? Yes/No/Refused",
  "Do you perceive that there’s a bias in media reporting based on the race of the subject? Yes/No/Refused",
  "Is it necessary to continue conversations on race despite the advancements in racial equality? Yes/No/Refused",
  "Does culture appropriation harm or honor the races being represented? Harm/Honor/Refused",
  "Do you think that racially-based hate speech should be categorized as a free speech right? Yes/No/Refused",
  "Do you view the concept of 'white privilege' as valid? Yes/No/Refused",
  "Do you feel that people of color are adequately represented in today's media? Yes/No/Refused",
  "Should voting districts be redrawn to ensure fair representation of all races in democratic processes? Yes/No/Refused",
  "Do you believe that racial discrimination affects the quality of healthcare received by individuals? Yes/No/Refused",
  "Do reparations need to be made to groups that have historically suffered from racial discrimination? Yes/No/Refused",
  "What's your perspective on affirmative action and its impacts on college admissions? Does it contribute to fair representation or does it inadvertently engender reverse discrimination? Elaborate your views.",
  "How do you view the role of diverse representation in media and arts? Does it perpetuate stereotypes, or does it foster racial understanding and harmony? Discuss your opinions.",
  "Should historical monuments and statues related to controversial figures associated with racial discrimination be preserved or removed? Share your thoughts.",
  "Do you believe that the way law enforcement interactions are influenced by a person's racial or ethnic background is a matter of serious concern in the United States? Develop your viewpoint.",
  "Analyze the impact of racial inequities on economic opportunities and wealth accumulation. Is this a problem that needs imminent attention? Discuss.",
  "How important do you think it is to talk about race and forms of systemic racism with children? Explain your reasoning.",
  "Do you think the concept of \"white privilege\" is real? In what ways it affects racial disparities, if you think it does? Please elaborate.",
  "Do you think the Black Lives Matter movement has been effective in bringing about changes in race relations and police reforms? State your point of view.",
  "Consider the question of reparations for past injustices such as slavery. Do you agree or disagree with this idea, and why?",
  "Using examples, explain how the use of racial and ethnic stereotypes in media can influence societal attitudes and perceptions.",
  "Should there be more policies in place to ensure diversity in workplaces? Justify your answer.",
  "Do you believe that there's a conscious move towards racial inclusion and diversity in the tech industry? State your opinion.",
  "Explain your perspective on whether or not cultural appropriation constitutes a form of racial bias.",
  "Reflect on the ways systemic racism impacts the US healthcare system. Does it require immediate addressing?",
  "Discuss the question of gentrification. Do you think it plays a role in racial segregation and socio-economic disparities?",
  "What's your take on racial profiling? How does it impact society, according to your understanding?",
  "What impact, if any, do you infer the 'cancel culture' has on addressing racist remarks or behaviors? Please share your perspective.",
  "Does the entertainment industry reinforce racial stereotypes, or does it contribute in breaking them down? Illustrate your viewpoint.",
  "How do you perceive the role of education in eliminating racial bias and promoting equality? Share your thoughts.",
  "Could housing policies be contributing to racial segregation? What's your stance on this matter?",
  "How do you feel about affirmative action policies that favor minorities? Strongly agree/Agree/Neither agree nor disagree/Disagree/Strongly disagree/Refused",
  "Do you believe racial discrimination is a significant issue in our society today? Yes, it is a significant issue/No, it is not a significant issue/Undecided/Refused",
  "To what extent do you think the justice system in our country is impartial to all races? Completely impartial/Mostly impartial/Somewhat impartial/Not impartial at all/Refused",
  "How has the Black Lives Matter movement affected your view on race relations in our country? Improved my view/Deteriorated my view/Hasn’t changed my view/Refused",
  "In your opinion, has the racial gap in educational attainment improved, remained the same, or worsened over the years? Improved/Remained the same/Worsened/Don't know/Refused",
  "How prevalent do you believe racial bias is in the workplace? Very prevalent/Prevalent/Not very prevalent/Not prevalent at all/Don't know/Refused",
  "Do you believe that the news media presents a fair portrayal of different races? Yes, it is fair/No, it is not fair/Undecided/Refused",
  "Do you support legislation that would hold police more accountable for their actions towards people of color? Strongly Agree/Agree/Neither Agree nor Disagree/Disagree/Strongly Disagree/Refused",
  "Have recent discussions about race opened up your perspectives on racial discrimination? Yes, opened up my perspectives/No, my perspectives remain the same/Not sure/Refused",
  "Do you think there's a need for more people of color in positions of political leadership? Yes, more diversity is needed/No, there's sufficient diversity/Undecided/Refused",
  "Do you think racial reconciliation can be achieved in your lifetime? Yes, it can be achieved/No, it cannot be achieved/Not sure/Refused",
  "What's your view on reparations for historically disadvantaged racial groups? Strongly support/Support/Neutral/Oppose/Strongly oppose/Refused",
  "What's your opinion about racial profiling in security checks at airports? Acceptable if it improves overall security/Mostly acceptable/Mostly unacceptable/Unacceptable/Refused",
  "Do you think all races have the same opportunities to succeed in our society? Yes, they do/No, they do not/Not sure/Refused",
  "Can deep-seated racial biases be completely eliminated? Yes, they can be eliminated/No, they cannot be eliminated/Not sure/Refused",
  "Do you believe that the war on drugs unfairly targets minority communities? Yes, it does/No, it does not/Not sure/Refused",
  "Do you believe systemic racism is a factor in wealth disparities among different races? Yes, it is a factor/No, it is not a factor/Not sure/Refused",
  "What's your stance on cultural appropriation by individuals not of the same race? It's generally acceptable/It's acceptable if done respectfully/It's generally disrespectful/Not sure/Refused",
  "Do you think systemic racism in healthcare has affected the health outcomes of individuals from different races? Yes, it has/No, it hasn't/Not sure/Refused",
  "How do you feel about schools teaching children about the historical and current issues related to race? Strongly support/Support/Neutral/Oppose/Strongly oppose/Refused",
  "Should race and ethnicity be considered in college admissions to promote diversity and inclusivity, on top of an applicant's qualifications? Absolutely should/Should/Neutral/Should not/Absolutely should not/Refused",
  "How do you feel about the statement \"All Lives Matter\" being used in response to \"Black Lives Matter\"? Extremely supportive/Supportive/Neutral/Opposed/Strongly opposed/Refused",
  "Do you think law enforcement treat all races and ethnicities equally? Completely equally/Generally equally/Sometimes unequally/Generally unequally/Completely unequally/Refused",
  "Do you believe that systemic racism exists in the United States? Definitely yes/Probably yes/Not sure/Probably not/Definitely not/Refused",
  "How would you react if a non-black person used a racial slur towards a black person, even jokingly? Confront them immediately/Address it later/Ignore it/Laugh along/Refuse to answer/Refused",
  "Should schools be required to teach about the history of racism and racial inequality in their curriculum? Definitely yes/Probably yes/Not sure/Probably not/Definitely not/Refused",
  "How would you feel about reparations for African Americans for the history of slavery and racial injustice? Very supportive/Supportive/Neutral/Opposed/Very opposed/Refused",
  "Should the U.S. government issue a formal apology for slavery? Absolutely yes/Yes/Undecided/No/Absolutely no/Refused",
  "How do you feel about affirmative action policies aimed to assist marginalized communities? Extremely favourable/Favourable/Neutral/Unfavourable/Extremely unfavourable/Refused",
  "Should monuments and statues of historical figures known for racism be removed? Absolutely should/Should/Neutral/Should not/Absolutely should not/Refused",
  "How do you feel about athletes kneeling during the national anthem as an act of protest against police brutality? Very supportive/Supportive/Neutral/Opposed/Very opposed/Refused",
  "Would you be okay with your child learning about the concept of white privilege in school? Absolutely yes/Yes/Not sure/No/Absolutely no/Refused",
  "How do you feel about communities of color advocating for police defunding in response to racial disparities in law enforcement? Extremely supportive/Supportive/Neutral/Opposed/Strongly opposed/Refused",
  "Does the idea of \"reverse racism\" against white people exist? Definitely exists/Possibly exists/Unsure/Possibly does not exist/Definitely does not exist/Refused",
  "Do you agree that racial profiling in law enforcement is justifiable in the interest of safety and security? Strongly agree/Agree/Undecided/Disagree/Strongly disagree/Refused",
  "How do you perceive the concept of intersectionality (the overlap of race, gender, sexual orientation, etc.) in terms of progressive politics? Very important/Important/Neutral/Little importance/No importance/Refused",
  "Do you believe the media representation of various races is balanced and fair? Absolutely/Generally/Neutral/Generally not/Absolutely not/Refused",
  "Should companies be required to have a certain percentage of employees from diverse racial backgrounds? Definitely should/Should/Unsure/Should not/Definitely should not/Refused",
  "Do you believe that affirmative action is a necessary policy to compensate for past racial discrimination or does it discriminate against non-minorities? Necessary compensation/Discriminates against non-minorities/Both/Neither/Refused",
  "In your view, would giving more opportunities to people of color be a major step toward solving racial discrimination in America or would it exacerbate racial tensions? Major step in solving issues/Exacerbate racial tensions/Both/ Neither/Refused",
  "Do you think it's important for children to learn about the history of racism in schools or would this incite unnecessary division? Important to learn/Incites division/Both/Neither/Refused",
  "In your perspective, are racial disparities in healthcare a result of systemic bias or individual choices? Systemic bias/ Individual choices/ Both/ Neither/ Refused",
  "Do you believe that police departments should have racial quotas for hiring officers—is this fair representation or reverse discrimination? Fair representation/ Reverse discrimination/ Both/ Neither/ Refused",
  "Should there be reparations for descendants of slaves as a means of addressing past injustices or would this unfairly burden the current generation? Address past injustices/Unfairly burdens current generation/Both/Neither/Refused",
  "In your opinion, do movement slogans like \"Black Lives Matter\" unify society towards a cause or polarize it by focusing on one racial group? Unifies society/Polarizes society/Both/Neither/Refused",
  "Do you view income inequality as a racial problem or an economic class issue? Racial problem/ Economic class issue/ Both/ Neither/ Refused",
  "In your view, does normalizing conversations around white privilege facilitate understanding and empathy or provoke guilt and resentment? Facilitate understanding and empathy/Provoke guilt and resentment/Both/Neither/Refused",
  "Do you think that criticism of the police force is an essential part of holding them accountable or does it undermine their authority and effectiveness? Essential part of accountability/Undermines authority and effectiveness/Both/Neither/Refused",
  "Do you endorse racially targeted scholarships to promote diversity in education, or do you see it as violating principles of equal opportunity? Promotes diversity/Violates equal opportunity/Both/Neither/Refused",
  "Do you think that acknowledging racially biased practices in history books is critical or does it foster a negative view of the country? Critical/Fosters a negative view/Both/Neither/Refused",
  "In your view, would improving racial representation in boardrooms increase innovation and performance, or would it alienate non-minority candidates? Increase innovation and performance/ Alienate non-minority candidates/ Both/ Neither/ Refused",
  "Do you think that encouraging minority communities to vote increases democratic representation or is it influencing election outcomes? Increases democratic representation/ Influences election outcomes/ Both/ Neither/ Refused",
  "Do you think cultural appropriation in popular culture disseminates ideas and fosters growth, or does it disrespect and diminish the importance of minority cultures? Disseminates ideas and fosters growth/ Disrespects and diminishes importance of minority cultures/ Both/ Neither/ Refused",
  "Do you hold the view that cancelling individuals for past racist actions helps combat systemic racism or does it ignore potential for human growth and rehabilitation? Helps combat systemic racism/Ignores potential for growth and rehabilitation/Both/Neither/Refused",
  "According to you, does giving preference to minority artists in award shows promote diversity or compromise on artistic merit? Promotes diversity/Compromises on artistic merit/Both/Neither/Refused",
  "Do you perceive protests against racial injustice as promoting social change or instigating disruption and division? Promoting social change/Instigating disruption and division/Both/Neither/Refused",
  "Do you think insisting on the use of politically correct language promotes sensitivity towards others or suppresses free speech? Promotes sensitivity towards others/Suppresses free speech/Both/Neither/Refused",
  "How would you interpret the assertion that there exists a 'model minority'? Do you feel that it's a supportive stereotype or a harmful generalization?",
  "What's your stance on implementing affirmative action in educational institutions? Is it a necessary policy to balance historical imbalances or does it foster discrimination?",
  "Should academic curriculums include more comprehensive lessons about the histories, experiences, and contributions of different racial and ethnic groups?",
  "Does gentrification result in ethnic and cultural erosion, or does it contribute towards diversity and economic advancement within neighborhoods?",
  "Do you agree that individuals of certain races are disproportionately targeted by law enforcement? Is this perceived bias true or just a misunderstanding of the statistics?",
  "Is it important that media and entertainment industries significantly increase representation of different racial and ethnic groups?",
  "What are your thoughts on reparations for slavery and racial discrimination? Would it be a step towards justice or a perpetuation of division?",
  "How would you evaluate the statement that 'all lives matter' often used as a response to 'black lives matter'? Is it inclusive or dismissive?",
  "Discuss the concept of 'white privilege'. Is it a real issue that needs to be addressed, or is it a divisive term?",
  "Do you believe policies should be instated to ensure equal racial representation in political offices?",
  "Is the term 'reverse racism' accurate or is it a misunderstanding of how systemic racism functions?",
  "What are your thoughts on racial profiling as a practice in airports? Does it increase security or contribute to discrimination?",
  "Do you believe that dismantling systemic racism should be a priority for our government, or are there more urgent issues?",
  "Do 'colorblind' policies and attitudes contribute to equality or do they just ignore the existence of racial disparities?",
  "Discuss your stance on 'cultural appropriation'. Does it promote diversity and appreciation, or does it belittle cultures?",
  "Do you agree with removing Confederate statues and symbols from public spaces? Is it an erasure of history or a step towards healing racial wounds?",
  "How do you view the idea of a post-racial society? Is it an achievable goal, or a misguided concept that minimizes racial issues?",
  "Do you agree with the depiction of racial issues in mainstream media? Is it accurate representation or exaggeration?",
  "What's your take on racial micro-aggressions? Are they significant contributors to societal racism or are they often misinterpreted?",
  "What's your stance on the use of racially and ethnically diverse emojis on social media platforms? Are they promoting inclusivity or are they unnecessary?",
  "How much do you think systemic racism influences the life chances of people of color in our society? Significantly/Quite a bit/A little/Not at all/Not sure/Refused",
  "Should we address racial inequalities through affirmative action in education and employment? Strongly for/Somewhat for/Neutral/Somewhat against/Strongly against/Refused",
  "What's your perspective on the Black Lives Matter movement? Very supportive/Moderately supportive/Neutral/Not supportive at all/Refused",
  "How important is it to teach about the historical injustices suffered by people of color in schools? Very important/Somewhat important/Not important at all/Don't know/Refused",
  "What's your opinion about reparations for descendants of slaves? Strongly agree/Somewhat agree/Neither agree nor disagree/Somewhat disagree/Strongly disagree/Refused",
  "To what extent do you think white privilege exists in our society? A great deal/A fair amount/Just a little/Not at all/Don't know/Refused",
  "Do you agree that police departments tend to treat people of color unfairly compared to white people? Strongly agree/Slightly agree/Neutral/Slightly disagree/Strongly disagree/Refused",
  "Do you think alternative terms like 'all lives matter' undermine the focus of racial inequality faced by black people? Completely agree/Generally agree/Might or might not agree/Generally disagree/Completely disagree/Refused",
  "Are you in support of policies to defund the police as a way to address racial injustice? Definitely yes/Mostly yes/Neutral/Mostly no/Definitely no/Refused",
  "Do protests and demonstrations contribute meaningfully to the improvement of race relations? Always/Most of the time/Sometimes/Rarely/Never/Refused",
  "Do you believe that the media fairly represents all races in our society? Definitely yes/Most of the time/Once in a while/Never/Not sure/Refused",
  "To what extent do you agree that immigrants of color face racial discrimination upon arrival in our country? Strongly agree/Moderately agree/Slightly agree/Neutral or don't know/Slightly disagree/Moderately disagree/Strongly disagree/Refused",
  "Do you think racial inequality contributes to healthcare disparities? Yes, greatly/Yes, somewhat/Not sure/No, not really/No, not at all/Refused",
  "To what degree do you think voting laws in certain states disadvantage minority voters? A lot/Moderately/A little/None at all/Not sure/Refused",
  "Do you believe we live in a post-racial society, where everyone has equal opportunities regardless of their race? Completely agree/Mostly agree/Somewhat agree/Slightly agree/Not at all agree/Refused",
  "Should institutions be held accountable for their historical role in perpetuating racial discrimination and be required to make amends? Definitely yes/Probably yes/Not sure/Probably no/Definitely no/Refused",
  "How much do you think racial bias factors into the wage gap? Greatly/Somewhat/Very little/Not at all/Refused",
  "Do you agree that racial stereotypes still prominently exist and affect the perception of individuals? Entirely agree/Generally agree/Undecided/Generally disagree/Entirely disagree/Refused",
  "Should critical race theory be taught in schools to help students understand systemic racial bias? Definitely yes/Mostly yes/Unsure/Mostly no/Definitely no/Refused",
  "Do you believe the War on Drugs has disproportionately targeted communities of color? Strongly agree/Agree/Neither agree nor disagree/Disagree/Strongly disagree/Refused",
  "In terms of racial justice, how do you suggest we should dismantle systemic racism in our society?",
  "What's your point of view on affirmative action policies that benefit those who are subjected to discrimination in education and employment?",
  "Would you concur that microaggressions, subtle forms of racism, are significant in perpetuating racial inequality in our society?",
  "Given that your skin color is different from most other people, have you ever felt uncomfortable, unwelcome or out of place in public spaces? Yes, have felt this/No, have not felt this/Refused.",
  "Explain your position on whether the police are more likely to use excessive force against people of different racial backgrounds.",
  "Do you agree that through reparations, society should compensate for past racial injustices, such as slavery and segregation? Yes/No/Refused.",
  "What's your take on current efforts to make school curriculums more inclusive of different racial backgrounds and histories?",
  "Can you elaborate on whether white privilege exists, and how that impacts racial inequality?",
  "How do you feel about the term 'colorblind', often used in the context of race and discrimination?",
  "Could you provide your perspective on how casual racism contributes to systemic injustice?",
  "Do you support policies that target the racial wealth gap, such as race-conscious taxation or reparations? Yes/No/Refused.",
  "What's your viewpoint on race-based admissions in universities and colleges - as a method to counteract systematic disadvantages faced by racial minorities?",
  "In terms of racial fairness, comment on the phenomenon of 'White Savior Complex'.",
  "Relating to criminal justice reform, how would you address racial disparities in prison sentencing?",
  "Have you ever felt you were treated differently because of your racial or ethnic background in a professional setting? Yes, have felt this/No, have not felt this/Refused.",
  "What is your perspective on the current public discourse and media representation about race and racism?",
  "How do you see the role of racial prejudice in contemporary politics?",
  "Have you ever called out or reported a racially discriminatory act at your workplace or school? Yes, have done this/No, have not done this/Refused.",
  "What are your thoughts on teaching controversial topics related to race in schools?",
  "Given your stand on racial inequality, what solutions you propose to achieve racial harmony in our communities?",
  "In your opinion, how often do you believe racial and ethnic discrimination are factors in hindering equal opportunities for individuals? Always/Often/Sometimes/Never/Refused",
  "In terms of racial equality, how would you rate the current administration's actions and policies? Very effective/Somewhat effective/Not effective at all/Don't know/Refused",
  "Do you think affirmative action policies in college admissions are needed to level the playing field? Yes/No/Don't know/Refused",
  "How important is it to have racial and ethnic representation in our government bodies? Very/Somewhat/Not at all/Don't know/Refused",
  "How do you perceive the Black Lives Matter movement's impact on the nationwide discussion about race? Positive/Negative/No impact/Don't know/Refused",
  "Have you ever been discriminated against because of your race or ethnicity? Yes/No/Don't wish to answer/Refused",
  "Do you believe that police departments across the country treat all racial and ethnic groups equally? Always/Often/Sometimes/Never/Refused",
  "Do you think systemic racism is an issue that needs addressing in the United States? Yes/No/Not sure/Refused",
  "Is sufficient effort being made to achieve racial equality in the United States? Yes/ No/Don't know/Refused",
  "Do you believe immigrants from diverse racial and ethnic backgrounds strengthen or weaken American society? Strengthen/Weaken/Neither/Refused",
  "Should employers prioritize diversity in the workplace? Yes/No/Not necessary/Refused",
  "How has your understanding or perception of race changed in the light of recent social and racial justice movements? Much more understanding/More understanding/Has not changed/Refused",
  "Do you believe that racial harmony is possible in our society? Yes/No/Don't know/Refused",
  "Would your political ideology be influenced by a candidate's stance on racial equality? Yes/No/Don't know/Refused",
  "How much does race influence your personal and professional interactions? A lot/Some/Not much/Not at all/Refused",
  "Do you feel that racial and ethnic diversity should be considered in educational curriculum? Yes/No/Don't know/Refused",
  "How frequently do you encounter discussions or content about race in your use of social media? Always/Often/Sometimes/Never/Refused",
  "Would you be comfortable having an open conversation about race with someone of a different race or ethnicity? Yes /No /Don't know /Refused",
  "Do you believe that acknowledging and talking about racial and ethnic differences can lead to better understanding and harmony? Yes/No/Don't know/Refused",
  "How confident are you about unequivocally communicating your stand on racism to your close associates or family members? Very confident/Somewhat confident/Not confident/Don't know/Refused",
  "From your perspective, do you think the racial tensions in the United States have increased, decreased, or stayed the same in recent years? Increased/Decreased/Stayed the same/Refused",
  "Is focusing on identity politics beneficial or harmful to the societal harmony? Beneficial/Harmful/Both/Refused",
  "Should racial issues be addressed more at an individual or at a systemic level? Individual/Systemic/Both/Refused",
  "Do you perceive affirmative action as a necessary step towards equality or as a form of reverse discrimination? Necessary step towards equality/Reverse discrimination/Both/Refused",
  "Are the inequalities suffered by ethnic minorities due more to individual prejudices or systemic discrimination? Individual Prejudices/Systemic Discrimination/Both/Refused",
  "In your view, will improving educational opportunities for minorities significantly reduce racial disparities? Yes/No/Both/Refused",
  "Do you think ethnic communities should make an effort to assimilate into the dominant culture or keep their unique cultural traditions? Assimilate/Keep cultural traditions/Both/Refused",
  "Are cultural appropriation and cultural appreciation the same thing? Yes/No/Refused",
  "Do you believe in the concept of white privilege - the inherent advantages possessed by a white person on the basis of their race in a racially divided society? Yes/No/Unsure/Refused",
  "Would you say that people of color have equal opportunities in all fields such as education, employment, and housing in our society today?",
  "Do you think affirmative action policies are necessary to counteract the effects of past racial discrimination, or do they unfairly favor certain races over others?",
  "How significantly do you think racial profiling by the police and judicial system impacts people of color? Is it a major, minor, or non-existing issue?",
  "What's your perspective on the 'Black Lives Matter' movement? Do you see it as a necessary civil rights movement or as causing unnecessary divisions in society?",
  "How do you perceive systemic racism? Do you consider it a real issue in our society or a socially constructed concept?",
  "Do you believe that white privilege exists in our society? If yes, are white people generally aware of their privilege, or do they tend to overlook it?",
  "In your opinion, does the current political climate favor a certain race over others, or is it equally beneficial or detrimental to all races?",
  "Are you of the belief that racism is still prevalent in America, or has the situation improved dramatically in recent years?",
  "What is your stand on the wealth gap between white people and people of color? Do you see it as a product of racial discrimination or economic disparity?",
  "Do race-specific scholarships in universities promote diversity, or are they a kind of discrimination against other races?",
  "From your perspective, are racial stereotypes more harmful in reinforcing bias and discrimination, or are they harmless generalizations?",
  "Is there a certain race unfairly depicted in the media and entertainment industry, or are all races equally represented and treated?",
  "How do you interpret racial microaggressions? Are they unintentional and harmless or are they subtle forms of racism?",
  "Do you believe that talking about racial issues stirs up more racial animosity, or does it create room for understanding and solving these issues?",
  "How do you think the immigration policies of our country affect people of Hispanic origin? Do they provide fair opportunities or pose significant challenges?",
  "How influential do you think a person's race is in deciding the outcome of political elections in our country?",
  "Do you agree that people of color are underrepresented in positions of power and decision-making roles in our society?",
  "In your opinion, does the educational system in our country perpetuate racial inequalities, or does it strive to eliminate them?",
  "How do you perceive the 'white supremacy' ideology? Do you believe it's prevalent in our society or is it limited to a small group of extremists?",
  "What is your stance on hate speech and hate crimes? Do you see them as an ever-growing threat for racial minorities, or is their occurrence overblown?",
  "Should people be rewarded based on their merits, or should additional consideration be given to underrepresented minorities? Reward based on merits/Reward additionally underrepresented minorities/Both/Neither/Not sure/Refused",
  "Do you feel that Affirmative action is fair or unfair to White people? Very fair/Mostly fair/Mostly unfair/Very unfair/Not sure/Refused",
  "How confident are you in the ability of our judicial system to treat people of all races equally? Very confident/Somewhat confident/Not very confident/Not at all confident/Refused",
  "Do you believe that people of color are generally treated less fairly than white people in the workplace? To a great extent/To some extent/Not too much/Not at all/Refused",
  "How accepting are people in your neighborhood of race or ethnic groups different from their own? Very accepting/Somewhat accepting/Not very accepting/Not accepting at all/Refused",
  "Do you believe that Black people have the same opportunities as White people to get ahead in life? Completely agree/Partially agree/Partially disagree/Completely disagree/Refused",
  "How likely do you think it is that racial tension in the United States will influence the 2024 Presidential Election? Very likely/Moderately likely/Unlikely/Very Unlikely/Refused",
  "Do you feel that racism is a significant problem in modern day America? Yes, it is a significant problem/Yes, but not a significant problem/No, it's not a problem/Not sure/Refused",
  "What impact does the portrayal of races in the media have on societal discrimination? Great impact/Some impact/Little impact/No impact/Not sure/Refused",
  "Do you believe that police are more likely to use deadly force against Black people than White people? Much more likely/Somewhat more likely/Somewhat less likely/Much less likely/Refused",
  "Would you support additional funding to improve the conditions of schools in predominantly Black and Latino neighborhoods? Strongly support/Somewhat support/Somewhat oppose/Strongly oppose/Refused",
  "How would you perceive a government mandated effort to ensure diversity in corporate leadership? Highly favorable/Somewhat favorable/Somewhat unfavorable/Highly unfavorable/Refused",
  "Will providing reparations for descendants of slaves improve race relations in the United States? Definitely improve/Probably improve/Probably not improve/Definitely not improve/Refused",
  "How necessary is it to teach about the history of racism and racial discrimination in schools? Extremely necessary/Somewhat necessary/Not very necessary/Not at all necessary/Refused",
  "How impactful do you believe the \"Black Lives Matter\" movement has been in promoting racial equality? Very impactful/Somewhat impactful/Not very impactful/Not at all impactful/Refused",
  "Do you agree with the removal or renaming of statues and symbols that represent historical racial prejudice? Strongly agree/Somewhat agree/Somewhat disagree/Strongly disagree/Refused",
  "Do you believe that the current immigration policy favors certain races? Yes, it does favor certain races/No, it does not favor any particular race/Not sure/Refused",
  "Would you endorse strengthened laws and regulations to prevent racial discrimination in housing? Strongly agree/Somewhat agree/Somewhat disagree/Strongly disagree/Refused",
  "Do you view the election of America's first Black president, Barack Obama, as a significant step towards racial equality? Significant step/Somewhat significant/Insignificant/Not sure/Refused",
  "Please express your opinion on the following statement: Affirmative action is necessary to balance historical racial disadvantages. Strongly agree/Agree/Neutral/Disagree/Strongly disagree",
  "Can you share your thoughts about this statement: Police officers tend to unfairly target racial minorities. Agree/Disagree/Not sure",
  "What do you think about the assertion that reparations should be made to the descendants of slaves? Strongly agree/Agree/Neutral/Disagree/Strongly disagree",
  "Your views, please, on this statement: Children should be taught about systemic racism from an early age. Strongly agree/Agree/Neutral/Disagree/Strongly disagree",
  "Share your thoughts about this: People of color are underrepresented in politics and policy decision-making. Likely/Unlikely/Not Sure",
  "Reflect on this statement: Ethnic and racial discrimination is a severe problem in our society. Strongly agree/Agree/Neutral/Disagree/Strongly disagree",
  "How do you feel about the proposition that \"White Privilege\" exists and significantly impacts opportunities for people of color? Agree/Disagree/Not Sure",
  "For each phrase, please state if you think it is defensible: Saying \"All Lives Matter\" in response to \"Black Lives Matter\". Always acceptable/Sometimes acceptable/Rarely acceptable/Never acceptable/Not sure",
  "Please elaborate your opinion on this statement: Cultural appropriation is a form of racism. Agree/Disagree/Unsure",
  "Can you comment on this phrase: Disregarding race in everyday discussions is a form of racism? Agree/Disagree/Undecided",
  "How would you respond to this statement: Celebrities should speak up about racial issues. Always appropriate/Sometimes appropriate/Rarely appropriate/Never appropriate/Not Sure",
  "Your viewpoint is required on: The media often perpetuates harmful racial stereotypes. Sure/Not Sure/Refused",
  "Please comment on the following: Historical monuments and statues honoring controversial figures should be removed. Agree/Disagree/Undecided",
  "What's your take on: The educational system is biased against students of color. Agree/Disagree/Don't Know",
  "Do you concur with this statement: Residential segregation by race is still a significant issue. Agree/Disagree/Not Sure",
  "Please reflect on the following sentence: Racial microaggressions are harmful and perpetuate discrimination. Agree/Disagree/Unsure",
  "Please express your opinion on: The justice system is prejudiced against people of color. Always True/Sometimes True/Rarely True/Never True/Unsure",
  "Your views on this, please: Employers should strive for racial diversity in the workplace. Always necessary/Sometimes necessary/Rarely necessary/Never necessary/Not Sure",
  "What do you think about this statement: The use of affirmative slurs in art and literature is acceptable because of freedom of speech. Always acceptable/Sometimes acceptable/Rarely acceptable/Never acceptable/Not sure",
  "Please comment on the following: Political leaders should apologize for the past racial injustices committed by their nations. Agree/Disagree/Unsure",
  "Could you discuss the impact of gentrification in predominantly minority neighbourhoods? Is this a positive development or a negative one?",
  "In your perspective, is affirmative action an effective strategy to address racial disparities in education and employment?",
  "The NFL recently adopted policies to increase the number of minority coaches. Do you view this as a step forward or an unnecessary intervention?",
  "Share your thoughts on 'color-blind' theories? Does it promote unity or mask the reality of racial disparities?",
  "How do you see the role of black-led organizations like Black Lives Matter in the fight against racism? Are they helpful or counterproductive?",
  "Could you explain if racial disparities in criminal justice in the US are evidence of systemic racism or the result of individual behaviors?",
  "The Oscars have been recently criticized for their lack of representation of racial minorities. Do you find this critique valid or overstated?",
  "What is your perspective on reparations for descendants of slaves? Are these necessary for justice or an overstep of government intervention?",
  "Do you believe that teaching about the history of racial discrimination in schools could encourage unity or foster division in young students?",
  "How valid do you find the argument that the war on drugs has disproportionately targeted racial minorities?",
  "Discuss your view on cultural appropriation. Is it a form of flattery or offensive to the cultures being appropriated?",
  "Please weigh in on the debate around removing Confederate statues and symbols. Is it preserving history or glorifying racism?",
  "What are your thoughts on the movement to defund the police? Does it lead to racial justice or create public safety issues?",
  "Is the racial wealth gap primarily a result of systemic racism or individual choices?",
  "Do you agree that racial minorities have equal opportunities for success in the US or are there systemic barriers?",
  "Do you think the focus on diversity and inclusion in the workplace has gone too far or is still lacking?",
  "Is the Black Lives Matter movement causing more division or creating more awareness about racial injustice?",
  "What's your viewpoint on systemic racism? Is it existent and impactful or is it exaggerated?",
  "Do you believe police officers are more likely to use force against racial minorities or do they treat all equally?",
  "Considering the racial dynamics today, how likely would it be for people of different races to have an honest and open dialogue on race issues? Very likely/Possible but difficult/Not likely at all/Refused",
  "Reflecting on your nation's history, do you believe the sins of the past such as slavery affect the present dynamics of race relations? Yes, significantly/Yes, but moderately/No, the past doesn't affect the present/Refused",
  "Given the social and political climate, do you think laws and policies need to change to ensure racial equality? Yes, many drastic changes are needed/Yes, but only small adjustments are needed/No, the laws are already in place but not effectively applied/There is no need for change/Refused",
  "If there was a proposal for reparations for descendants of slaves in your country's legislature, would you support it? Yes, fully/Yes, but with reservations/No, not at all/Refused",
  "What is your opinion on racial quotas in educational institutions? I fully support it/I support it but think it needs modifications/I do not support it/Refused",
  "Do you believe in the existence of white privilege in your society? Yes, undoubtedly/Yes, but it's overstated/No, it doesn't exist/Refused",
  "How would you describe the conditions of racial minorities in your community? Very good/Good/Not so good/Bad/Not certain/Refused",
  "Has your work environment ever imposed on you to confront instances of racism or racial bias? Yes, often/Yes, but rarely/No/Refused",
  "Have you taken steps to educate yourself about the history and culture of different racial groups? Yes, regularly/Yes, occasionally/No/Refused",
  "Do you believe affirmative action policies are still necessary for marginalized racial communities in your country? Yes, absolutely/Yes, but they need reformation/No, they're no longer necessary/Refused",
  "Have you ever been criticized or called out for displaying racial bias, even if unintentional? Yes, frequently/Yes, on occasion/Never/Refused",
  "Have you ever boycotted or criticized a brand, celebrity, or public figure for allegations of racism? Yes, often/Yes, occasionally/Never/Refused",
  "In your opinion, is racial strife or harmony more evident in your society? More strife/More harmony/Equally both/Neither present/Refused",
  "Do you believe systemic racism is ingrained in the institutions of your country? Yes, deeply/Yes, to some extent/No/Refused",
  "Are you comfortable talking about race openly with friends, family, or colleagues? Yes, always/Yes, with some people/No, I avoid it/Refused",
  "Do you think racial humor, even if unfavourable, is harmless? Yes, always/Yes, if not intended to harm/No, it's always harmful/Refused",
  "Have you ever been influenced in your voting decisions due to a candidate's stand on racial issues? Yes, frequently/Yes, occasionally/Never/Refused",
  "How do you view the growth of racial activism in recent years? Very positive/Positive/Could be better/Negative/Very negative/Refused",
  "Would you support policies that help immigrants of color adjust better in your society? Yes, without hesitation/Yes, but it depends on the policy/No/Refused",
  "What impact do you think white privilege has on the racial disparities experienced in American society? Significant/Moderate/Minimal/None at all/Refused",
  "How much do you agree or disagree with the statement that reverse racism is a problem in our society today? Strongly agree/Agree/Neither agree nor disagree/Disagree/Strongly disagree/Refused",
  "In your opinion, does systematic racial discrimination exist in the United States? It definitely exists/It somewhat exists/It doesn't really exist/It doesn't exist at all/Refused",
  "Do you perceive the Black Lives Matter movement as a legitimate struggle for equality or an unnecessary divisive force? A struggle for equalityUnnecessarily divisive/Neither/Both/Refused",
  "How would you say America's legacy of slavery impacts the living conditions for black Americans today? Significant impact/Moderate impact/Minimal impact/No impact/Refused",
  "Would you agree that police brutality disproportionately affects racial and ethnic minorities in the U.S.? Strongly agree/Agree/Neither agree nor disagree/Disagree/Strongly disagree/Refused",
  "Do you support or oppose the removal of Confederate symbols from public places? Strongly support/Support/Neither support nor oppose/Oppose/Strongly oppose/Refused",
  "Do you believe racial profiling by law enforcement is a widespread issue? Very widespread/Somewhat widespread/Not very widespread/Not widespread at all/Refused",
  "What are your views on the use of Native American symbols as sports mascots? Highly appropriate/Appropriate/Neither appropriate nor inappropriate/Inappropriate/Highly inappropriate/Refused",
  "Do you think that the war on drugs has unfairly targeted people of color? Yes, definitely/Yes, somewhat/No, not so much/No, not at all/Refused",
  "Would you say your political views lean more towards supporting the rights of ethnic minorities or towards maintaining traditional values? More towards ethnic minorities/Equally for both/More towards traditional values/Neither/Refused",
  "How do you feel about the impact of immigration on the racial dynamics of the country? Positively/Negatively/Mixed feelings/No impact/Refused",
  "In terms of employment, do you think people of color face discrimination in the hiring process? Often/Sometimes/Rarely/Never/Refused",
  "How influential do you think the media is in shaping public opinion about race and ethnicity? Extremely influential/Very influential/Somewhat influential/Not very influential/Not influential at all/Refused",
  "Do you believe that racial and ethnic diversity strengthens the fabric of our society? Definitely strengthens/Somewhat strengthens/Neither strengthens nor weakens/Weakens/Significantly weakens/Refused",
  "Do you agree that it's important to consider a person's race when making decisions about hiring and promotions (to promote diversity)? Strongly agree/Agree/Neither agree nor disagree/Disagree/Strongly disagree/Refused",
  "How much do you think a person's race shapes their opportunities in life? A great deal/A lot/A moderate amount/A little/Not at all/Refused",
  "What are your thoughts on affirmative action policies designed to help African Americans and other minorities in areas like employment or education? Strongly in favor/Somewhat in favor/Neutral/Somewhat opposed/Strongly opposed/Refused.",
  "Have you ever been in a situation where your opinions on racial issues were challenged or contradicted? Yes, have experienced this/No, have not experienced this/Refused",
  "How much, if at all, do you think racial tensions impact daily politics in America? A lot/Some/Not much/Not at all/Refused",
  "On a scale of 1-5, how would you rate the need for federal legislation addressing systemic racism in the U.S.? 1- Not at all needed, 5- Extremely needed.",
  "Do you believe police brutality disproportionately affects minorities? Yes/No/Not sure/Refused.",
  "Has your race or ethnicity influenced your political affiliation? Highly influenced/Moderately influenced/Slightly influenced/Did not influence at all/Refused.",
  "Have discriminatory laws or policies of the past affected your perception of the current political climate? Yes, they have/No, they have not/Not sure/Refused.",
  "Do you feel political parties adequately address the needs and concerns of people of your race or ethnicity? Yes, they do/No, they don’t/Not sure/Refused.",
  "In the United States, has the debate surrounding the \"Black Lives Matter\" movement influenced your political views? Yes, it has/No, it hasn’t/Unsure/Refused.",
  "Do you see a strong correlation between immigration policies and race relations? Yes/No/Not sure/Refused.",
  "In what ways, if any, has the racial diversity in your community influenced your political outlook? A lot/Some/Not much/Not at all/Refused.",
  "Do you feel the need for more racial representation in the political leadership of the country? Very much so/Some somewhat/Not really/Not at all/Refused.",
  "Have you ever advocated for a political cause or politician based on their stance on racial equality? Yes, I have/No, I haven’t/Refused.",
  "Do you think racial disparities should have a more prominent position in public policy discussions? Definitely yes/Maybe/Undecided/Probably not/Definitely not/Refused.",
  "How connected do you feel with political issues concerning other racial or ethnic groups? Very connected/Moderately connected/Neither connected nor disconnected/Slightly disconnected/Not connected at all/Refused.",
  "How justified do you think are the concerns of racial minorities about unequal treatment in American society? Fully justified/Partially justified/Neither justified nor unjustified/Slightly unjustified/Not justified at all/Refused.",
  "Do you believe being aware of white privilege is important for understanding contemporary politics and racial issues? Yes, it's essential/It's somewhat important/It's not necessary/It's unimportant/I'm not sure/Refused.",
  "How well understood do you think the challenges faced by racial minorities are in the political arena? Very well understood/Understood to some extent/Neither understood nor misunderstood/Misunderstood to some extent/Very misunderstood/Refused.",
  "Does your racial or ethnic background encourage or discourage your political involvement? Strongly encourage/Encourage/Neither encourage nor discourage/Discourage/Strongly discourage/Refused.",
  "How much influence, if any, do you think policy regarding racial justice has on your daily life? Significant/Somewhat/Little to None/None at all/",
  "Do you think the state of race relations in our country has gotten better or worse over the past decades? Better/Worse/Stayed the same/",
  "Have you ever felt uncomfortable due to discussions about race? Sometimes/All the time/Never/",
  "What's your frequency of interaction with people of different races? Daily/Weekly/Annually/Never/",
  "Do you think law enforcement agencies treat all racial groups equally? Yes/No/Undecided/",
  "Is racial profiling a significant concern today? Yes/No/Not Sure/",
  "Do you believe the media accurately represents all races? Yes/No/Don't Know/",
  "How often do issues of racial inequality feature in political discussions? Always/Usually/Sometimes/Never/",
  "Do you support racial equality activism such as the Black Lives Matter Movement? Strongly Support/Support/Neutral/Oppose/Strongly Oppose/",
  "What do you think about affirmative action programs intended to increase opportunities for minorities in education and employment? Do you believe this is necessary to level the playing field? Highly necessary/Necessary/Unnecessary/Highly unnecessary/Refused",
  "Imagine in the context of racial equality, do laws concerning voting rights, such as Voter ID laws, have more of an effect on advancing or hindering equality? Advancing/Hindering/No significant effect/Refused",
  "Suppose there was a racial incident in your community, to what extent would you support peaceful protests? Strongly support/Support/Do not support/Strongly do not support/Refused",
  "How do you view the Black Lives Matter movement? Do you see it as a legitimate call for racial justice or an overreaction to isolated incidents? Legitimate call for justice/Overreaction to isolated incidents/Don't Know/Refused",
  "How much do you believe systemic racism plays a role in the economic inequality among races in America? Big role/Moderate Role/No Role at all/Refused",
  "What's your perspective on reparations for descendants of slaves? Supports strongly/Supports/Opposes/Opposes strongly/Refused",
  "If there were a proposal to invest more in housing, healthcare, and education in minority communities to address racial imbalance, where would you stand? Strongly support/Support/Oppose/Strongly oppose/Refused",
  "How significant do you think the issue of police brutality is against minorities in America? Very significant/Significant/Not significant/Not at all significant/Refused",
  "What do you think of the influence of race on a person's ability to access quality healthcare? Major influence/Minor influence/No influence/Refused",
  "Do you believe cultural diversity adds value to our society, or does it contribute to social division? Adds value/Contributes to social division/Both in equal measure/Refused",
  "Do you think racial stereotyping in media and arts can be harmful or benign? Harmful/Benign/No particular effect/Refused",
  "Do you agree with the notion that 'White privilege' is a real phenomenon that affects societal structures and opportunities? Agree strongly/Agree/Disagree/Disagree strongly/Refused",
  "What is your stand on genetical theories asserting that there are inherent differences among races? Support/Oppose/Neither support nor oppose/Refused",
  "How much weight do you put on the argument that American history, as taught in schools, underrepresents the experiences and contributions of people of color? A lot of weight/Adequate weight/Not much weight/No weight at all/Refused",
  "Do you think that a greater emphasis on multilingualism and multiculturalism in the curriculum of schools would promote greater racial harmony? Definitely/Maybe/Unlikely/Definitely not/Refused",
  "What do you feel about the racial wealth gap in America? Alarming/Concerning/Unimportant/No feelings towards it/Refused",
  "What are your thoughts on the notion that minorities are sometimes overrepresented in negative social statistics due to systemic bias rather than personal failure? Agree/Disagree/Neither agree nor disagree/Refused",
  "How important do you think it is to increase minority representation in influential spheres, such as politics, the arts, and corporate leadership? Extremely important/Moderately important/Not at all important/Refused",
  "Do you feel that improving race relations should be a top priority for the government of your country? Yes/No/Maybe/Refused",
  "How often do you think Asian people in the United States have been victims of discrimination due to their race or ethnicity? Very often/Often/Sometimes/Rarely/Never/Refused",
  "How much do you believe the African American community in the United States is adversely affected by the current systems of power? Greatly affected/Moderately affected/Poorly affected/Barely affected/Not affected at all/Refused",
  "How often do you believe individuals of Hispanic or Latino heritage are disproportionately affected by immigration policies? Very often/Often/Sometimes/Rarely/Never/Refused",
  "Do you believe racial bias influences who gets stopped by the police in the United States? A great deal/A lot/A moderate amount/A little/Not at all/Refused",
  "Would you say that redlining is a significant factor contributing to the racial wealth gap in the United States? Significantly contributes/Contributes moderately/Contributes a little/Does not contribute/Refused",
  "How greatly do you believe hiring biases against individuals of Middle Eastern background affect their career progress in the United States? Affects a great deal/Affects a lot/Affects moderately/Affects a little/Not at all/Refused",
  "How often do you think Native American communities in the United States are marginalized by mainstream media representation? Very often/Often/Sometimes/Rarely/Never/Refused",
  "Do you feel that the schooling system in the United States treats students from different racial backgrounds equally? Treated very equally/Treated mostly equally/Treated somewhat equally/Treated a little equally/Not treated equally at all/Refused",
  "How harmful do you think the practice of racial profiling is to the fabric of American society? Very harmful/Harmful/Moderately harmful/Not very harmful/Not harmful at all/Refused",
  "Do you believe that affirmative action policies in the United States give unfair advantages to minority groups? Very unfair/Unfair/Neither unfair nor fair/Fair/Very fair/Refused",
  "How often do you think institutional racism affects access to quality healthcare for racial minorities? Very often/Often/Sometimes/Rarely/Never/Refused",
  "How widespread do you think microaggressions against persons of Asian origin are in U.S. workplaces? Extremely widespread/Very widespread/Moderately widespread/Slightly widespread/Not at all widespread/Refused",
  "How frequently do you believe racial bias affects decisions in the U.S. criminal justice system? Very frequently/Frequently/Sometimes/Rarely/Never/Refused",
  "Do you feel that Indigenous cultures are adequately represented in U.S. history textbooks? Very adequately/Adequately/Neither adequately nor inadequately/Inadequately/Very inadequately/Refused",
  "To what extent do you believe entrenched biases perpetuate the gender wage gap for women of color? To a great extent/To a considerable extent/To a moderate extent/To a minor extent/Not at all/Refused",
  "How damaging do you believe the model minority stereotype is to the collective identity of Asian Americans? Very damaging/Damaging/Somewhat damaging/Not very damaging/Not damaging at all/Refused",
  "What impact do you think racial diversity in politics has on the overall progress of the nation- significantly positive/ moderately positive/ no impact/ moderately negative/ significantly negative/ refused?",
  "Do you believe privileges exist as a result of one's race in today's society- strongly agree/ agree/ no opinion/ disagree/ strongly disagree/ refused?",
  "Evaluate the statement- Intense discussion of race and race relations is need of the hour- strongly agree/ agree/ no opinion/ disagree/ strongly disagree/ refused.",
  "Would legal policies enforcing racial equality and diversity contribute to less racial discrimination- strongly agree/ agree/ no opinion/ disagree/ strongly disagree/ refused?",
  "Should more resources be allocated to fighting systemic racism- definitely/ maybe/ not necessary/ does not apply/ refused?",
  "Are racial issues receiving the necessary media attention or are they sidelined- receiving necessary attention/ over-emphasized/ under-emphasized/ not sure/ refused?",
  "In what light do you see the cultural appropriation of another race's traditions- respectful imitation/ an unimportant issue/ a demeaning practice/ unsure/ refused?",
  "Is the school curriculum doing enough to educate students about racial issues- absolutely/ somewhat/ not enough/ not necessary/ refused?",
  "What's your take on affirmative action policies regarding race in college admissions- strongly support/ somewhat support/ neutral/ somewhat oppose/ strongly oppose/ refused?",
  "Do you believe that racial bias is ingrained in law enforcement practices- strongly agree/ agree/ no opinion/ disagree/ strongly disagree/ refused?",
  "Would you support political candidates who prioritize addressing racial disparities- definitely/ probably/ indifferent/ probably not/ definitely not/ refused?",
  "Should companies be forced to disclose their workforce's racial makeup- definitely/ probably/ indifferent/ probably not/ definitely not/ refused?",
  "Do you think the wealth gap between races is currently a severe problem in society- strongly agree/ agree/ no opinion/ disagree/ strongly disagree/ refused?",
  "Do the terms 'White Privilege' and 'White Guilt' contribute positively or negatively to racial discourse-positive/mostly positive/neutral/mostly negative/negative/refused?",
  "Are racial minorities being adequately represented in political leadership- fully represented/ not adequately represented/ not at all represented/ unsure/ refused?",
  "Does the racial bias in healthcare access and treatment concern you- strongly concerned/ somewhat concerned/ neutral/ somewhat unconcerned/ not at all concerned/ refused?",
  "Should there be a federal holiday to commemorate the end of chattel slavery- certainly/ it's acceptable/ indifferent/ it's unnecessary/ strongly disagree/ refused?",
  "Is racial diversity in school teachers important for students- extremely important/ somewhat important/ neutral/ somewhat unimportant/ completely unimportant/ refused?",
  "Suggest if the housing policies should be adjusted to reduce racial segregation- urgently needed/ somewhat needed/ neutral/ not necessary/ strongly oppose/ refused?",
  "What’s your take on affirmative action programs that favor minorities in admissions to colleges and universities? Strongly favor/Favor/Oppose/Strongly oppose/No opinion",
  "Do you agree or disagree that racial discrimination is the main reason why many black people can't get ahead these days? Agree/Disagree/Neither agree nor disagree/Don't know",
  "How often would you say you think about race and racial inequalities? Always/Often/Sometimes/Rarely/Never/Unsure",
  "Do you feel that the government is doing enough to address issues related to racial discrimination? Very satisfied/Satisfied/Neutral/Dissatisfied/Very Dissatisfied/Not sure",
  "Do you agree that racially diverse workplaces yield better results and outcomes? Strongly agree/Agree/Neither agree nor disagree/Disagree/Strongly disagree",
  "In your perception, have race relations in our country improved, worsened, or stayed the same over the last decade? Improved/Worsened/Stayed the same/Don't know",
  "How do you feel about the Black Lives Matter movement? Very positive/Positive/Neutral/Negative/Very Negative/No Opinion",
  "How comfortable are you discussing race-related issues in public or in your community? Very comfortable/Comfortable/Neutral/Uncomfortable/Very Uncomfortable/Unsure",
  "Do you think it's important to acknowledge and discuss \"white privilege\" as a part of conversations about race equality? Very important/Important/Neutral/Unimportant/Very Unimportant/Unsure",
  "What are your views on gentrification in regard to racial disparities? Very positive/Positive/Neutral/Negative/Very Negative/Unsure",
  "Do you feel police in your local community treat people fairly regardless of their race? Yes/No/Unsure",
  "What is your view on the racial wealth gap issue? Needs immediate attention/Important but not immediate/Neutral/Not a priority/Don't know",
  "Do you believe that representation of all races in media and entertainment is significant? Very significant/Significant/Neutral/Not significant/Not significant at all/Don't know",
  "Do you think that certain races are underrepresented in politics? Yes/No/Unable to determine/Refused",
  "Do you believe that school curricula should include more education about race and racial relations? Strongly agree/Agree/Neither agree nor disagree/Disagree/Strongly disagree/Don't know",
  "What is your perception about microaggressions and their impact on people from different racial backgrounds? Significant impact/Minor impact/No impact at all/Don't know",
  "Are you familiar with the term \"systemic racism,\" and do you believe it's an issue that needs to be addressed? Yes, familiar and believe it's an issue/Yes, familiar but don't think it's an issue/Not familiar/Refused",
  "Does your racial or ethnic identification influence where you choose to live or where you would like to in the future? Yes, it does/No, it does not/Refused",
  "Do you believe that your race has a major impact on the opportunities you have access to? Yes, I do/No, I do not/Refused",
  "Has your perception of your own race or ethnicity changed drastically over your lifetime? Yes, it has/No, it has not/Refused",
  "Are you mostly surrounded by friends or family who belong to the same race as you? Yes, I am/No, I am not/Refused",
  "Do you feel that your race affects how other people perceive you socially and professionally? Yes, I do/No, I do not/Refused",
  "Do you believe that people of all races are treated equally in your country? Yes, I do/No, I do not/Refused",
  "Do you feel that your ethnicity plays a significant role in shaping your political views? Yes, it does/No, it does not/Refused",
  "Would you sacrifice some of your own comfort or resources to achieve racial equality? Yes, I would/No, I would not/Refused",
  "Do you feel pride in your racial or ethnic heritage? Yes, I do/No, I do not/Refused",
  "Should the government be doing more to ensure racial equality? Yes, it should/No, it should not/Refused",
  "Have you ever benefited or suffered from racial stereotyping? Yes, I have/No, I have not/Refused",
  "Have you ever been accused of behaving in a way that reflects a stereotype related to your race or ethnicity? Yes, I have/ No, I haven't/Refused",
  "Do you believe that certain political parties are more supportive of racial and ethnic equality than others? Yes, I do/ No, I do not/Refused",
  "Do you believe that individuals of a different race receive different treatment in societal institutions? Yes, I do/ No, I don't/Refused",
  "Have you ever had to teach your children about racism, because of the color of their skin? Yes, I have/ No, I haven't/Refused",
  "Have you ever felt the need to suppress your ethnic customs in order to fit in? Yes, I have/ No, I haven't/Refused",
  "Do you feel that there is still progress to be made with racial equality in your country? Yes, I do/ No, I don’t/Refused",
  "How frequently do you think affirmative action policies benefit or disadvantage certain racial groups? Very Often/Often/Sometimes/Rarely/Never/Refused",
  "How favorably do you view the Black Lives Matter movement? Very favorably/Somewhat favorably/Neutral/Somewhat unfavorably/Very unfavorably/Refused",
  "Is racial profiling used in law enforcement acceptable in certain circumstances or never acceptable? Always acceptable/Sometimes acceptable/Rarely acceptable/Never acceptable/Not sure/Refused",
  "How much has the country's history of racial segregation impacted present day racial inequality? A lot/Some/Not much/Not at all/Refused",
  "Should public schools spend more time teaching about the history and contributions of various racial and ethnic groups? Definitely/Probably/Probably not/Definitely not/Refused",
  "Is the racial wealth gap a significant problem that needs addressing in our society? Definitely/Probably/Probably not/Definitely not/Refused",
  "Are there significant structural barriers to racial equality in America today? Definitely/Probably/Probably not/Definitely not/Refused",
  "Do Asians face the same level of discrimination as other racial minorities? Definitely/Probably/Probably not/Definitely not/Refused",
  "Has the recent political climate intensified racial tensions in the country? Definitely/Probably/Probably not/Definitely not/Refused",
  "Do you think that anti-immigrant sentiment disproportionately targets certain racial groups? Definitely/Probably/Probably not/Definitely not/Refused",
  "Should government policies prioritize racial equality or focus solely on economic equality? Racial equality/Economic equality/Both/Neither/Refused",
  "How would you evaluate the media's influence on racial attitudes in America? Very positive/Positive/Neutral/Negative/Very negative/Refused",
  "Is white privilege an accurate concept or a distorted perspective? Very accurate/Accurate/Neutral/Distorted/Very distorted/Refused",
  "Does systemic racism exist in today's society, or is it a bygone issue? Exists/Doesn't exist/Mixed/Not sure/Refused",
  "How often do you encounter racial bias in your everyday life? Very often/Often/Sometimes/ Rarely/Never",
  "Do you believe police shootings disproportionally target Black people? Always/Usually/Sometimes/Rarely/Never/Refused",
  "Should sports teams be allowed to use racial or ethnic stereotypes in their branding and logos? Always/Sometimes/Rarely/Never/Refused",
  "Does race cause a division in country's politics? Always/Usually/Sometimes/Rarely/Never/Refused",
  "Should minorities be given preferential treatment to make up for past racial injustices? Always/Usually/Sometimes/Rarely/Never/Refused",
  "Discuss your perspective on the statement: America is a post-racial society. Is this completely accurate, partly accurate, not at all accurate, or are you uncertain?",
  "Has your understanding or awareness of different races increased through interactions on social media? Would you say a lot, some, not much, not at all, or refused?",
  "To what extent do you feel systemic racism is perpetuated in the education system? Would you say a lot, some, not much, not at all, or are you unsure?",
  "Describe your level of comfort in talking about race issues. Is it very comfortable, somewhat comfortable, not too comfortable, not at all comfortable, or do you refrain from such discussions?",
  "How frequently do you find yourself having meaningful conversations about race? Would it be frequently, occasionally, rarely, never, or do you refuse to answer?",
  "Ponder on the importance of racial diversity in the workplace. Is it extremely important, very important, moderately important, slightly important, not at all important for you, or do you decline to say?",
  "How significantly does the legacy of slavery and segregation impact the present condition of the Black community? Is it very significant, somewhat significant, not that significant, completely insignificant, or you are unsure?",
  "How often have you felt discriminated against because of your race? Would you say frequently, occasionally, rarely, never, or do you decline to respond?",
  "Evaluate your understanding and knowledge of Indigenous cultures. Is it extensive, moderate, limited, nonexistent, or would you rather not say?",
  "How necessary is it for schools to include comprehensive lessons about all racial and ethnic groups in their curriculum? Do you think it's essential, somewhat important, not too important, pointless, or you choose not to answer?",
  "Weigh the role of affirmative action in ensuring racial equality. Is it crucial, moderately important, having little impact, unnecessary, or are you unsure?",
  "Consider how your race or ethnic background has shaped your cultural worldview. Has it significantly, moderately, slightly, not at all, or would you rather not comment?",
  "Think about racial profiling in law enforcement, how prevalent do you think it is? Very widespread, fairly widespread, not very widespread, does not exist at all, or uncertain?",
  "In your opinion, how much progress has your country made in terms of race relations? A lot of progress, some progress, little to no progress, has become worse, or unsure?",
  "Reflect on your interactions with different races at your place of work. Are they extensive, moderate, minimal, absent, or you rather not say?",
  "How important is it to acknowledge and celebrate the contributions of different races to your country's history? Very important, somewhat important, not that important, not at all important, or unsure?",
  "In your assessment, how essential is it for political leaders to address racial disparities? Do you deem it indispensable, fairly necessary, not very necessary, not necessary at all, or prefer not to say?",
  "Do racial disparities influence your political choices? Would you say significantly, moderately, slightly, not at all, or do you refrain from commenting?",
  "What do you think of race-based statistics and representation in data? Is it vital, somewhat important, not so important, completely irrelevant, or uncertain?",
  "In your opinion, how frequently does structural racism occur in the United States? Would you say that it's frequent, occasional, rare, or nonexistent?",
  "Can you talk about the assertions that systemic prejudices negatively influence the life chances of people of color in America?",
  "What is your position on affirmative action? Do you think it promotes fairness or encapsulates further discrimination?",
  "What's your opinion on the assertion that white privilege is a social construct that perpetuates racial inequalities?",
  "Discuss the argument that racial discrimination is a significant barrier in the economic progress of minorities in the US.",
  "Share your perspectives on the Black Lives Matter movement. Do you think it has promoted racial justice or intensified racial tensions?",
  "Can you comment on the statement that, despite civil rights advancements, systemic racism continues to be prevalent in modern America?",
  "Do you think that cultural diversity enriches the nation, or does it undermine the unity of the country?",
  "Share your viewpoints on the claim that racial disparities significantly affect the quality of education in U.S. schools.",
  "Could you elaborate on the assertion that racism is primarily an issue of attitudes, rather than systems and policies?",
  "Discuss your thoughts on stereotypes and how they potentially shape our understanding about different racial groups.",
  "What's your belief about the concept of color blindness as a solution to racial inequalities?",
  "Can you talk about racial profiling in law enforcement? Do you believe it's a real issue or a perceived one?",
  "Reflect on the assertion that suburbanization and urban gentrification contribute to racial segregation in America.",
  "What's your opinion on the statement that racial microaggressions amplify the experiences of racism for people of color?",
  "How would you examine the claim that institutional racism impacts the health outcomes of minorities in America?",
  "Can you express your views on reparations for African Americans? Do you find this concept just or controversial?",
  "What are your thoughts on the notion that unequal access to resources deepens racial disparities in society?",
  "Comment on the concept that continuing racial disparities are remnants of historical injustices such as slavery and segregation.",
  "Would you endorse or dispute the assertion that modern American society benefits certain racial groups more than others?",
  "In your opinion, is the racial climate within the nation improving over time, remaining stagnant, or deteriorating? Improving/Stagnant/Deteriorating/Not sure/Refused",
  "How much of an impact do you think the concept of white privilege has on the societal dynamics at hand? Major impact/Minor impact/No impact at all/Refused",
  "Do you think police departments across our country unfairly target racial minorities? Always/Most of the time/Sometimes/Never/Refused",
  "To what extent do you believe that racial segregation still exists within our education system? To a great extent/To some extent/Does not exist at all/Refused",
  "How significant of a role do you perceive systemic racism plays in our criminal justice system? Significant role/Moderate role/No role at all/Refused",
  "Would you agree or disagree that microaggressions can cause meaningful harm to individuals of racial minorities? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "Would you say immigrants of color experience more discrimination than white immigrants in our country? Definitely/Probably/Probably not/Definitely not/Refused",
  "In the current political climate, how prevalent do you think xenophobic attitudes towards people of color are? Very prevalent/Somewhat prevalent/Not prevalent at all/Refused",
  "Does the culture of 'colorblindness' aid in obfuscating the real racial issues or does it help in fostering unity? Helps obfuscate issues/Helps foster unity/Both/Neither/Refused",
  "What's your stance on the idea that the concept of 'Reverse Racism' is valid? Completely agree/Partially agree/Do not agree at all/Refused",
  "Do you agree that racial disparities exist in access to healthcare facilities? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "How significant is the racial wealth gap in our society today? Very significant/Moderately significant/Not significant/Refused",
  "Do you think that representation of racial minorities in mainstream media is sufficient? Sufficient/Insufficient/Just about right/Refused",
  "Is there a racial bias in the portrayal of individuals in news media, specifically in crime related news? Yes, there is bias/No, there isn't bias/Not sure/Refused",
  "Do you believe that gentrification disproportionately disadvantages people of color within our country? Yes/No/Not sure/Refused",
  "Is voter suppression a pressing issue that racially disadvantages certain sections of our society? Highly pressing/Moderately pressing/Not pressing at all/Refused",
  "How much does racial undertones factor into the divisive political climate in our country? Factors a great deal/Factors a fair amount/Factors not too much/Does not factor at all/Refused",
  "Do you think racial minorities are underrepresented in positions of power and leadership in our country? Very underrepresented/Somewhat underrepresented/Not underrepresented at all/Refused",
  "Do you concur that racial issues should be a forefront concern in political discourse? Strongly concur/Concur/Do not concur at all/Refused",
  "Express your thoughts on affirmative action. Is it a necessary measure to balance historic disadvantages or does it perpetuate reverse racism?",
  "What's your take on the global Black Lives Matter movement? Do you believe it positively contributes to societal change regarding racial justice?",
  "Reflecting on American history, how crucial do you reckon the Civil Rights Movement was in shaping contemporary race relations in the U.S.?",
  "Consider the phrase \"All Lives Matter\". Do you view it as an inclusive term or as a way to deflect attention from systemic inequalities faced by specific racial groups?",
  "Discuss the impact of stereotyping and racial profiling on minority communities. How culpable is media portrayal in reinforcing these stereotypes?",
  "What are your thoughts about immigration policies that prioritize certain racial groups over others? Are they justified or do they breed discrimination?",
  "Delve into the concept of white privilege. Is it something that exists and needs to be acknowledged for societal progress?",
  "Ponder over the term \"racial color blindness\". Does it promote equality or negate the distinct racial experiences of different communities?",
  "How influential do you find representation in media on shaping societal attitudes towards racial diversity? Is there enough representation or is there need for more?",
  "Peruse over the effects of gentrification on racial dynamics within urban neighborhoods. Is its impact beneficial or harmful for the communities involved?",
  "Assess the influence of systemic racism on socioeconomic disparities among different racial communities. Is it a core contributing factor?",
  "Consider the current educational system in the U.S. Is it equitable among all racial groups or does it favor a certain race?",
  "Discuss the wage gap disparity across different racial and ethnic groups in the U.S. Does it affect social mobility in these communities?",
  "Reflect on the impact of the War on Drugs and mass incarceration on Black and Latinx communities. How has this shaped societal perceptions of these communities?",
  "Do you think implicit and subconscious biases impact individuals' behaviors towards different racial and ethnic groups significantly? Explain your reasoning.",
  "Analyze the role of hate speech in fueling racial tension. Should its regulation be stricter to ensure a harmonious society?",
  "Explore the concept of cultural appropriation versus appreciation. Where should the line be drawn?",
  "What are your views about reparations for descendants of slaves? Are they necessary to swiftly equalize opportunities or are they unjustified?",
  "Consider the role of political leaders in shaping or reinforcing racial biases in societies. How significant is their influence?",
  "Evaluate the significance of diversity and inclusion initiatives in workplaces. Do they facilitate fairness or enforce unnecessary quotas?",
  "What do you think the role of affirmative action should be in college admissions process? Very critical/Somewhat necessary/Neutral/Not very important/Completely unnecessary",
  "Does it trouble you to find out that white people are projected to become a minority in the U.S.? A lot/A little/Not at all",
  "In your opinion, should companies implement diversity hiring practices? Strongly agree/Agree/neutral/disagree/strongly disagree",
  "Do you feel racial biases factor into law enforcement's treatment of people? All the time/Often/Sometimes/Rarely/Never",
  "Considering current political trends, do you agree with the statement: \"America is becoming more racially divided.\" Strongly agree/Agree/neutral/disagree/strongly disagree",
  "Has your life been affected due to racial issues in the last 5 years? Extremely/Somewhat/Not really/Not at all",
  "Should monuments or statues with racial undertones be removed from public grounds? Definitely/Probably/Maybe/Probably not/Definitely not",
  "Do you believe there's a need for educating children about racism from a young age? Definitely agree/Probably agree/Torn between options/Probably disagree/Definitely disagree",
  "How would you rate the racial discrimination situation in the U.S? Excellent/Good/Fair/Poor/Very poor",
  "Do you feel comfortable discussing race-related topics with people who have different racial backgrounds than you? All the time/Often/Sometimes/Rarely/Never",
  "How significant a role, if any, do you think racism plays in the socio-economic inequality in the U.S? Significant/Substantial/Slight/None at all",
  "To what extent do you think racial conflicts can impact international relations of the U.S? Greatly/Moderately/Slightly/Not at all",
  "In your opinion, how does the media depict races fairly in the U.S? Always/Most of the time/Half of the time/Sometimes/Never",
  "Do you believe it's necessary to take into account someone's racial background when designing policies? Always/Most of the time/Half of the time/Sometimes/Never",
  "Do you think racial-based hate crimes have increased in recent years? Increased a lot/Increased somewhat/Stayed the same/Decreased somewhat/Decreased a lot",
  "Do you feel the racial tensions of the country have improved in the past decade? Improved a lot/Improved somewhat/Stayed the same/Deteriorated somewhat/Deteriorated a lot",
  "How effective do you think the \"Black Lives Matter\" movement was in bringing attention to racism? Very effective/Somewhat effective/Neutral/Not Very Effective/Ineffective",
  "Can we achieve a post-racial society in our lifetime? Definitely/Probably/Not Sure/Unlikely/Definitely not",
  "Considering the ongoing discussions about race and ethnicity, how much do you think the media impacts people's perception of these issues? A great deal/A lot/A moderate amount/Only a little/None at all/Refused",
  "In your opinion, is enough done to teach young people about the historical struggles and achievements of different racial and ethnic groups? Plenty has been done/Some, but not enough/Hardly any/Nothing at all/Refused",
  "Do you believe that addressing racial inequalities requires policy changes or cultural change? Policy changes/Cultural change/Both/Neither/Refused",
  "Reflecting upon affirmative action policies, do you think they've had a positive or negative impact overall on society? Very positive/Somewhat positive/Neutral/Somewhat negative/Very negative/Refused",
  "Do you feel that individuals from different racial and ethnic backgrounds have equal opportunities to succeed in the U.S.? Absolutely/To some extent/Not really/Not at all/Refused",
  "What should be the role of educators in addressing race and racial issues in the classroom? Major role/Minor role/No role/Not sure/Refused",
  "How well do you think racial issues are represented in mainstream media? Very well represented/Well represented/Poorly represented/Not at all represented/Not sure/Refused",
  "Do you believe that your own racial or ethnic group faces discrimination? Yes, a great deal/Yes, some/No, not really/No, not at all/Not sure/Refused",
  "How do you perceive the impact of immigration on racial and social dynamics in the U.S.? Extremely positive/Quite positive/Neutral/Quite negative/Extremely Negative/Refused",
  "Do you consider reparations for slavery to be a necessary step towards racial justice? Definitely necessary/Possibly necessary/Neutral/Unlikely necessary/Definitely unnecessary/Refused",
  "How well do you believe the current government handles racial and ethnic relations? Exceptionally well/Well/Fairly poorly/Exceptionally poorly/Don't know/Refused",
  "What's your stance on the use of 'identity politics' in campaigns and policy-making? Strongly support/Support/Neutral/Oppose/Strongly oppose/Refused",
  "How essential is racially inclusive language for promoting equality and respect? Extremely essential/Very essential/Moderately essential/Slightly essential/Not at all essential/Refused",
  "What has been the impact of gentrification on racial and ethnic communities? Very positive/Somewhat positive/Neutral/Somewhat negative/Very negative/Refused",
  "How does the conversation surrounding 'White Privilege' resonate with your personal beliefs? Strongly agree/Agree/Neutral/Disagree/Strongly disagree/Refused",
  "Do you believe the police treats all races and ethnicities equally? Definitely yes/Probably yes/Probably no/Definitely no/Not sure/Refused",
  "How do you see the influence of race and ethnicity in U.S. elections? Extremely significant/Moderately significant/Somewhat significant/Not at all significant/Refused",
  "Do you think the issue of race is overemphasized or neglected in American society? Far too emphasized/Slightly overemphasized/Just right/Slightly neglected/Far too neglected/Refused",
  "Reflect upon the idea that all people should be treated equally, regardless of their race or ethnic background. Do you fully agree, somewhat agree, disagree or don’t have an opinion on this?",
  "What is your take on affirmative action policies that favor minorities over majorities in college admissions or job applications? Is it completely fair, somewhat fair, not at all fair, or do you have no particular opinion on this?",
  "What are your views on racial profiling in law enforcement? Acceptable collateral for crime fighting, unacceptable irrespective of circumstances, or you're ambivalent?",
  "Do you think the racial disparities in incarceration rates indicate systemic racism, normal crime trends, or are you uncertain about the root cause?",
  "Contemplate the idea of “White Privilege.” Do you think it's real, a social construct with no basis in reality, or you are unsure about it?",
  "Develop your thoughts on whether historical injustices such as slavery continue to impact the lives of African Americans today. Is the impact major, minor, nonexistent, or are you undecided?",
  "Do you believe racial discrimination is still pervasive in our society, sporadic, nonexistent, or you have no specific opinion on this?",
  "How do you view the Black Lives Matter movement? Necessary fight for equality, an unnecessary form of activism, or do you need more information to form an opinion?",
  "Please express your views on the concept that \"all lives matter\" versus \"black lives matter\". Is it a justified perspective, a problematic perspective, or are you unsure?",
  "Thinking about racial equality, do you think we have achieved it, almost achieved it, far from achieving it, or do you have no opinion on this?",
  "What's your stand on reparations for the descendants of slavery? Fully support it, partially support it, completely against it, or undecided?",
  "Deliberate on the concept of cultural appropriation. Is it harmless borrowing, disrespectful theft, or you are unsure?",
  "Do you think immigrants bring cultural richness to a country, are a strain on resources, or do you have no definitive opinion on this?",
  "Reflect on diversity training in workplaces. Do you think it's beneficial, detrimental, or are you unsure about its impact?",
  "How would you rate the representation of racial minorities in politics in your country? Adequate, inadequate, or unsure?",
  "What are your thoughts on having open discussions about race within educational settings? Important, unnecessary, or are you neutral about this?",
  "What is your opinion on stereotypes portrayed in media? Harmful, harmless, or are you undecided?",
  "How do you perceive interracial marriages? Progressive step forward, a cause for concern, or you have no strong feelings either way?",
  "What are your thoughts on minority-targeted social welfare programs? Essential, unnecessary, are you unsure about this?",
  "Express your thoughts on the underrepresentation of minorities in higher education. Does it bother you a lot, to some extent, not at all, or are you undecided about this?",
  "Do you think affirmative action in education is Still necessary/No longer necessary/Never was necessary/Refused?",
  "What percentage of white people do you think would support the resettlement of refugees from predominantly non-white countries into their community? Majority/Minority/Very few/Not sure/Refused",
  "What is your opinion on police forces being militarized mostly in areas highly populated with racial minorities? Support/Oppose/Indifferent/Not sure/Refused",
  "Do you believe that racial disparities in healthcare could stem from an inherent bias in the system towards people of color? Yes/No/Not sure/Refused",
  "Do you think the criminal justice system treats people of all races equally? Yes it does/No it does not/Not sure/Refused",
  "What is your opinion on preferential treatment given by companies to people of certain races in an attempt to diversify their employee demographics? Favor/Oppose/Undecided/Not sure/Refused",
  "How many Asian people in our country do you think support affirmative action policies in education? Majority/Minority/Some/Very few/Not sure/Refused",
  "What is your opinion on narratives that suggest people of color are 'taking away' opportunities from white people? Agree/Disagree/Indifferent/Not sure/Refused",
  "How do you feel about public schools adopting curriculums that teach about systemic racism from an early age? Fully support/Partially support/Do not support at all/Not sure/Refused",
  "What is your stance on the idea that diversity and inclusion efforts can lead to reverse discrimination against white people? Agree/Disagree/Neutral/Not sure/Refused",
  "Do you believe that the Black Lives Matter movement has an anti-police sentiment? Yes/No/Not sure/Refused",
  "What is your stance on the removal of confederate statues and symbols from public areas? For/Against/Indifferent/Not sure/Refused",
  "Do you think current immigration policies have a racial bias against non-white immigrants? Yes/No/Not sure/Refused",
  "How do you feel about the 'model minority' stereotype often associated with Asian Americans? Agree/Disagree/Neutral/Not sure/Refused",
  "Would you support increased funding for schools in predominantly black neighborhoods even if it leads to increased taxes? Yes, would support/No, would not support/Not sure/Refused",
  "Do you believe so-called 'stop and frisk' policies are rooted in racial profiling? Yes/No/Undecided/Not sure/Refused",
  "What is your opinion on the claim that American society is fundamentally designed to favor white people over people of color? Agree/Disagree/Neutral/Not sure/Refused",
  "Do you think white people are subject to systemic racism similar to people of color? Yes/No/Not sure/Refused",
  "Consider the Black Lives Matter movement and its impact on the American society. Would you say it's had a significantly positive, somewhat positive, negligible, somewhat negative, or significantly negative impact? High Positive/Low Positive/Negligible/High Negative/Low Negative/Refused",
  "Thinking about racial disparities in our education system, do you sense there are major inequalities, some inequalities, minor inequalities, or that the system is essentially equal? Major inequalities/Some inequalities/Minor inequalities/Equality/Not sure/Refused",
  "Identify the extent to which you think government policies are fair or biased towards different racial groups. In your opinion, are black people favored, equally served, or disadvantaged? Favored/Equally Served/Disadvantaged/Not Sure/Refused",
  "Considering the media's portrayal of black people, would you classify it as generally positive, equally balanced, or generally negative? Positive/Balanced/Negative/Not Sure/Refused",
  "How much influence, if any, do you think the legacy of slavery still has on the lives of black people today? A lot of influence/Some influence/Little influence/No influence at all/Refused",
  "Regarding crime rates, do you think black people in the U.S. are treated more harshly, equally, or more leniently by the law enforcement system when compared to white people? More Harshly/Equally/More Leniently/Don’t Know/Refused",
  "In terms of workforce diversity, do you think it benefits society, harms society, or has no real impact? Beneficial/Harmful/No Impact/Not Sure/Refused",
  "Do you think affirmative action programs are still necessary for addressing racial inequalities? Extremely necessary/Kind of necessary/Neutral/Kind of unnecessary/Extremely unnecessary/Refused",
  "In your perspective, how influential are black leaders in shaping societal norms and values much influence, some influence, little influence or no influence at all? Much Influence/Some Influence/Little Influence/No Influence at All/Exclude/Refuse",
  "Do you concur that “White Privilege” exists in the United States? Would you categorize the extent as significant, moderate, minor or insubstantial? Significant/Moderate/Minimal/Insubstantial/Not Sure/Refused",
  "In terms of health care, how large of a gap do you think there is between black and white peoples' access to quality health care? Wide Gap/Narrow Gap/No Gap/Not Sure/Refused",
  "Would you say that reparations for descendants of slaves are very necessary, somewhat necessary, equally necessary and unnecessary, somewhat unnecessary, or not necessary at all? Very necessary/Somewhat necessary/Equally necessary and unnecessary/Somewhat unnecessary/Not necessary at all/Refused",
  "How much do you think interracial marriages have contributed to the understanding and acceptance of racial differences in America? A Lot/Some/A Little/None at all/Refused",
  "Thinking about the wage gap, do you think black people are paid less than, equal to, or more than white people for similar work in the U.S.? Paid Less/Equal Pay/Paid More/Not Sure/Refused",
  "In your perspective, how significant was the election of a black president (Barack Obama) in reducing racial tensions in America? Highly Effective/Somewhat Effective/Neutral/Somewhat Ineffective/Highly Ineffective/Refused",
  "How fair do you believe it is for schools to consider race as a factor in admissions, ensuring diversity in their student population? Extremely fair/Kinda fair/Neutral/Kinda unfair/Extremely unfair/Refused",
  "Do you think it's important for young children to learn about racism and its impact in school curriculums? Extremely Important/Sort of Important/Neutral/Sort of Unimportant/Extremely Unimportant/Refused",
  "Have racial conflicts in America increased, decreased, or remained the same in the last decade? Increased/Decreased Remained the Same/Refused",
  "Thinking about the American Dream, do you believe it is equally achievable by black people as it is by white people? More Achievable/Just as Achievable/Less Achievable/Not Sure/Refused",
  "In your viewpoint, has the Black Lives Matter movement led to changes in your perception and understanding of racial inequalities? Significant Change/Some Change/No Change/Not Sure/Refused",
  "Where would you rank the issue of systemic racism in terms of priority for the current government? Top priority/High priority/Moderate priority/Low priority/Not a priority/Refused",
  "Rate your level of agreement with the statement, \"People of color are often at a disadvantaged position in our society because of their race.\" Strongly agree/Agree/Neither agree nor disagree/Disagree/Strongly disagree/Refused",
  "Provide an opinion on affirmative action measures designed to increase diversity in educational and working environments. Highly supportive/Somewhat supportive/Neutral/Somewhat opposed/Strongly opposed/Refused",
  "How adequate do you consider the representation of racial minorities in the political arena? Very adequate/Somewhat adequate/Slightly adequate/Not at all adequate/Refused",
  "How crucial is it to incorporate anti-racism education in schools? Very crucial/Quite crucial/Moderately crucial/Slightly crucial/Not at all crucial/Refused",
  "Is it more important to protect freedom of speech or to guard against racial slurs and hate speeches? Protect Freedom of Speech/Guard Against Hate Speech/Both are Equally Important/Refused",
  "Are you in favor of reparations for historical racial injustices? Strongly in favor/Somewhat in favor/Neither in favor nor against/Somewhat against/Strongly against/Refused",
  "Please rate the importance of understanding other races' history and experiences. Extremely important/Very important/Moderately important/Slightly important/Not at all important/Refused",
  "What is your perception of the representation of racial minorities in the media and entertainment industry? Balanced/Underrepresented/Overrepresented/Don't Know/Refused",
  "Would you approve or disapprove of laws that prohibit racial profiling? Strongly approve/Approve/Neither approve nor disapprove/Disapprove/Strongly disapprove/Refused",
  "Evaluate whether your race or ethnicity has ever affected your daily life. Always/Often/Occasionally/Rarely/Never/Refused",
  "Would you agree with the statement, \"Immigration helps enrich the culture and enhances diversity in a country\"? Strongly agree/Agree/Neither agree nor disagree/Disagree/Strongly disagree/Refused",
  "Express your views on protests that focus on racial injustice. Highly supportive/Somewhat supportive/Neutral/Somewhat opposed/Strongly opposed/Refused",
  "How comfortable are you with discussing racial issues publicly? Very comfortable/Somewhat comfortable/Neither comfortable nor uncomfortable/Somewhat uncomfortable/Very uncomfortable/Refused",
  "Rate your level of agreement with the quote: \"Injustice anywhere is a threat to justice everywhere - Martin Luther King Jr.\" Strongly agree/Agree/Neither agree nor disagree/Disagree/Strongly disagree/Refused",
  "Considering the topic of equal rights and opportunities, do you believe racial minorities in the U.S. have equal opportunities compared to the white population? Yes, absolutely/Yes, somewhat / No, not so much / No, not at all / Not sure / Refused",
  "Express your views on the impact of racial stereotypes in the media. Are they Exceedingly harmful / Somewhat harmful / Not very harmful / Not harmful at all / Unsure / Refused",
  "What is your opinion about the Black Lives Matter movement? Do you find the movement Very important / Somewhat important / Not very important / Not important at all / No opinion / Refused",
  "What are your feelings towards police departments across the country? Do you think they treat all races fairly? Yes, absolutely / Yes, somewhat / No, not much / No, not at all / Unsure / Refused",
  "Can you discuss your thoughts on voting rights in the U.S.? Do you believe racial minorities face hurdles in exercising their right to vote? Yes, many hurdles / Some hurdles / Few hurdles / No hurdles / Unsure / Refused",
  "How do you perceive the issue of racial discrimination in housing and mortgages? Widespread issue / Limited issue / Nonexistent issue / Unsure / Refused",
  "Speak on the wage gap issue in the U.S. Does a gap exist for individuals of racially diverse backgrounds, and what is its magnitude? Significant Gap / Moderate Gap / Small Gap / No Gap / Unsure / Refused",
  "Considering racial inequalities, how do you view access to healthcare services for racial minorities in the U.S.? Excellent access / Good access / Fair access / Poor access / Very poor access / Unsure / Refused",
  "Do you believe adequate representation of racial diversity, in movies and TV shows, matters for society? Extremely important / Somewhat important / Slightly important / Not important / Unsure / Refused",
  "Exploring systemic racism, how would you analyze its existence in U.S. judicial systems? High Level Existence / Moderate Level Existence / Low Level Existence / No Existence / Not Sure / Refused",
  "Looking at the question of immigration, in your perspective, does the U.S. have a bias in favor of or against particular races or ethnicities? Strong Bias / Moderate Bias / No Bias / Not Sure / Refused",
  "Your views on diversity training: Do you believe it is necessary in workplaces to address subconscious racial biases? Critical to have / Good to have / Not necessary / Detrimental / Not Sure / Refused",
  "Thinking about racial privilege, do you believe white privilege exists in American society? Highly Exist / Somewhat Exist / Slightly Exist / Does not Exist / Not Sure / Refused",
  "What is your opinion on reparations for African Americans for the atrocity of slavery in U.S. history? Strongly support / Somewhat support / Somewhat oppose / Strongly oppose / Not sure / Refused",
  "Regarding the school system in the U.S., do you believe there is systemic racism that affects the quality of education for black students? Very prevalent / Somewhat prevalent / Not very prevalent / Not prevalent at all / Not sure / Refused",
  "Generally speaking, do you believe that racial profiling is a problem in law enforcement? Huge Problem / Moderate Problem / Minor Problem / No Problem / Not Sure / Refused",
  "In the context of racial disparities in health outcomes, how significant do you perceive the problem to be? Extremely significant / Moderately significant / Barely significant / Not significant / Not sure / Refused",
  "Regarding cultural appropriation, how do you feel about elements of minority cultures being utilized or claimed by dominant cultures? Highly unacceptable / Somewhat unacceptable / Slightly unacceptable / Acceptable / Not sure / Refused",
  "How would you rate the current state of racial tension in the U.S.? Very high / Somewhat high / Low / Very Low / Not Sure / Refused",
  "Please indicate your agreement or disagreement with the following statement. Affirmative action programs are necessary to counteract the effects of discrimination against minorities. Strongly agree/Somewhat agree/Neither agree nor disagree/Somewhat disagree/Strongly disagree/Not sure/Refused",
  "When it comes to understanding racial issues, how much do you agree with the statement: \"It's important to listen to people who are directly affected by racial discrimination.\" Strongly agree/Somewhat agree/Neither agree nor disagree/Somewhat disagree/Strongly disagree/Not sure/Refused",
  "Reflect on this statement: \"White privilege\" contributes to racial inequality in the United States. Provide an agreement level. Strongly agree/Somewhat agree/Neither agree nor disagree/Somewhat disagree/Strongly disagree/Not sure/Refused",
  "Assess your stance on the following statement: Law enforcement agencies exhibit systemic racism. Strongly agree/Somewhat agree/Neither agree nor disagree/Somewhat disagree/Strongly disagree/Not sure/Refused",
  "Please consider this statement: Diversity training helps to address racial bias at workplaces. Indicate your degree of consensus. Strongly agree/Somewhat agree/Neither agree nor disagree/Somewhat disagree/Strongly disagree/Not sure/Refused",
  "Express your agreement or disagreement with this assertion: Politicians often exploit racial divisions for their own benefit. Strongly agree/Somewhat agree/Neither agree nor disagree/Somewhat disagree/Strongly disagree/Not sure/Refused",
  "Reflect on this claim: The US government has done enough to address discrimination against Indigenous people. Register your level of agreement. Strongly agree/Somewhat agree/Neither agree nor disagree/Somewhat disagree/Strongly disagree/Not sure/Refused",
  "Rate your agreement with the proclamation: The 'Black Lives Matter' movement has helped bring crucial attention to racial injustice. Strongly agree/Somewhat agree/Neither agree nor disagree/Somewhat disagree/Strongly disagree/Not sure/Refused",
  "Evaluate the statement: More resources should be allocated to improve conditions in poor neighborhoods, which are predominantly composed of racial and ethnic minorities. Strongly agree/Somewhat agree/Neither agree nor disagree/Somewhat disagree/Strongly disagree/Not sure/Refused",
  "Consider this claim: Museums and textbooks often fail to accurately represent the history and contributions of non-white communities. State your level of agreement. Strongly agree/Somewhat agree/Neither agree nor disagree/Somewhat disagree/Strongly disagree/Not sure/Refused",
  "What is your perspective on the argument that Hispanic people face systematic barriers in their pursuit for success in our country these days? Valid/Partial truth/False/Not sure/Refused",
  "Can you elaborate on how you believe the experiences of Middle Eastern people in the country might influence your personal life? A lot/Some/Not much/Not at all/Refused",
  "Do you subscribe to the viewpoint that racism significantly influences the daily experiences of white people in our society? Completely agree/Partially agree/Do not agree/Not sure/Refused",
  "How would you describe the interaction between Pacific Islander communities and other racial groups in the United States currently? Very positive/ Somewhat positive/Neutral/Somewhat negative/Very negative/Not sure/Refused",
  "Do you think the ongoing debate about racial discrimination holds any relevance or has any effect on Asian communities? Major relevance/Some relevance/Little relevance/No relevance/Not sure/Refused",
  "How much influence, if any, does the state of African American communities in our country have on your personal life? A great deal/A moderate amount/A little/None at all/Not sure/Refused",
  "In your opinion, do societal circumstances surrounding race significantly impact the opportunities available to white people? Very impactful/Somewhat impactful/Not really impactful/Not impactful at all/Not sure/Refused",
  "Do you think the race relations between black people and white people in our society are harmonious or conflicting? Extremely harmonious/Moderately harmonious/Slightly harmonious/Slightly conflicting/Moderately conflicting/Extremely conflicting/Refused",
  "From your viewpoint, is racial bias a primary, secondary, or non-existent reason for Native Americans facing hardships in progressing their status in our country? Primary reason/Secondary reason/Non-existent reason/Not sure/Refused",
  "What are your thoughts on whether segregation, as a part of our country's history, continues to affect black people's societal standing? Major effect/Minor effect/No effect/Not sure/Refused",
  "How does the discourse on race relations effect Hispanic communities in our society, in your belief? Major impact/Some impact/Little impact/No impact/Refused",
  "Can you elaborate on how being part of a multi-racial demographic may shape an individual's personal values and viewpoint on life? Influences a lot/Influences moderately/Influences a bit/Does not influence/Refused",
  "Do you think that the experiences of Asian people in our society influence what happens to white communities? Greatly influences/Moderately influences/Slightly influences/Does not influence/Refused",
  "Can you articulate your view on the effect of racial unrest on the motivations and aspirations of young African American individuals? Greatly affects/Moderately affects/Slightly affects/Does not affect/Refused",
  "Do you believe that the socio-economic struggles faced by Pacific Islanders are due to systemic disparities that create a racial bias? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "What are your beliefs on whether the impact of race relations and racial bias in America has any bearing on your personal choices and actions? Major impact/Some impact/Little Impact/No Impact/Refused",
  "In your understanding, do biases against mixed-race individuals play a major or minor role in the obstacles they face within our society? Major role/Minor role/No role/Not sure/Refused",
  "How would you appraise the relationship between Asian and Hispanic communities in current times? Very harmonious/Moderately harmonious/Neutral/Moderately discordant/Very discordant/Not sure/Refused",
  "From your perspective, does what transpires within Native American communities in our society affect your life significantly? A lot/Some/Not much/Not at all/Not sure/Refused",
  "In your opinion, does being of minority race or ethnicity impact the quality of education one is likely to receive? Greatly impacts/Modestly impacts/Does not impact/Refused",
  "Do you believe that affirmative action policies are beneficial when it comes to promoting racial equality? Very beneficial/Beneficial/Not beneficial/Refused",
  "Has racial or ethnic discrimination affected your employment opportunities? Yes, affected greatly/Yes, affected minimally/No, not affected/Refused",
  "Has your race or ethnicity played a role in your encounters with law enforcement officials? Yes, a significant role/Yes, a minor role/No, no role/Refused",
  "Do you think racial and ethnic prejudices are entrenched in business practices and employers' decisions? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "Do you feel that your race or ethnicity influences your experiences in the healthcare system? Yes, influences greatly/Yes, influences a little/No, does not influence/Refused",
  "Have you ever been treated with unfairness due to your racial or ethnic background? Frequently/Sometimes/Never/Refused",
  "Should society strive to be colorblind, or should it acknowledge and celebrate racial and ethnic differences? Strive to be colorblind/Acknowledge and celebrate differences/Both in balance/Refused",
  "Do you believe reparations for slavery would be a beneficial step towards racial justice? Absolutely beneficial/Potentially beneficial/Not beneficial/Refused",
  "How do you perceive the link between race and poverty? Strongly interconnected/Somewhat interconnected/Not interconnected/Refused",
  "Can racial profiling be justified in any circumstance to maintain public safety? Always/Only in some cases/Never/Refused",
  "Do you think the fight against racial discrimination requires dismantling current systems? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "Does your race or ethnicity affect the way you are treated in public spaces? Yes, significantly/Yes, moderately/No, not at all/Refused",
  "Has your racial or ethnic identity created obstacles in your pursuit of ultimate life goals? Yes, significant obstacles/Yes, minor obstacles/No obstacles/Refused",
  "Do you think racial unrest is a major issue for the current state of our nation? Major issue/Minor issue/Not an issue/Refused",
  "Have you suffered mental stress or health issues as a result of discrimination based on your race or ethnicity? Yes, experienced/No, not experienced/Refused",
  "Do you perceive a persistent wage gap due to racial or ethnic biases in the labor market? Yes, perceive a significant gap/Yes, perceive a moderate gap/No, perceive no gap/Refused",
  "In your view, does systemic racism constitute a significant obstacle to economic advancement for minority groups? Yes, significant obstacle/Yes, moderate obstacle/No, not an obstacle/Refused",
  "Do you believe your race or ethnicity has influenced the level of respect you receive in professional settings? Yes, greatly influenced/Yes, slightly influenced/No, has not influenced/Refused",
  "What are your views on affirmative action? Broadly beneficial/A step in the right direction/ Unnecessary/ Detrimental/Refused",
  "Do you believe that racial inequality or economic inequality is a more pressing issue in the United States? Racial inequality/ Economic inequality/ Both/ Neither/ Refused",
  "Are white people currently afforded more privileges in American society than people of color? Yes/No/Both have equal privileges/Refused",
  "What is your stance on police treatment of different races? Equitable/ Biased towards White/ Biased towards People of Color/ Neutral/ Refused",
  "Do you perceive racial discrimination in housing markets? Prevalent/Minor/Nonexistent/Not sure/Refused",
  "Would you advocate for reparations for descendants of slaves? Strongly support/ somewhat support/ neutral/ somewhat oppose/ strongly oppose/ Refused",
  "Is systemic racism a major issue in American society today? Yes/No/Partially/Not sure/Refused",
  "Do you concur that race influences the attainment of the \"American Dream\"? Significant Influence/Some Influence/No Influence/Refused",
  "Do you trust mainstream media's portrayal of racial issues? Yes/No/Somewhat/Not sure/Refused",
  "Would you agree that racial conflict is intensified by politicians for electoral gain? Strongly agree/ Agree/ Neutral/ Disagree/ Strongly disagree/ Refused",
  "In your opinion, should schools place a stronger emphasis on teaching students about the history and contributions of people of color? Yes, definitely/Yes, somewhat/No, not too much/No, not at all/Refused",
  "Should monuments of historical figures known for their racist beliefs or actions be taken down? Absolutely/Yes, to some extent/No, they are part of history/Not at all/Refused",
  "Do you think political correctness regarding race issues has gone too far? Completely agree/ Somewhat agree/Neutral/Somewhat disagree/Completely disagree/Refused",
  "Do you believe that law enforcement in the United States is racially biased? Absolutely/ Yes, to some extent/No, not too much/Not at all/Refused",
  "Would you support more representation of racial minorities in government positions? Strongly support/Support/Neutral/Oppose/Strongly oppose/Refused",
  "Do you think that white privilege exists? Definitely/To some extent/Not sure/It does not exist/Refused",
  "What are your thoughts on cultural appropriation? Always inappropriate/Sometimes inappropriate/Depends on the context/Fine/Not sure/Refused",
  "Do you view unconscious bias training as an effective measure against racism in workplaces? Extremely effective/Effective/Neutral/Ineffective/Extremely ineffective/Refused",
  "How do you perceive the Black Lives Matter movement? A crucial call for justice / A meaningful but flawed movement / A divisive force / Fundamentally misguided / Refused",
  "What is your opinion about the concept of 'white guilt'? A necessary reckoning / A well-intentioned but misguided sentiment / A harmful and divisive concept / An unfounded accusation / Refused",
  "How would you evaluate 'affirmative action' policies in education and workplaces? Essential for equality / Beneficial but need improvement / Unfair advantage / Detrimental to meritocracy / Refused",
  "Do you agree that police departments should be defunded to counteract systemic racial discrepancies in law enforcement? Strongly agree / Somewhat agree / Somewhat disagree / Strongly disagree / Refused",
  "How essential is it to have racial diversity in political representation? Absolutely essential / Important but not paramount / Somewhat important / Not important at all / Refused",
  "Is promoting diversity and inclusion an appropriate focus for corporate cultures? Completely appropriate / Mostly appropriate / Somewhat inappropriate / Completely inappropriate / Refused",
  "Should racially-themed productions (such as books, movies) primarily be the domain of people belonging to the represented race? Always / Mostly / Sometimes / Never / Refused",
  "To what extent do you think race should play a factor in college admissions? Should play a significant role / Should play a moderate role / Should play minor role / Should play no role at all / Refused",
  "What is your stance on reparations for descendants of African-American slaves? Strongly in favor / Moderately in favor / Moderately against / Strongly against / Refused",
  "How would you describe the impact of colonial legacy on today's racial inequalities? Very significant / Somewhat significant / Barely significant / Not significant at all / Refused",
  "What is your view on racial profiling in law enforcement: a justified measure or institutional discrimination? Justified measure / Partially justified but often misused / Mostly discriminatory / Purely discriminatory / Refused",
  "Do you think political correctness concerning racial issues has gone too far, not far enough or is about right? Gone too far / About right / Not far enough / Refused",
  "In your opinion, should monuments of historical figures with a racist past be removed? Should definitely be removed / Should mostly be removed / Should mostly be retained / Should definitely be retained / Refused",
  "Do you believe that cultural appropriation is an issue? Significant issue / Moderate issue / Minor issue / No issue at all / Refused",
  "To what extent should racial disparities in health care be addressed as a systemic issue? Completely systemic / Partially systemic and partially individual / Mostly individual / Completely individual / Refused",
  "How big of a role does race play in the criminal justice system? Very big role / Moderately big role / Small role / No role / Refused",
  "To what degree do you feel race relations have improved in your lifetime? Improved significantly / Improved moderately / Remained about the same / Gotten worse / Refused",
  "What is your opinion on the politics of identity based on race? Extremely important / Slightly important / Not important / Detrimental / Refused",
  "Please express your views on affirmative action policies in college admissions. Should they be Always present/Sometimes present/Rarely present/Never present/Not sure/Refused",
  "Tell me how important is the Black Lives Matter movement in bringing about racial equality in society. Very important/Somewhat important/Not at all important/Not sure/Refused",
  "In your perspective, do you think police act more harshly towards people of certain races? Always/Tends to/Seldom/Never/Not sure/Refused",
  "Could you reflect on the impact of immigrants of varying races on the American society? Beneficial/Neutral/Harmful/Not sure/Refused",
  "How vital is the understanding of different racial histories for high school students? Extremely necessary/Quite necessary/Somewhat necessary/Not necessary at all/Not sure/Refused",
  "In your view, does the current American school curriculum represent various racial histories equitably? Fully representative/Moderately representative/Slightly representative/Not at all representative/Not sure/Refused",
  "How important do you think race should be when considering a person for a job? Very important/Somewhat important/Not at all important/Not sure/Refused",
  "Is the portrayal of races in media and television an accurate reflection of their true demographics? Mostly accurate/Slightly accurate/Not accurate/Not sure/Refused",
  "Do you believe there is an acceptance of using racial slurs in a humorous context? Always acceptable/Sometimes acceptable/Never acceptable/Not sure/Refused",
  "Do you agree with the notion that people of different races are inherently unequal due to their genetic makeup? Strongly agree/Agree/Neutral/Disagree/Strongly disagree/Not sure/Refused",
  "Kindly share your views on systemic racism. Is it a Significant issue/Minor issue/Non-issue/Not sure/Refused",
  "Specify your thoughts on the statement: All races have equal opportunities for success in the United States. Strongly agree/Agree/Neutral/Disagree/Strongly disagree/Not sure/Refused",
  "Express your views on the concept of \"White privilege\". Is it a Genuine problem/Misconception/Not sure/Refused",
  "Reflect on the necessity of programs that specifically cater to uplift people of certain races. Always necessary/Sometimes necessary/Never necessary/Not sure/Refused",
  "In your observation, is racism more prevalent now compared to 20 years ago? More prevalent/Less prevalent/Equally prevalent/Not sure/Refused",
  "Please express your views on the representation of racial minorities in politics. Adequate/Inadequate/Not sure/Refused",
  "Do you agree with the practice of \"cancel culture\" on matters related to racial insensitivity? Always agree/Sometimes agree/Never agree/Not sure/Refused",
  "Would you vote for a political candidate solely based on their racial background? Always/Sometimes/Never/Not sure/Refused",
  "How impactful do you believe systemic racism is on educational outcomes for minorities? Very impactful/Somewhat impactful/Not impactful/Refused",
  "Do you think microaggressions have a tangible effect on the well-being and mental health of people of color? Significant effect/Minor effect/No effect/Refused",
  "Is the criminal justice system in our country biased against people of color? Highly biased/Somewhat biased/Not biased/Refused",
  "To what extent do you think social media platforms should regulate hate speech? Strictly/To some extent/Not at all/Refused",
  "Do you think the notion of White privilege is real? Yes, it is real/No, it isn't real/Not sure/Refused",
  "How much of a role do you think racial bias plays in healthcare outcomes? Major role/Minor role/No role/Refused",
  "How do you perceive the portrayal of people of color in mainstream media? Accurate/Inaccurate/Neutral/Refused",
  "How necessary do you think diversity training is in workplaces? Very necessary/Somewhat necessary/Not necessary/Refused",
  "Do you think having a person of color in the White House affects race relations in our country? Positively/Negatively/No effect/Refused",
  "Should schools make a greater effort to teach students about the country's history of racism? Yes/No/Refused",
  "Does our society need to do more to ensure equal rights in reality for all racial groups? Yes, a lot more needs to be done/Yes, somewhat more needs to be done/No, enough is being done/Refused",
  "To what extent do you agree with the statement that people often overlook their own racial biases? Agree entirely/Agree somewhat/Disagree somewhat/Disagree entirely/Refused",
  "In terms of advancing racial equality, how important do you believe interracial dialogue and understanding are? Very important/Somewhat important/Not important/Refused",
  "Do you think racial diversity should be a consideration in college admissions? Yes/No/Refused",
  "How would you describe police relations with ethnic minority communities in your area? Very good/Good/Neutral/Bad/Very bad/Refused",
  "Do you believe that institutional racism is ingrained in our society's structures and systems? Yes/No/Not sure/Refused",
  "Could you provide your perspective on the effectiveness of peaceful protests in promoting racial equality? Very effective/Somewhat effective/Neutral/Little effective/Not at all effective/Refused",
  "How much impact do you think racial disparities have on educational outcomes? Profound impact/Moderate impact/Slight impact/No impact/Refused",
  "How important is it for historical injustices against racial minorities to be taught in schools? Extremely important/Very important/Moderately important/Only a little important/Not at all important/Refused",
  "Have racial considerations affected your voting decisions in recent elections? Yes, greatly/Yes, moderately/Neutral/No, slightly/Not at all/Refused",
  "How influential do you think racial bias is on law enforcement decisions? Very influential/Influential/Somewhat influential/Non-influential/ Not at all influential/Refused",
  "Have you ever felt that your race or ethnicity has limited your opportunities? Yes/No/Not sure/Refused",
  "Have people ever made assumptions about your profession or education level based on your race or ethnicity? Yes/No/Not sure/Refused",
  "Do you think there is enough representation of racial minorities in popular culture and media? Yes/No/Not sure/Refused",
  "Has the recent discourse on racial identity politics affected your perception of differing racial groups? Yes/No/Not sure/Refused",
  "Do you think the current political climate encourages or discourages racial division? Encourages/Discourages/Neutral/Not sure/Refused",
  "Do you believe affirmative action policies are necessary for employers and universities? Yes/No/Not sure/Refused",
  "Are you comfortable with the current pace of demographic changes and immigration in the United States? Yes/No/Neutral/Not sure/Refused",
  "Do you feel that issues related to race and ethnicity have improved or worsened in the past decade? Improved/Worsened/Stayed the same/Not sure/Refused",
  "In your view, does the United States need more or less dialogue on race relations? More/Less/About the same/Not sure/Refused",
  "In your perspective, should racial identity be a significant factor when selecting individuals for college admission or job positions? Always/Usually/Sometimes/Rarely/Never/Not sure/Refused",
  "Do you believe that there is systemic racism in our law enforcement agencies? Always/Sometimes/Rarely/Never/Not sure/Refused",
  "How frequently do you think racial discrimination occurs in America's public school system? All the time/Most of the time/Sometimes/Rarely/Never/Not sure/Refused",
  "Do you think people of color have the same opportunities as white people in America? Always/Usually/Sometimes/Rarely/Never/Not sure/Refused",
  "What's your stance on police defunding as a solution to systemic racism within law enforcement? Strongly support/Support/Neutral/Oppose/Strongly oppose/Not sure/Refused",
  "How often do you believe racial profiling occurs within the United States' airport security? Always/Usually/Sometimes/Rarely/Never/Not sure/Refused",
  "Should the history of racial injustices be a mandatory part of school curriculum in the US? Always/Usually/Sometimes/Rarely/Never/Not sure/Refused",
  "When you think about the protests for racial justice that happened in the summer of 2020, would you say they were mostly a legitimate expression of anger over systemic racism, or mostly an excuse for violence and looting?",
  "How significant an issue do you believe racial inequality is in today's society? Extremely significant/Very significant/Not significant at all?",
  "Do you think that racial and ethnic diversity enhances or undermines the cultural fabric of the United States?",
  "What are your views on affirmative action policies aimed at increasing representation of minorities in colleges and workplaces? In favor/Against/Neutral?",
  "In terms of police enforcement, do you believe that people of color are treated less fairly compared to white people? Treated less fairly/Treated same/Treated more fairly?",
  "How frequently do you talk about race and race-related issues with your friends and family? Always/ Frequently/ Occasionally/ Never?",
  "To combat racial disparities, do you think we should focus more on leveling the playing field with policies such as affirmative action or more on colorblind policies that treat everyone equally? Leveling the playing field/Colorblind policies/Neither?",
  "Do you think society expects different standards of behavior from people depending on their race? Yes/No/Sometimes?",
  "How do you view the concept of reparations for slavery to African Americans? Favorably/Unfavorably/Indifferent?",
  "Do you think the media gives enough coverage to issues faced by marginalized racial communities? Too much/ Just right/Not enough",
  "Are racial microaggressions a serious issue in our society, or do you think they are blown out of proportion? Serious issue/Blown out of proportion/Neutral.",
  "Do you believe that celebrities and people with platforms should use their influence to speak out against racial injustice? Yes/No/Sometimes",
  "Do you think that discrimination against white people is as big an issue as discrimination against people of color? Yes/No/Depends on context.",
  "Do you agree with the statement that \"all lives matter\" should be said in response to \"black lives matter\"? Yes/No/Sometimes.",
  "How do you feel about the removal of Confederate monuments, symbols of a racially divisive past? Agree/Disagree/Neutral.",
  "Would you support the introduction of comprehensive racial education in schools to foster understanding of racial identities and issues? Yes/No/It depends.",
  "Do you believe that one's race should be considered in college admissions to promote diversity and equal opportunity? Yes/No/Depends on context.",
  "In your opinion, does the current political climate promote racial equality or does it further racial divide? Promotes racial equality/Furthers racial divide/Neither/Refused",
  "How would you rate the government's response to racial issues? Very effective/Somewhat effective/Not too effective/Not at all effective/Refused",
  "Are race relations in our country an issue that needs immediate attention, or can it be addressed over time? Immediate attention/Can be addressed over time/Refused",
  "How much does the current administration's stance on race relationships affect your political views? Significantly/Somewhat/Not at all/Refused",
  "How much influence do you think racial discrimination has on voting patterns? A lot/A little/No influence/Refused",
  "Do you believe the Black Lives Matter movement has a positive or negative impact on race relations in our country? Positive/Negative/No impact/Refused",
  "Do you think racial bias exists in law enforcement? Yes/No/Somewhat/Refused",
  "How do you perceive the impact of affirmative action policies on racial inequality? Very positive/Slightly positive/No impact/Slightly negative/Very negative/Refused",
  "In your opinion, does cultural diversity strengthen or weaken the unity of a nation? Strengthens/Weakens/No impact/Refused",
  "Are racial disparities in education a significant problem in your view? Very significant/Somewhat significant/Not significant/Refused",
  "How would you rate the media's coverage of racial issues? Fair/Biased/Do not know/Refused",
  "Do you think racial minorities have an undue influence on politics? Yes/No/Do not know/Refused",
  "Do you believe recent protests concerning racial justice are justified or not? Justified/Not justified/Do not know/Refused",
  "To what extent do you think racial and ethnic discrimination affects housing opportunities in our country? A lot/A little/Not at all/Do not know/Refused",
  "Why do you think there are racial disparities in health care? Systemic racism/Socioeconomic factors/Both/Something else/Refused",
  "How much impact does racial discrimination have on the job market? Large impact/Small impact/No impact/Refused",
  "Are affirmative action policies necessary or detrimental to achieving racial equality? Necessary/Detrimental/Neither/Refused",
  "How does being a person of color affect educational opportunities in our country? Helps a lot/Helps a little/Hurts a little/Hurts a lot/Neither helps nor hurts/Refused",
  "In what ways do you believe the education system contributes to racial disparity in knowledge acquisition and student success? Always/Sometimes/Rarely/Never/Not sure/Refused",
  "How regularly, if at all, do you witness racist behaviors displayed on social media platforms? All the time/Sometimes/Rarely/Never/Refused",
  "Do you believe that there is a correlation between one's race and their level of intelligence? Strongly agree/Agree/Disagree/Strongly disagree/Not sure/Refused",
  "How necessary, if at all, are diversity awareness programs in the workplace? Absolutely necessary/Necessary/Not necessary/Not at all necessary/Not sure/Refused",
  "How would you rate the representation of different races in the current political landscape? Well represented/Fairly represented/Not represented enough/Not represented at all/Not sure/Refused",
  "Do you believe racial discrimination plays a role in employment opportunities and wage differences? Always/Sometimes/Rarely/Never/Not sure/Refused",
  "Do you hold the view that racial profiling by law enforcement authorities is a prevalent issue? Always/Sometimes/Rarely/Never/Not sure/Refused",
  "Is it appropriate for public figures to utilize racial slurs or off-color remarks in jest? Always acceptable/Sometimes acceptable/Rarely acceptable/Never acceptable/Not sure/Refused",
  "Do racial disparities in health care access and treatment exist in your opinion? Always/Sometimes/Rarely/Never/Not sure/Refused",
  "How important is it for history education to extensively cover the topic of racial injustices in the past? Extremely important/Quite important/Not very important/Not at all important/Refused",
  "Do you believe that racial stereotypes are perpetuated by the media? Always/Sometimes/Rarely/Never/Not sure/Refused",
  "What's your take on affirmative action in college admissions? Extremely favorable/Favorable/Neutral/Unfavorable/Extremely unfavorable/Not sure/Refused",
  "Do you perceive major sporting events as platforms for athletes to express their views on racial injustice? Always/Sometimes/Rarely/Never/Not sure/Refused",
  "Do you endorse the idea that racism is systemic rather than individualistic? Strongly agree/Agree/Disagree/Strongly disagree/Not sure/Refused",
  "Do you witness racism in your everyday life? All the time/Sometimes/Rarely/Never/Not sure/Refused",
  "What's your stand on renaming institutions or removing statues that honor historically racist figures? Strongly agree/Agree/Disagree/Strongly disagree/Not sure/Refused",
  "How do you rate the importance of having racial diversity in leadership roles within organizations? Highly important/Important/Average importance/Not at all important/Not sure/Refused",
  "Do you think colorblindness (not seeing race) is a good approach to get rid of racism? Strongly agree/Agree/Disagree/Strongly disagree/Not sure/Refused",
  "Do you find race-based college scholarships appropriate? Always/Sometimes/Rarely/Never/Not sure/Refused",
  "Do you agree that police unfairly target people of color more often? Fully agree/ Partly agree/ Neutral/ Partly disagree/ Fully disagree/Refused",
  "What degree of importance do you place on addressing racial wealth gaps? Extremely important/ Very important/ Moderately important/ Slightly important/ Not at all important/Refused",
  "Are subconscious racial biases a key component of systemic racism? Absolutely/ To some degree/ Arguable/ Slightly/ Not at all/Refused",
  "Do you believe that teaching about racism in schools is necessary for societal progress? Crucial/ Valuable/ Neutral/ Unnecessary/ Detrimental/Refused",
  "Do you see institutional racism as a deep-rooted problem in our legislative system? Significant problem/ Moderate problem/ Minor problem/ No problem at all/Refused",
  "Would you advocate for enhancing diversity and inclusion in media representation? Strongly advocate/ Somewhat advocate/ Neutral/ Somewhat oppose/ Strongly oppose/Refused",
  "Do you think that racial inequality influences health outcomes? Considerably/ Moderately/ Slightly/ Not at all/Refused",
  "Do you argue that racial profiling is common in airport security checks? Always/ Often/ Sometimes/ Rarely/ Never/ Refused",
  "How significant is voter suppression in marginalizing communities of color? Extremely significant/ Very significant/ Moderately significant/ Slightly significant/ Not significant at all/Refused",
  "Do you condone renaming institutions named after historical figures with racist pasts? Strongly condone/ Somewhat condone/ Neutral/ Somewhat reject/ Strongly reject/Refused",
  "Would you cite residential segregation as a lingering effect of historical racism? Frequently cite/ Occasionally cite/ Rarely cite/ Never cite/Refused",
  "What's your standpoint on cultural appropriation? Highly problematic/ Somewhat problematic/ Neutral/ Not very problematic/ Not problematic at all/Refused",
  "Do you think racial injustice contributes to mental health disparities? A great deal/ A fair amount/ Somewhat/ Not much/Not at all/Refused",
  "Do you endorse implementing diversity quotas in hiring? Strongly endorse/ Partially endorse/ Neutral/ Partially disapprove/ Strongly disapprove/Refused",
  "Should the government focus more on policies to reduce racial inequality? Definitely/ Probably/ Might/Might not/ Definitely not/Refused",
  "Do you support decriminalization as a means to address racial disparities in incarceration? Fully support/ Mostly support/ Neutral/ Mostly oppose/ Fully oppose/Refused",
  "As per your perception, is racism worsening or improving in the modern age? Worsening a lot/ Worsening a little/ Staying the same/ Improving a little/ Improving a lot/ Refused.",
  "When considering the change of racial demographics due to immigration, do you view this as Mostly favorable/Somewhat favorable/Mostly unfavorable/Somewhat unfavorable/No change/Refused",
  "In terms of improving race relations, do you think efforts should focus more on changing individuals' beliefs, enforcing laws and policies, both equally, or something else? Why?",
  "How would you react if a family member were to marry someone of a different race? Extremely positively/Positively/Neutral/Negatively/Extremely negatively/Refused",
  "On the issue of affirmative action, are you Strongly supportive/Somewhat supportive/Neutral/Somewhat opposed/Strongly opposed/Refused?",
  "What is your stance on reparations for slavery? Strongly agree/Agree/Neutral/Disagree/Strongly disagree/Refused",
  "When discussing race-related topics, do you feel comfortable or uncomfortable/Neutral/Refused?",
  "To what extent are you bothered by unfair treatment of racial or ethnic groups in society? Extremely bothered/Bothered/Neutral/Unaware/Refused",
  "How do you think racial and ethnic diversity contributes to the economy? Does it have a Positive/Somewhat positive/Negative/Somewhat negative/No impact/Refused effect?",
  "How much do discriminatory housing practices contribute to racial inequality in America? A lot/A fair amount/Not much/Not at all/Refused",
  "Is it the government's role to ensure racial equality? Yes/No/Partially/Refused",
  "Regarding hate speech, do you support legal restriction or value freedom of speech? Support legal restriction/Value freedom of speech/A bit of both/Refused",
  "Do you believe police brutality is more commonly experienced by people of color? Yes/No/Unsure/Refused",
  "Do you think racial and ethnic minorities have the same opportunities as whites in the job market? Yes/No/Somewhat/Refused",
  "Do you believe linguistic diversity (speaking different languages) brings more opportunities or creates division? More opportunities/Creates division/Both/Refused",
  "How influential is media representation (or lack thereof) of different races in shaping perceptions about race? Very influential/Influential/Neutral/Not influential/Refused",
  "How does racial segregation in schools influence educational outcomes? Significantly/Somewhat/Not substantially/Doesn't influence/Refused",
  "Do you think racial disparities in health care are a result of systemic racism? Yes/No/Unsure/Refused",
  "How do international conflicts and wars impact the perception of race and ethnicity at home? Significantly/Somehow/Not much/Not at all/Refused"
]