[
  "How well, if at all, do the following words or phrases describe you? Environmentalist Describes me well/Does not describe me well/Refused",
  "For your relationships with family and friends aspects of your life, would you say that you are, or about where you expected to be at this point in your life? In a better situation than I expected/In a worse situation than I expected/About where I expected/Refused",
  "For your job or career aspects of your life, would you say that you are, or about where you expected to be at this point in your life? In a better situation than I expected/In a worse situation than I expected/About where I expected/Refused",
  "How much, if anything, do you know about what nutrition research scientists do? A lot/A little/Nothing at all/Refused",
  "Is what you know about environmental research scientists because you learned about this in your job Yes, learned about this in my job/No, did not learn about this in my job/Refused",
  "Is what you know about nutrition research scientists because you have heard or read about this in the news Yes, have heard or read about this in the news/No, have not heard or read about this in the news/Refused",
  "Is what you know about nutrition research scientists because you learned about this in school Yes, learned about this in school/No, did not learn about this in school/Refused",
  "Thinking about environmental research scientists, how often would you say they provide fair and accurate information when making statements about their research All or most of time/Some of the time/Only a little of the time/None of the time/Refused",
  "Thinking about environmental research scientists, how often would you say they do a good job conducting research All or most of time/Some of the time/Only a little of the time/None of the time/Refused",
  "Is what you know about nutrition research scientists because you know someone who does this Yes, know someone who does this/No, do not know someone who does this/Refused",
  "Is what you know about environmental research scientists because you have heard or read about this in the news Yes, have heard or read about this in the news/No, have not heard or read about this in the news/Refused",
  "Is what you know about environmental research scientists because you learned about this in school Yes, learned about this in school/No, did not learn about this in school/Refused",
  "Thinking about nutrition research scientists, how often would you say they admit mistakes and take responsibility for them All or most of time/Some of the time/Only a little of the time/None of the time/Refused",
  "Thinking about nutrition research scientists, how often would you say they care about the best interests of the public All or most of time/Some of the time/Only a little of the time/None of the time/Refused",
  "Overall, do you think research misconduct by nutrition research scientists is A very big problem/A moderately big problem/A small problem/Not a problem at all/Refused",
  "Is what you know about nutrition research scientists because you learned about this in your job Yes, learned about this in my job/No, did not learn about this in my job/Refused",
  "Thinking about nutrition research scientists, how often would you say they do a good job conducting research All or most of time/Some of the time/Only a little of the time/None of the time/Refused",
  "Thinking about nutrition research scientists, how often would you say they provide fair and accurate information when making statements about their research All or most of time/Some of the time/Only a little of the time/None of the time/Refused",
  "Thinking about environmental research scientists, how often would you say they care about the best interests of the public All or most of time/Some of the time/Only a little of the time/None of the time/Refused",
  "In general, would you say your view of nutrition research scientists is Mostly positive/Mostly negative/Neither positive nor negative/Refused",
  "Thinking about environmental research scientists, how often would you say they admit mistakes and take responsibility for them All or most of time/Some of the time/Only a little of the time/None of the time/Refused",
  "Overall, do you think research misconduct by environmental research scientists is A very big problem/A moderately big problem/A small problem/Not a problem at all/Refused",
  "When you hear or read news stories about research misconduct by environmental research scientists, do you think of these cases as Isolated incidents/Signs of a broader problem/Refused",
  "Thinking about environmental research scientists, how often would you say they are transparent about potential conflicts of interest with industry groups in their research All or most of time/Some of the time/Only a little of the time/None of the time/Refused",
  "How often, if at all, do you think environmental research scientists face serious consequences if they engage in research misconduct? All or most of the time/Some of the time/Only a little of the time/None of the time/Refused",
  "When you hear about problems with research misconduct among environmental research scientists, which comes closer to your view, even if neither is exactly right? Most environmental research scientists have good intentions, it's the research system that's broken/The research system can work fine, it's the environmental research scientists that are the problem/Refused",
  "Which of these statements comes closer to your own view, even if neither is exactly right? Scientists should take an active role in public policy debates about scientific issues/Scientists should focus on establishing sound scientific facts and stay out of public policy debates/Refused",
  "Which of these statements comes closer to your own view, even if neither is exactly right? Public opinion should play an important role to guide policy decisions about scientific issues/Public opinion should not play an important role to guide policy decisions about scientific issues because these issues/Refused",
  "How much confidence, if any, do you have in medical scientists to act in the best interests of the public? A great deal of confidence/A fair amount of confidence/Not too much confidence/No confidence at all/Refused",
  "How much confidence, if any, do you have in scientists to act in the best interests of the public? A great deal of confidence/A fair amount of confidence/Not too much confidence/No confidence at all/Refused",
  "Is what you know about medical research scientists because you learned about this in school Yes, learned about this in school/No, did not learn about this in school/Refused",
  "Is what you know about medical research scientists because you know someone who does this Yes, know someone who does this/No, do not know someone who does this/Refused",
  "How much, if anything, do you know about what medical research scientists do? A lot/A little/Nothing at all/Refused",
  "Is what you know about medical research scientists because you learned about this in your job Yes, learned about this in my job/No, did not learn about this in my job/Refused",
  "Is what you know about medical research scientists because you have heard or read about this in the news Yes, have heard or read about this in the news/No, have not heard or read about this in the news/Refused",
  "In general, would you say scientific experts are Usually better at making good policy decisions about scientific issues than other people/Usually worse at making good policy decisions about scientific issues than other people/neither better nor worse at making good policy decisions about scientific issues than other people/Refused",
  "In general, would you say your view of medical research scientists is Mostly positive/Mostly negative/Neither positive nor negative/Refused",
  "Thinking about nutrition research scientists, how often would you say they are transparent about potential conflicts of interest with industry groups in their research All or most of time/Some of the time/Only a little of the time/None of the time/Refused",
  "When you hear or read news stories about research misconduct by nutrition research scientists, do you think of these cases as Isolated incidents/Signs of a broader problem/Refused",
  "When you hear about problems with research misconduct among nutrition research scientists, which comes closer to your view, even if neither is exactly right? Most nutrition research scientists have good intentions, it's the research system that's broken/The research system can work fine, it's the nutrition research scientists that are the problem/Refused",
  "How often, if at all, do you think nutrition research scientists face serious consequences if they engage in research misconduct? All or most of the time/Some of the time/Only a little of the time/None of the time/Refused",
  "Overall, would you say science has had a mostly positive effect on our society or a mostly negative effect on our society? Mostly positive/Mostly negative/Equal positive and negative effects/Refused",
  "Is what you know about environmental research scientists because you know someone who does this Yes, know someone who does this/No, do not know someone who does this/Refused",
  "Looking ahead to the next twenty years, do you think developments in science will make people's lives Better/Worse/About the same/Refused",
  "How much, if anything, do you know about what environmental research scientists do? A lot/A little/Nothing at all/Refused",
  "Genetically modified foods come from a technique that adds genes from other organisms to change that food's genetic characteristics. How much, if anything, have you heard or read about foods with genetically modified ingredients? A lot/A little/Nothing at all/Refused",
  "Do you think science has had a mostly positive or mostly negative effect on the quality of the environment in the U.S.? Mostly positive/Mostly negative/Refused",
  "Overall, do you think science has made life easier or more difficult for most people? Easier/More difficult/Refused",
  "Do you think science has had a mostly positive or mostly negative effect on the quality of Health care in the U.S.? Mostly positive/Mostly negative/Refused",
  "How likely is it that genetically modified foods will lead to more affordably-priced food Very likely/Fairly likely/Not too likely/Not at all likely/Refused",
  "How likely is it that genetically modified foods will create problems for the environment Very likely/Fairly likely/Not too likely/Not at all likely/Refused",
  "Do you think science has had a mostly positive or mostly negative effect on the quality of food in the U.S.? Mostly positive/Mostly negative/Refused",
  "How likely is it that genetically modified foods will increase the global food supply Very likely/Fairly likely/Not too likely/Not at all likely/Refused",
  "If gene editing to change a baby's genetic characteristics required testing on human embryos in order to develop these techniques, do you think this would be An appropriate use of medical technology/Taking medical technology too far/Refused",
  "Do you think genetic engineering of animals to grow organs or tissues that can be used for humans needing a transplant would be An appropriate use of technology/Taking technology too far/Refused",
  "Do you think genetic engineering of aquarium fish to change their appearance, causing them to glow would be An appropriate use of technology/Taking technology too far/Refused",
  "Do you think genetic engineering of mosquitoes that would prevent them from reproducing in order to prevent the spread of some mosquito-borne diseases would be An appropriate use of technology/Taking technology too far/Refused",
  "Thinking about the development of human life on Earth which statement comes closer to your own views, even if neither is exactly right? Humans have evolved over time/Humans have existed in their present form since the beginning of time/Refused",
  "Which of these statements comes closer to your own views, even if neither is exactly right? Humans have evolved over time due to processes such as natural selection; God or a higher power had no role in this proc/Humans have evolved over time due to processes that were guided or allowed by God or a higher power/Refused",
  "Do you think genetic engineering of animals to increase their production of specific proteins that will lead to more nutritious meat would be An appropriate use of technology/Taking technology too far/Refused",
  "Do you think bringing back an animal that is currently extinct by genetically engineering a closely-related species would be An appropriate use of technology/Taking technology too far/Refused",
  "In your opinion, do you think government investments in engineering and technology usually pay off in the long run, or are they not worth it? Government investments usually pay off in the long run/Government investments aren't worth it/Refused",
  "In your opinion, do you think government investments in medical research usually pay off in the long run, or are they not worth it? Government investments usually pay off in the long run/Government investments aren't worth it/Refused",
  "In your opinion, do you think government investments in basic scientific research usually pay off in the long run, or are they not worth it? Government investments usually pay off in the long run/Government investments aren't worth it/Refused",
  "Which statement comes closer to your view, even if neither is exactly right? Government investment in research is essential for scientific progress/Private investment will ensure that enough scientific progress is made, even without government investment/Refused",
  "All in all, do you favor or oppose the use of animals in scientific research? Favor/Oppose/Refused",
  "How likely is the following if gene editing to change a baby's genetic characteristics becomes widely available? Even if gene editing is used appropriately in some cases, others will use these techniques in ways that are morally unacceptable Very likely/Fairly likely/Not too likely/Not at all likely/Refused",
  "How much, if anything, have you heard or read about gene editing that can be used to change a baby's genetic characteristics? A lot/A little/Nothing at all/Refused",
  "Do you think changing a baby's genetic characteristics to make the baby more intelligent is an appropriate use of medical technology ? An appropriate use of medical technology/Taking medical technology too far/Refused",
  "How likely is the following if gene editing to change a baby's genetic characteristics becomes widely available? These techniques will help people live longer and better quality lives Very likely/Fairly likely/Not too likely/Not at all likely/Refused",
  "Do you think changing a baby's genetic characteristics to treat a serious disease or condition the baby would have at birth is an appropriate use of medical technology ? An appropriate use of medical technology/Taking medical technology too far/Refused",
  "Do you think changing a baby's genetic characteristics to reduce the risk of a serious disease or condition that could occur over the course of his or her lifetime is an appropriate use of medical technology ? An appropriate use of medical technology/Taking medical technology too far/Refused",
  "Thinking about what you have heard or read, how well do you think medical researchers understand the health risks and benefits of changing a baby's genetic characteristics? Very well/Fairly well/Not too well/Not at all well/Refused",
  "Even if you are not sure, from what you have heard or read, which of these statements about the development of human life on Earth comes closest to what most biological scientists say? Humans have evolved over time due to processes such as natural selection/Humans have existed in their present form since the beginning of time/Refused",
  "How likely is the following if gene editing to change a baby's genetic characteristics becomes widely available? Development of these techniques will pave the way for new medical advances that benefit society as a whole Very likely/Fairly likely/Not too likely/Not at all likely/Refused",
  "How likely is the following if gene editing to change a baby's genetic characteristics becomes widely available? Inequality will increase because this option will be available only for the wealthy Very likely/Fairly likely/Not too likely/Not at all likely/Refused",
  "Thinking about the development of human life on Earth which statement comes closest to your view? Humans have evolved over time due to processes such as natural selection; God or a higher power had no role in this proc/Humans have evolved over time due to processes that were guided or allowed by God or a higher power/Humans have existed in their present form since the beginning of time/Refused",
  "From what you have heard or read, which of these statements about the development of human life on Earth comes closest to what most biological scientists say? Humans have evolved over time due to processes such as natural selection/Humans have existed in their present form since the beginning of time/Not sure/Refused",
  "How likely is the following if gene editing to change a baby's genetic characteristics becomes widely available? We will use these techniques before we fully understand how they affect people's health Very likely/Fairly likely/Not too likely/Not at all likely/Refused",
  "Compared with twenty years ago, do you think developments in science have made people's lives Better/Worse/About the same/Refused",
  "Is what you know about dietitians because you learned about this in your job Yes, learned about this in my job/No, did not learn about this in my job/Refused",
  "Is what you know about dietitians because you learned about this in school Yes, learned about this in school/No, did not learn about this in school/Refused",
  "Is what you know about dietitians because you know someone who does this Yes, know someone who does this/No, do not know someone who does this/Refused",
  "In the future, what kind of an impact do you think science and technology will have in solving the biggest problems facing the country? A very positive impact/A somewhat positive impact/A somewhat negative impact/A very negative impact/Refused",
  "Thinking about environmental health specialists, how often would you say they admit mistakes and take responsibility for them All or most of the time/Some of the time/Only a little of the time/None of the time/Refused",
  "Thinking about environmental health specialists, how often would you say they provide fair and accurate information when making recommendations All or most of the time/Some of the time/Only a little of the time/None of the time/Refused",
  "Thinking about environmental health specialists, how often would you say they care about the best interests of people in the community All or most of the time/Some of the time/Only a little of the time/None of the time/Refused",
  "Thinking about environmental health specialists, how often would you say they are transparent about potential conflicts of interest with industry groups in their work All or most of the time/Some of the time/Only a little of the time/None of the time/Refused",
  "Is what you know about environmental health specialists because you learned about this in your job Yes, learned about this in my job/No, did not learn about this in my job/Refused",
  "Thinking about environmental health specialists, how often would you say they do a good job providing recommendations about how to address risks to human health from the environment All or most of the time/Some of the time/Only a little of the time/None of the time/Refused",
  "Is what you know about environmental health specialists because you learned about this in school Yes, learned about this in school/No, did not learn about this in school/Refused",
  "Is what you know about dietitians because you have heard or read about this in the news Yes, have heard or read about this in the news/No, have not heard or read about this in the news/Refused",
  "In general, would you say your view of dietitians is Mostly positive/Mostly negative/Neither positive nor negative/Refused",
  "How much, if anything, do you know about what dietitians do? A lot/A little/Nothing at all/Refused",
  "How often, if at all, do you think environmental health specialists face serious consequences if they engage in professional misconduct? All or most of the time/Some of the time/Only a little of the time/None of the time/Refused",
  "Overall, do you think professional misconduct by environmental health specialists is A very big problem/A moderately big problem/A small problem/Not a problem at all/Refused",
  "When you hear or read news stories about professional misconduct by environmental health specialists, do you think of these cases as Isolated incidents/Signs of a broader problem/Refused",
  "When you hear about problems with professional misconduct among environmental health specialists, which comes closer to your view, even if neither is exactly right? Most environmental health specialists have good intentions, it's the system that's broken/The system can work fine, it's the environmental health specialists that are the problem/Refused",
  "By the year 2050, do you think the overall condition of the environment will be Better than it is now/Worse than it is now/About the same as it is now/Refused",
  "Still thinking about the future of our country, how worried are you, if at all, about climate change? Very worried/Fairly worried/Not too worried/Not at all worried/Refused",
  "How often, if at all, do you think dietitians face serious consequences if they engage in professional misconduct? All or most of the time/Some of the time/Only a little of the time/None of the time/Refused",
  "How important do you think scientific research that has immediate practical applications types of scientific research is for society? Essential/Important, but not essential/Not too important/Not important at all/Refused",
  "When you hear about problems with professional misconduct among dietitians, which comes closer to your view, even if neither is exactly right? Most dietitians have good intentions, it's the system that's broken/The system can work fine, it's the dietitians that are the problem/Refused",
  "How important do you think scientific research that advances knowledge, even if there are no immediate benefits types of scientific research is for society? Essential/Important, but not essential/Not too important/Not important at all/Refused",
  "Thinking about dietitians, how often would you say they care about the best interests of their patients All or most of the time/Some of the time/Only a little of the time/None of the time/Refused",
  "Overall, do you think professional misconduct by dietitians is A very big problem/A moderately big problem/A small problem/Not a problem at all/Refused",
  "When you hear or read news stories about professional misconduct by dietitians, do you think of these cases as Isolated incidents/Signs of a broader problem/Refused",
  "When you hear that a science practitioner has received financial incentives from the federal government related to their work, does this make you Trust the recommendation more/Trust the recommendation less/Makes no difference either way/Refused",
  "When you hear that a science practitioner is open to getting a second opinion on their recommendation, does this make you Trust the recommendation more/Trust the recommendation less/Makes no difference either way/Refused",
  "When you hear that a science practitioner's recommendation is based on a review from an independent committee, does this make you Trust the recommendation more/Trust the recommendation less/Makes no difference either way/Refused",
  "In general, would you say the following statements describes most research scientists well? Intelligent Describes research scientists well/Does not describe research scientists well/Refused",
  "When you hear that a science practitioner has received financial incentives from an industry group related to their work, does this make you Trust the recommendation more/Trust the recommendation less/Makes no difference either way/Refused",
  "When you hear that data used in scientific research is being made openly available to the public, does this make you Trust the research findings more/Trust the research findings less/Makes no difference either way/Refused",
  "When you hear about scientific research that has been funded by the federal government, does this make you Trust the research findings more/Trust the research findings less/Makes no difference either way/Refused",
  "When you hear that scientific research findings have been reviewed by an independent committee, does this make you Trust the research findings more/Trust the research findings less/Makes no difference either way/Refused",
  "When you hear about scientific research that has been funded by an industry group, does this make you Trust the research findings more/Trust the research findings less/Makes no difference either way/Refused",
  "Thinking about medical research scientists, how often would you say they care about the best interests of the public All or most of time/Some of the time/Only a little of the time/None of the time/Refused",
  "Thinking about medical research scientists, how often would you say they are transparent about potential conflicts of interest with industry groups in their research All or most of time/Some of the time/Only a little of the time/None of the time/Refused",
  "When you hear or read news stories about research misconduct by medical research scientists, do you think of these cases as Isolated incidents/Signs of a broader problem/Refused",
  "Overall, do you think research misconduct by medical research scientists is A very big problem/A moderately big problem/A small problem/Not a problem at all/Refused",
  "Thinking about medical research scientists, how often would you say they do a good job conducting research All or most of time/Some of the time/Only a little of the time/None of the time/Refused",
  "Thinking about medical research scientists, how often would you say they provide fair and accurate information when making statements about their research All or most of time/Some of the time/Only a little of the time/None of the time/Refused",
  "Thinking about medical research scientists, how often would you say they admit mistakes and take responsibility for them All or most of time/Some of the time/Only a little of the time/None of the time/Refused",
  "In general, would you say the following statements describes most research scientists well? Good communicators Describes research scientists well/Does not describe research scientists well/Refused",
  "Thinking about dietitians, how often would you say they do a good job of providing recommendations about healthy eating All or most of the time/Some of the time/Only a little of the time/None of the time/Refused",
  "When you hear about problems with research misconduct among medical research scientists, which comes closer to your view, even if neither is exactly right? Most medical research scientists have good intentions, it's the research system that's broken/The research system can work fine, it's the medical research scientists that are the problem/Refused",
  "How often, if at all, do you think medical research scientists face serious consequences if they engage in research misconduct? All or most of the time/Some of the time/Only a little of the time/None of the time/Refused",
  "In general, would you say your view of environmental research scientists is Mostly positive/Mostly negative/Neither positive nor negative/Refused",
  "Thinking about dietitians, how often would you say they provide fair and accurate information when making recommendations All or most of the time/Some of the time/Only a little of the time/None of the time/Refused",
  "Is what you know about environmental health specialists because you have heard or read about this in the news Yes, have heard or read about this in the news/No, have not heard or read about this in the news/Refused",
  "Thinking about dietitians, how often would you say they admit mistakes and take responsibility for them All or most of the time/Some of the time/Only a little of the time/None of the time/Refused",
  "How much, if anything, do you know about what environmental health specialists do? A lot/A little/Nothing at all/Refused",
  "In general, would you say your view of environmental health specialists is Mostly positive/Mostly negative/Neither positive nor negative/Refused",
  "Is what you know about environmental health specialists because you know someone who does this Yes, know someone who does this/No, do not know someone who does this/Refused",
  "In general, would you say the following statements describes most research scientists well? Honest Describes research scientists well/Does not describe research scientists well/Refused",
  "In general, would you say the following statements describes most research scientists well? Skilled at working in teams Describes research scientists well/Does not describe research scientists well/Refused",
  "In general, would you say the following statements describes most research scientists well? Don't pay attention to the moral values of society Describes research scientists well/Does not describe research scientists well/Refused",
  "In general, would you say the following statements describes most research scientists well? Cold Describes research scientists well/Does not describe research scientists well/Refused",
  "In general, would you say the following statements describes most research scientists well? Socially awkward Describes research scientists well/Does not describe research scientists well/Refused",
  "In general, would you say the following statements describes most research scientists well? Focused on solving real-world problems Describes research scientists well/Does not describe research scientists well/Refused",
  "In general, would you say the following statements describes most research scientists well? Close-minded Describes research scientists well/Does not describe research scientists well/Refused",
  "Which of these statements comes closer to your own view, even if neither is exactly right? Scientists make judgments based solely on the facts/Scientists' judgments are just as likely to be biased as other people's/Refused",
  "Thinking about dietitians, how often would you say they are transparent about potential conflicts of interest with industry groups in their work All or most of the time/Some of the time/Only a little of the time/None of the time/Refused",
  "In general, would you say the following statements describes most research scientists well? Feel superior to others Describes research scientists well/Does not describe research scientists well/Refused",
  "Which of the following best describes what you think about the scientific method? The scientific method generally produces accurate conclusions/The scientific method can be used to produce any conclusion the researcher wants/Refused",
  "If you were deciding what the federal government should do to improve the quality of life for future generations, what priority would you give to dealing with climate change? A top priority/An important, but not a top priority/A lower priority/Should not be done/Refused",
  "If you were deciding what the federal government should do to improve the quality of life for future generations, what priority would you give to increasing spending on scientific research? A top priority/An important, but not a top priority/A lower priority/Should not be done/Refused",
  "How likely do you think it is that the following will happen in the next 30 years? The world will face a major energy crisis Will definitely happen/Will probably happen/Will probably not happen/Will definitely not happen/Refused",
  "How much, if anything, would you be willing to change about how you live and work to help reduce the effects of global climate change? Would you be willing to make A lot of changes/Some changes/Only a few changes/No changes at all/Refused",
  "How concerned are you, if at all, that global climate change will harm you personally at some point in your lifetime? Very concerned/Somewhat concerned/Not too concerned/Not at all concerned/Refused",
  "Would you say the US is doing a good or bad job dealing with global climate change? Very good job/Somewhat good job/Somewhat bad job/Very bad job/Refused",
  "Would you say the European Union is doing a good or bad job dealing with global climate change? Very good job/Somewhat good job/Somewhat bad job/Very bad job/Refused",
  "Would you say the United Nations are doing a good or bad job dealing with global climate change? Very good job/Somewhat good job/Somewhat bad job/Very bad job/Refused",
  "How much of a priority should the following be for the federal government to address: Addressing climate change A top priority/Important, but lower priority/Not too important/Should not be done/Refused",
  "Thinking about long-range foreign policy goals, how much priority, if any, do you think dealing with global climate change should be given? Top priority/Some priority/No priority/Refused",
  "Would you say China is doing a good or bad job dealing with global climate change? Very good job/Somewhat good job/Somewhat bad job/Very bad job/Refused",
  "How confident are you, if at all, that the actions taken by the international community will significantly reduce the effects of global climate change? Very confident/Somewhat confident/Not too confident/Not at all confident/Refused",
  "Do you think actions taken by the international community to address global climate change, such as the Paris climate agreement, will mostly Benefit America's economy/Harm America's economy/Have no impact on America's economy/Refused",
  "Even if you are not sure, which of these is closer to your views? Humans have evolved over time/Humans have existed in their present form since the beginning of time/Other view/Refused",
  "Even if you are not sure, which statement comes closest to your view? Humans have evolved over time due to processes such as natural selection; God or a higher power had no role in this proc/Humans have evolved over time due to processes that were guided or allowed by God or a higher power/Humans have existed in their present form since the beginning of time/Other view/Refused",
  "What are your thoughts on climate change and its impact on our planet? Would you say this phenomenon is largely human-induced/Earth's natural cycles contribute more significantly/Unsure or cross-opinion/Refused",
  "How much trust, if any, would you put in the scientific consensus regarding human activities accelerating global warming? Complete faith/Somewhat trust/Disagree with the consensus/Refused",
  "Please reflect on the merits of renewable energy. Would you say transitioning to clean energy is Urgent and necessary/Important but not urgent/Not as important as economic growth/Refused",
  "Should genetically modified organisms (GMOs) be part of our food supply considering their potential to enhance food security? Yes, they should/On a conditional basis/No, they shouldn't/Refused",
  "Discuss the role of nuclear energy in battling climate change. Is it considered a Necessary solution/One of many solutions/Too risky an approach/Refused",
  "Do you agree with the implementation of carbon taxes as a means to discourage pollution? Strongly agree/Somewhat agree/Disagree/Refused",
  "What's your stance on vaccinations and their role in public health? Mandatory for all/Personal choice/Against them entirely/Refused",
  "On the topic of space exploration, do you believe this to be a worthy investment of public funds? Significant importance/Interest but other issues take precedence/Little to no value/Refused",
  "Discuss your views on animal testing for scientific and medical research. Is it Considered necessary/A necessary evil/Ethically wrong/Refused",
  "What is your perspective on the use of pesticides in farming considering their potential environmental effects? Completely Acceptable/Allowable with regulations/Completely unacceptable/Refused",
  "Should government heavily fund scientific research? Absolutely/Somewhat/No need/Refused",
  "What's your stance on the extraction and use of fossil fuels in light of climate change? Should continue/Sustain but look for alternatives/Should end immediately/Refused",
  "How concerned, if at all, are you about the loss of biodiversity on our planet? Very Concerned/Mildly Concerned/Not Concerned at all/Refused",
  "How do you view the role of artificial intelligence in modern society? Highly beneficial/Potentially dangerous/Indifferent or unsure/Refused",
  "Considering the potential long-term effects, should we proceed with the development of gene-editing techniques such as CRISPR? Yes/With caution/No/Refused",
  "How much do you support the protection of endangered species and their habitats? Fully support/Support with conditions/Do not support/Refused",
  "Do you favor or oppose the idea of geoengineering as a solution to combat climate change? Favor/Oppose/Undecided or no opinion/Refused",
  "What are your thoughts on the use of antibiotics in livestock given the risk of antibiotic resistance? Should continue with current usage/Usage should be reduced/Should be fully stopped/Refused",
  "Discuss your perspective on the significance of mathematics in understanding and addressing global issues. Essential/Helpful but not essential/Not important/Refused",
  "Do you agree with governments disseminating climate change information and the need for proactive action to the general public? Yes/Depends on how it's done/No/Refused",
  "Considering the state of our planet, do you believe geoengineering should be initiated to combat climate change? Will definitely need geoengineering/Will probably need geoengineering/Will probably not need geoengineering/Will definitely not need geoengineering/Refused",
  "What's your opinion about the government promoting the use of genetically modified organisms (GMOs) in agriculture to ensure food security? Should definitely promote/Should probably promote/Should probably not promote/Should definitely not promote/Refused",
  "Do you view Nuclear power as a viable solution to mitigate the energy crisis in future decades? Viable solution/Possible solution/Unlikely solution/Definitely not a solution/Refused",
  "What do you think about a government's role in funding space research? Essential role/Significant role/Moderate role/No role/Refused",
  "Should governments intervene to regulate the usage of Artificial Intelligence in daily life? Definitely should intervene/Probably should intervene/Probably should not intervene/Definitely should not intervene/Refused",
  "How do you assess the significance of renewable energy to decrease the reliance on fossil fuels? Absolutely necessary/Very important/Moderately important/Not important at all/Refused",
  "What do you think about governments legalizing the medicinal use of psychedelics? Should definitely legalize/Should probably legalize/Should probably not legalize/Should definitely not legalize/Refused",
  "With the advent of modern technology in farming, do you believe organic farming has a significant role in sustainable development? Definitely has a role/Probably has a role/Probably doesn't have a role/Definitely doesn't have a role/Refused",
  "What's your take on the government's responsibility to ensure clean water access for all citizens? Fully responsible/Largely responsible/Somewhat responsible/Not responsible at all/Refused",
  "In the context of increasing plastic waste, do you believe biodegradable materials will be dominant in the future? Will definitely be dominant/Will probably be dominant/Will probably not be dominant/Will definitely not be dominant/Refused",
  "What do you think about the government using science to guide policy decisions, even if it contradicts popular opinion? Should definitely guide/Should probably guide/Should probably not guide/Should definitely not guide/Refused",
  "To what extent do you agree that regulation is necessary to control the development and application of autonomous vehicles? Completely agree/Partly agree/Partly disagree/Completely disagree/Refused",
  "How do you rank the importance of scientific literacy amongst the general population for a functioning democracy? Very important/Moderately important/Minimally important/Not important at all/Refused",
  "Should the government use tax incentives to promote the use of green energy options? Must definitely use/Should probably use/Probably shouldn't use/Definitely shouldn't use/Refused",
  "What are your thoughts on Big Pharma's influence over medical research? High influence/Moderate influence/Minor influence/No influence/Refused",
  "Should governments globally harmonize their laws concerning digital privacy and the use of personal data? Must harmonize/Mostly should harmonize/Mostly should not harmonize/Must not harmonize/Refused",
  "What's your opinion on the potential genetic modification of human embryos to correct heritable diseases? Should definitely allow/Should probably allow/Should probably not allow/Should definitely not allow/Refused",
  "What's your view on the government's role in funding research into mental health? Should fully fund/Should largely fund/Should moderately fund/Shouldn't fund at all/Refused",
  "Should climate change be given priority in a government's science and technology research budget? Should definitely prioritize/Should probably prioritize/Should probably not prioritize/Should definitely not prioritize/Refused",
  "In the context of climate change and rising sea levels, should coastal cities invest significantly in drastic adaptation methods? Definitely should invest/Probably should invest/Probably should not invest/Definitely should not invest/Refused",
  "What is your stance on the use of nuclear energy as a method to combat climate change? A sustainable solution/More harm than good/No opinion",
  "Do you believe space exploration and colonization should be prioritized over solving Earth's issues? Essential for survival/Earth first/Undecided",
  "How do you feel about technological modification of food crops for better yield and resistance to pests? Positive development/Leads to unforeseen problems/Neutral stance",
  "Do you think policy-makers should give more weight to the opinions of scientists in shaping policies about climate change? Crucially important/Unnecessary emphasis/Neutral",
  "Does reliance on technology and artificial intelligence for decision-making and problem-solving scare you for the future? Leads to progress/Undermines human intelligence/Undecided",
  "In your viewpoint, does advanced robotics and automation more likely lead to job creation or job losses in the future? Job creation/Job losses/Unsure",
  "Is the large-scale cloning of animals for livestock farming a good idea? Ethical solution/More negative than positive/Undecided",
  "How much confidence do you have in AI systems to conduct accurate and unbiased hiring practices? A great deal of confidence/Not too much confidence/No confidence at all/Refused",
  "Do you think the large investments and resources spent on quantum computing research are justified? A worthy investment/Waste of resources/No opinion",
  "Should society place more hope in science to solve global challenges such as pandemics, climate change, and food security? Science as a savior/Over-emphasized/Neutral",
  "Should we continue the use of fossil fuels for energy until a more sustainable alternative is fully operational? Continue use/Put a stop/Neutral",
  "Is it the role of scientists to communicate their findings to the public, or should they just focus on research? Scientists must communicate/Not their job/Undecided",
  "How much influence should private enterprises have in shaping our space exploration endeavors? Significant influence/Minimal influence/No opinion",
  "Would you support the use of geoengineering to combat climate change? Favorable/Against it/Undecided",
  "Do you believe gene editing should be used to enhance human abilities? Supportive/Opposed/Neutral",
  "Would you support government funding for Stem Cell research? Supportive/Opposed/Neutral",
  "How comfortable are you with the idea of living alongside advanced AI systems in daily life? Comfortable/Uncomfortable/Neutral",
  "What is your stance on the use of pesticides in agriculture? Necessary evil/Must be banned/Neutral",
  "Do you see technology causing a divide in society or uniting people together? Cause divide/Unite people/Can't say",
  "What's your view on integrating AI into healthcare for diagnosis and treatment decisions? A great advancement/A risky approach/Neutral",
  "In considering the depletion of natural resources, would you endorse a more accelerated switch to renewable energy sources or advocate for the continuation of traditional energy industries? Complete transition towards renewable energy / Sustainable use of traditional energy / Refused?",
  "Do technological advancements, like 5G networks, excite you for the future or worry you due to potential health risks? Excites for the future / Worry due to health risks / Refused?",
  "In respect to genetically modified food, do you believe GMOs pose a potential health threat, or do you see them as a solution to global hunger? Solution to global hunger / Potential health threat / Refused?",
  "Considering nuclear technology, do you view nuclear energy as a pollution-free power source or a high-risk option due to radioactive waste? Pollution-free power source / High risk option / Refused?",
  "In terms of space exploration, would you favor a focus on Mars colonization or do you think resources would be better spent on solving earthly problems first? Focus on Mars colonization / Spend resources on earthly problems / Refused?",
  "What are your thoughts about the emergence of cryptocurrencies? Do you perceive them as revolutionizing finance or as an unstable and risky venture? Revolutionizing finance / Unstable and risky venture / Refused?",
  "What kind of priority should be given towards research on preventive healthcare through genetic testing? Top priority / Important but not a top priority / Lower priority / Should not be done / Refused?",
  "In regards to physics research, does working towards a Theory of Everything excite you or seem like impractical academic pursuit? Excites you / Seems impractical / Refused?",
  "Thinking of the state of our oceans, how significant do you find the threat of plastic pollution is? Highly significant / Somewhat significant / Not significant / Refused?",
  "In your opinion, which country should lead the global efforts in mitigating climate change? USA/China/Europe/Other",
  "What are your thoughts on incorporating climate change education into the school curriculum? Yes/No",
  "Do you believe that human activities are the primary cause of climate change? Agree/Disagree",
  "Should funding for space exploration be increased? Yes/No",
  "What's your stance on using nuclear power for energy? For/Against",
  "What are your views on Genetically Modified Organisms (GMOs)? Positive/Negative",
  "Do you think schools should encourage more students to pursue careers in the STEM (Science, Technology, Engineering, Mathematics) fields? Yes/No",
  "On the subject of artificial intelligence, is it a danger or an opportunity? Danger/Opportunity",
  "Should the government increase funding for scientific research? Yes/No",
  "Are vaccines a vital part of public health or an intrusion into personal freedom? Vital part of public health/Intrusion into personal freedom",
  "Do you think research into renewable energy sources should be a fundamental goal for humanity? Yes/No",
  "Do you think investing in the development of hydrogen as a clean energy source is a good idea? Yes/No",
  "Should countries aggressively tax carbon emissions to tackle climate change? Yes/No",
  "What is your view on solar geoengineering as a solution to climate change? Favorable/Unfavorable",
  "Do you believe that governments should mandate recycling? Yes/No",
  "Do you think employing machines to perform jobs traditionally done by humans is a step forward or backward for society? Forward/Backward",
  "Do you think federal policies should reward companies that are committed to sustainable practices? Yes/No",
  "Should genetic modification of human embryos for disease prevention be allowed? Yes/No",
  "What are your thoughts on subjecting animals to cosmetic testing? For/Against",
  "Should countries worldwide align their policies to make Mars colonization a joint, global venture? Yes/No",
  "In your opinion, should the federal government invest more in renewable energy sources, or should we continue to rely on fossil fuels? Invest more in renewable energy/Keep relying primarily on fossil fuels/Invest equally in both/Maintain current levels of investment/Refused",
  "How significant, in your view, is the impact of human activities on climate change? Major impact/Minor impact/No impact at all/Natural processes majorly contribute to climate change/Refused",
  "Which of the following should take precedence: economic growth or environmental conservation? Economic growth/Environmental conservation/Both are equally important/Refused",
  "Does the government need more or less taxation on energy inefficient products to promote green practices? More taxation/Less taxation/No taxation/Refused",
  "Do you believe in the possibility of creating sustainable communities through the implementation of green energy solutions? Yes/No/Dependent on other factors/Refused",
  "How important is it for educational institutions to incorporate more courses related to climate change and environmental conservation? Very important/Important but not crucial/Not very important/Unimportant/Refused",
  "Should pharmaceutical companies be required to release all their clinical trial data to enhance transparency? Yes/No/It depends on the nature of the data/Refused",
  "How important is nuclear energy in achieving a carbon-neutral future? Very crucial/Important but not critical/Not very important/Not important at all/Refused",
  "What is your opinion on the use of genetically modified organisms (GMOs) in agriculture? Positive/Negative/Neutral/Unsure/Refused",
  "Do you believe that space exploration should be prioritized over addressing domestic issues? Yes/No/Space exploration and domestic issues should equally share focus/Refused",
  "How important are ethical guidelines in AI development? Essential/Important but not essential/Unimportant/Refused",
  "Should technology companies be given more leeway in experimenting with artificial intelligence even if it has potential risks? Yes/No/It depends on the potential risks/Refused",
  "How important is it for every citizen to have a decent understanding of basic scientific principles? Essential/Good to have/Not necessary/Refused",
  "What is your stance on using animals in testing for scientific research? Completely acceptable/Only acceptable in absence of alternatives/Unacceptable under all circumstances/It depends on the type of research/Refused",
  "Should government agencies have the power to regulate content on social media platforms to prevent the spread of misinformation? Yes/No/Maybe if certain conditions are met/Refused",
  "How significant do you think is the contribution of artificial intelligence in shaping the future of our societies? Very significant/Somewhat significant/Not very significant/Insignificant/Refused",
  "Do you believe clean energy technologies will ever replace fossil fuel-based energy sources completely? Yes/No/It's possible in the foreseeable future/Refused",
  "Should there be more government oversight in technology companies for data privacy and security reasons? Yes/No/It depends on the company/Refused",
  "How important is it to maintain biodiversity while pursuing urban development? Extremely important/Important/Not as important/Not at all important/Refused",
  "Where do you stands on the issue of climate change? Do you believe it is largely caused by human activities, a natural phenomenon, or something else?",
  "Contemplate if state-funded schools should be required to teach students about evolution theory or should it be left to individual preference.",
  "Where do you stand on the implementation of AI in our daily lives? Is this an inevitable technological evolution or a potential threat to humankind?",
  "Considering the rise in antibiotic resistance, what's your take on the overuse of antibiotics in healthcare and agriculture?",
  "When it comes to the development of nuclear energy, do you think it represents a valuable source of clean energy or opens up Pandora's box of risks?",
  "Do you believe the Brain-Computer Interface technology is perceivable as a life-changing innovation or a threat to personal privacy?",
  "How do you perceive the use of genetically modified organisms (GMOs) in our food supply? Is it a necessary means to feed the growing population or an unnatural interference?",
  "Considering the commercialization of space, do you see it as an exciting new frontier for mankind or a dangerous commercial free-for-all?",
  "How do you view the role of Government in scientific advancement? Should it be active in funding research or let the free market decide?",
  "What's your standpoint on stem cell research? Is it a valuable field with potential medical breakthroughs or a practice that breeches ethical lines?",
  "Do you think the controversial technology of human cloning can have a beneficial impact on medical research or will it lead to ethically dangerous situations?",
  "Do you agree with the concept of technological singularity, wherein artificial intelligence surpasses human intelligence, benefitting humankind or leading to unforeseeable negative consequences?",
  "Where do you stand on the debate regarding fracking? Is it an economical way to extract natural gas or environmental destruction in disguise?",
  "What is your perception of vaccinations? Are they crucial for public health or do individuals have the rights to refuse?",
  "Can the implementation of autonomous vehicles facilitate mobility and mitigate traffic congestion or it poses threats to employment and security?",
  "Are the advancements in biotechnology enhancing the betterment of society or are they crossing the redline of ethical concerns?",
  "How do you perceive the ongoing technological advancements - are they shrinking the gap between social classes by democratizing information or widening it by creating digital divides?",
  "What is your opinion concerning nanotechnology? Will this sector lead to groundbreaking achievements or are there hidden risks we are not ready to handle?",
  "Do you concur that experimenting with gene editing technologies like CRISPR might result in unforeseen genetic issues in the future, or it could change the healthcare landscape entirely?",
  "Do you think Plastic pollution is an immense global issue that requires immediate and severe measures, or it is rather a manageable issue?",
  "What do you make of the pursuit of immortality through scientific and medical advancements? Should we take steps in this direction, or should we respect the natural course of life and death?",
  "Based on your perspective, do you think climate change is a significant problem that needs immediate attention? Significant problem/Not a significant problem/Refused",
  "Do you believe that governmental organizations should fund scientific research? Should fund/Should not fund/Refused",
  "Concerning genetically modified organisms, do you consider them to be safe for human consumption? Safe/Not safe/Refused",
  "Do you think that vaccines should be mandatory for all children, as suggested by the vast majority of medical scientists? Should be mandatory/Should not be mandatory/Refused",
  "In your opinion, does private interest and corporate funding compromise the integrity of scientific research? Compromise/Does not compromise/Refused",
  "Would you agree that the benefits of scientific advancements outweigh the potential risks? Agree/Disagree/Refused",
  "Do you consider space exploration to be a valuable use of resources? Valuable/Not valuable/Refused",
  "Do you believe that the scientific community should have political influence? Should have influence/Should not have influence/Refused",
  "What is your view on the fossil fuel industrys influence on climate change research? Too much influence/Not enough influence/About right/Refused",
  "Do you believe that a lack of scientific literacy is a problem in society? Is a problem/Not a problem/Refused",
  "Do you think nuclear energy is a viable alternative to fossil fuels? Is a viable alternative/Is not a viable alternative/Refused",
  "Does the idea of evolution align with your beliefs? Align/Does not align/Refused",
  "According to you, how much does the government influence scientific research? Too much influence/About right/Not enough influence/Refused",
  "Do you think that the usage of artificial intelligence (AI) in everyday life poses threats to privacy and security? Poses threats/Does not pose threats/Refused",
  "Do you believe that stem cell research should be promoted despite ethical controversies? Should be promoted/Should not be promoted/Refused",
  "How important do you think it is for schools to teach climate change education? Very important/Somewhat important/Not important at all/Refused",
  "Do you hold a negative view towards the use of animals in scientific research? Negative view/Positive view/Neutral view/Refused",
  "Would you say that women are adequately represented in the scientific community? Adequately represented/Underrepresented/Refused",
  "How crucial do you think it is to address the ethical issues related to genetic editing techniques like CRISPR? Very crucial/Somewhat crucial/Not at all crucial/Refused",
  "Do you believe that the focus on Mars exploration takes away resources that could be better spent on Earth's problems? Takes away resources/Does not take away resources/Refused",
  "Do you believe that the advancement in technology particularly robots and AI will lead to a loss of jobs ? A loss of jobs/No loss of jobs but change in job nature/Boost in employment/Refused",
  "Do you think governments should invest more in space exploration, considering the numerous problems Earth is facing? The funding should be used for earthly problems instead/Space exploration is crucial for our advancement and survival/Refused",
  "Consider a future where robots and AI have come to dominate the workforce. Who do you think should be responsible for the welfare of displaced workers? The government/The companies which use robots and AI/Nobody's responsibility/Refused",
  "Should medical research be allowed to use animal testing in pursuit of advances in medicine and understanding of diseases? Yes, it is necessary for progress/No, animal rights outweigh such benefits/Yes, but with oversight and strict regulations/Refused",
  "Consider the debate over genetically modified foods (GMO). Do you think GMOs are safe to consume and beneficial for the worlds food supply? Yes, they are safe and beneficial/No, they should be avoided/Yes, but more research is needed/Refused",
  "How much trust do you place in scientists when it comes to providing reliable information related to climate change? Complete trust/Some trust/Distrust/Refused",
  "Should governments around the world contribute to a global fund for climate change mitigation, given that it affects everyone on Earth? Yes, it's a shared responsibility/No, every country should handle its own climate initiatives/Refused",
  "How should renewable energy be prioritized compared to traditional fossil fuels? Renewable energy should be the priority/Traditional fossil fuels should continue to be used/Renewable energy and fossil fuels should be balanced/Refused",
  "Do you think teaching Evolutionary Theory in the educational curriculum contributes to moral decay in society? Yes, it leads to moral decay/No, it doesn't affect morality/Refused",
  "Should a scientist's political views influence their access to government funding for research? Yes, political views should matter/No, political views should not matter/Refused",
  "Do you believe scientists should have the freedom to genetically engineer athletes to enhance their performance levels? Yes, in the interests of advancement/No, it is ethically wrong/Yes, but with strict regulations/Refused",
  "How do you view the merging of human consciousness with Artificial Intelligence? A dangerous path that we should never explore/A necessary step in human evolution/Interesting, but requires careful deliberation/Refused",
  "Would you support a global ban on nuclear energy considering the risks posed by accidents and the storing of waste? Yes, the risks are too high/No, nuclear energy is essential for our energy demands/It depends/Refused",
  "Should taxpayers money be used to fund studies in fields like quantum physics and string theory, which have little immediate practical application? Yes, all scientific research is valuable/No, only research with immediate practical benefits should be funded/Refused",
  "Do you support the extensive use of pesticides in agriculture given that it could potentially harm the environment? Yes, for higher yield/No, environment should be priority/Yes, but stricter regulations should be enforced/Refused",
  "What's your view on implementing a universal basic income for all, anticipating a future where AI and automation will replace many jobs? It's imperative to do so/It's not a feasible solution/Its a possibility that requires more analysis/Refused",
  "Should the government impose regulations on companies developing artificial intelligence to prevent potential misuse? Yes, regulations are necessary/No, it stifles innovation/Yes, but not very strict regulations/Refused",
  "In the interest of public health, should vaccinations be made mandatory for all, barring medical exemptions? Yes, health risks are too high/No, it infringes upon personal freedom/Yes, but with exceptions for religious or other reasons/Refused",
  "What's your view on the possibility of colonizing other planets? Would it divert attention from our own planet's issues or ensure humans' survival? Divert attention from Earth's issues/Ensure humanity's survival/Both have valid points/Refused",
  "Do you believe that it's possible to achieve a balance between technological progress and ethical considerations, or does one always jeopardize the other? Balance is possible/One jeopardizes the other/It depends on the situation/Refused",
  "Tell me about the effect space exploration has had on our lives. Has it been mostly positive, mostly negative or you can't decide? Most positive/mostly negative/can't decide/Refused",
  "Do you think that human progress should be the primary consideration when making decisions about energy production, even if it risks damaging the environment? Yes/No/Refuse",
  "In your opinion, does climate change pose a clear and direct existential threat to the human race? Year, poses a clear and direct Threat/ No, Doesn't poses a clear and direct threat/Can't say for sure/Refused",
  "What's your take on the use of artificial intelligence in automation and job loss? Is it a concern or an opportunity? A concern/A opportunity/Refused",
  "Can medical technology ever be taken too far in the quest to improve human health or should limits be set? Yes, it can be taken too far/No, limits should not be set/Refused",
  "Is our reliance on technology causing more harm than good to the younger generation? Yes/No/Refused",
  "Are you for or against the use of nuclear technology for civilian purposes, such as energy production? For/Against/Can't say for sure/Refused",
  "Do you believe that we should focus more on renewable energy sources than fossil fuels, despite the current economic impacts? Yes/No/Refused",
  "Do you think the use of genetically modified organisms (GMOs) in agriculture is a positive step forward or does it raise ethical questions? Positive step forward/ Raises ethical questions/Can't say for sure/Refused",
  "According to you, does the proactive manipulation of weather patterns, known as cloud seeding, lead to positive or negative consequences? Positive consequences/Negative consequences/Can't say for sure/Refused",
  "Do you agree that funding for space exploration could be better used for solving Earthly problems? Yes/No/Refused",
  "Do you think artificial intelligence will be beneficial or detrimental to society? Beneficial/Detrimental/Refused",
  "Do you believe the benefits of fracking for natural gas outweigh the potential environmental risks? Yes/No/Refused",
  "Should more funding be allocated to researching alternative, renewable forms of energy? Yes/No/Refused",
  "Do you think technology companies have too much power? Yes/No/Refused",
  "Could science and technological advances be contributing to social isolation? Yes/No/Refused",
  "What's your stance on the production of synthetic meat? Do you think it's an innovative solution or an unnatural intervention? Innovative Solution/Unnatural Intervention/Refused",
  "Do you think major ecosystems like rainforests should be protected regardless of economic opportunities for human exploitation? Yes/No/Refused",
  "How does gene editing technology make you feel: empowered, fearful, or neither? Empowered/Fearful/Neither/Refused",
  "Are you concerned that AI could eventually replace human decision making in important areas? Yes/No/Refused",
  "How would you respond to the claim that advancements in artificial intelligence and machine learning can potentially render a significant portion of the workforce obsolete?",
  "Do you agree with the statement that the government should invest more in scientific research and development, even if it means higher taxes?",
  "Should we implement policies that mandate vaccination for all, barring medical contraindications, to achieve herd immunity against preventable diseases?",
  "Given the looming threat of climate change, do you believe scientists should be given a more substantial role in national policy-making?",
  "With the rapid rise of genetically modified organisms (GMOs) in agriculture, do you agree with their wider adoption if they can potentially lead to greater yields and better resistance to pests?",
  "Considering the ethical implications, should human genetic modification be banned, despite the potential benefits it may bring like eradicating hereditary diseases?",
  "In light of recent advancements in neurotechnology, do you believe the use of Brain-Computer Interfaces (BCI) should be regulated to prevent potential misuse and protect individual privacy?",
  "In the face of increasing concerns about antibiotic resistance, should the use of antibiotics in agriculture be more strictly regulated?",
  "Should nuclear power be part of the energy mix given its high energy output and low greenhouse gas emissions, even considering potential safety concerns and disposal of radioactive waste?",
  "Should the search for extraterrestrial life be a higher priority in our space exploration endeavors considering the potentially significant implications for our understanding of the universe and our place in it?",
  "Do you consider that the advancement of artificial intelligence (AI) and automation will lead to significant job loss? Certainly/Perhaps/Unlikely/Never/Refused",
  "Do you agree that nuclear power is an essential tool in fighting climate change? Completely agree/Partially agree/Disagree/Strongly disagree/Refused",
  "Would you support mandatory vaccinations to ensure public health? Yes, support/No, do not support/Undecided/Refused",
  "Are you optimistic about the potential of genetic engineering to solve food shortage globally? Very optimistic/Moderately optimistic/Cautious/Pessimistic/Refused",
  "Do you believe in the importance of space exploration despite financial costs and potential risks? Strongly agree/Agree/Neutral/Disagree/Strongly disagree/Refused",
  "Do you think that the development of self-driving cars will improve road safety significantly? Very likely/Somewhat likely/Not likely/Not at all likely/Refused",
  "Would you support the use of robotic surgeries even with potential risks? Fully support/Partially support/Not support/Strongly oppose/Refused",
  "Do you believe that science should push ethical boundaries for the advancement of knowledge?  Yes, should push/No, should maintain boundaries/Depends on the circumstances/Refused",
  "Do you foresee climate change as a significant factor shaping future global conflicts? Very likely/Moderately likely/Unlikely/Not at all likely/Refused",
  "Do you think that internet privacy is a myth in the age of big data? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "How feasible do you think renewable energy will replace fossil fuels entirely in the near future? Very feasible/Somewhat feasible/Not very feasible/Not at all feasible/Refused",
  "Should we trust the science behind genetically modified organisms (GMOs)? Completely trust/Partially trust/Skeptical/Do not trust at all/Refused",
  "Do you anticipate the use of quantum computers in everyday applications in the next decade? Very likely/Possible/Unlikely/Impossible/Refused",
  "How welcoming are you to human colonization of other planets? Very welcoming/Mildly welcoming/Indifferent/Against/Refused",
  "How crucial do you find incorporating AI in education? Very crucial/Somewhat crucial/Not crucial/Not at all crucial/Refused",
  "Would you approve human cloning if it were scientifically possible? Yes, would approve/No, would disapprove/Undecided/Refused",
  "Do you accept that climate change is primarily human-induced? Completely accept/Partially accept/Skeptical/Do not accept at all/Refused",
  "Do you believe that synthetic biology might create new forms of life? Believe fully/Believe partially/Do not believe/Strongly disagree/Refused",
  "Do you feel threatened by the prospect of superintelligent AI? Very threatened/Mildly threatened/Not at all threatened/Refused",
  "Do you support the development of genetically engineered infants to avoid hereditary diseases? Strongly support/Support/Opposition/Strong opposition/Refused",
  "Considering immunologists, how often would you say they help to prevent serious diseases? All or most of the time/Some of the time/Only a little of the time/None of the time/Refused",
  "When you hear about studies on climate change, do you tend to be increasingly alarmed, remain indifferent, or become skeptical? More alarmed/Indifferent/More skeptical/Refused",
  "Do you think corporations should be more regulated to reduce their environmental impact? Strongly agree/Agree/Neutral/Disagree/Strongly disagree/Refused",
  "When thinking about nuclear energy, do you see it as a necessary part of the solution to combat climate change? Highly necessary/Somewhat necessary/Not necessary/Refused",
  "Is your skepticism toward vaccine safety rooted in personal experience or belief in some conspiracy theories? Personal experience/Conspiracy theories/Both/Neither/Refused",
  "When confronted with statistics on global warming, do you tend to trust the data or question its accuracy? Trust/Question/Unsure/Refused",
  "Do you think that scientists tamper with the results of their research to secure funding? Most of the time/Sometimes/Rarely/Never/Refused",
  "When thinking about the benefits of GMO foods, do you consider them to be generally helpful or harmful? Helpful/Harmful/Neither both/Refused",
  "Do you believe researching alternative energy should be prioritized over traditional energy sources? Yes/No/Not sure/Refused",
  "When you think about the role of astrophysicists, would you say their work is essential for our understanding of the universe? Always/Mostly/Sometimes/Rarely/Never/Refused",
  "When considering bioengineers, would you agree that their work is crucial in developing medical advancements? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "How do you rate your trust in scientific consensus over controversial topics such as climate change or vaccines? Complete trust/Somewhat trust/Little trust/No trust/Refused",
  "On learning that a product is eco-friendly, do you feel more inclined to purchase it? Much more/Slightly more/No more/Refused",
  "Do you fully embrace the role of chemists in improving the quality of consumer products, or do you hold reservations? Fully embrace/Hold reservations/Unsure/Refused",
  "Does adequate funding for space exploration present a better return on investment compared to addressing immediate domestic issues? Yes/No/Not sure/Refused",
  "Do you trust the thoroughness of peer-reviewing process in scientific research or harbor doubts about its effectiveness? Trust/Harbor doubts/Both/None/Refused",
  "Do you believe human activity is the primary cause of increasing global temperatures, or do you attribute it to natural climatic changes? Human activity/Natural changes/Both/Neither/Refused",
  "When considering the safety of genetically engineered food, do you align more with the scientific viewpoint or public opinion? Scientific viewpoint/Public opinion/Neither/Both/Refused",
  "In terms of educating the public on scientific topics, do you believe school curriculums should be more focused on STEM subjects? Strongly agree/Can't decide/Disagree/Strongly disagree/Refused",
  "What are your thoughts about the importance of space exploration? Do you consider it a necessary investment or wasteful spending?",
  "From your perspective, can nuclear power be a solution for global energy problems, considering safety and waste disposal concerns?",
  "Regarding climate change, do you believe human activity plays a significant role?",
  "Do you think scientific consensus should be the main driver behind policies related to climate change?",
  "What is your stance on the use of animals for scientific research?",
  "How essential is it to invest in renewable energy technologies as a way to combat climate change?",
  "Do you believe genetically modified organisms (GMOs) can play a role in addressing global food security?",
  "Is it acceptable to reject or downplay scientific findings based on personal or political beliefs?",
  "Can the development of AI and robotics lead to significant job loss, or will it create new opportunities?",
  "Do you believe funding for stem cell research should be increased, considering its potential in curing fatal diseases?",
  "Should our actions to combat climate change prioritize global cooperation or nationalist interests?",
  "There has been talk about colonizing Mars in the foreseeable future. Do you find this prospect exciting or concerning?",
  "Is advancing toward a society dependent on artificial intelligence preferable or should we proceed with caution?",
  "In your opinion, does automation pose a significant threat to the job market, or should it be seen as another evolutionary step in technological progress?",
  "Should genetic engineering be utilized to eliminate hereditary diseases, or does it pose too many ethical dilemmas?",
  "Regarding the use of drones, do you foresee more benefits for society or privacy concerns?",
  "Should scientists focus more on renewable energy resources or exploring nuclear power as a solution to our energy needs?",
  "Can AI be a solution for many modern challenges, or does it pose more threats than it solves?",
  "Does the concept of geoengineering to combat climate change appeal to you or do you see it as a potential danger?",
  "Should we strive to achieve technological singularity, where AI surpasses human intelligence, or should we prevent it for humanity's sake?",
  "Would you say that the world is becoming better or worse due to advancements in genetic engineering? Becoming better/Becoming worse/Refused",
  "Are you of the opinion that space exploration is a futile endeavor or a necessity for human progress? Futile endeavor/ Necessity for human progress/ Refused",
  "Do you think that the promotion of artificial intelligence technology is an enhancement or a threat to the job market? Enhancement/Threat/Refused",
  "Regarding the use of nuclear energy, do you consider its benefits in terms of energy efficiency to outweigh the potentially catastrophic ecological risks? Benefits outweigh risks/Risks outweigh benefits/Refused",
  "Regarding climate change, do you think humans are primarily responsible, or is it a natural phenomenon? Humans are primarily responsible/Its a natural phenomenon/Refused",
  "In terms of the pandemic response, would you say that a scientific or an economic viewpoint would lead to the most effective outcome? Scientific viewpoint/ Economic viewpoint/Refused",
  "Considering plastic recycling processes, do you believe they are contributing significantly to the reduction of environmental pollution, or is the impact rather insignificant? Contributing significantly/Impact is insignificant/Refused",
  "When considering the development of vaccines, do you opine that they are a life-saving innovation or a potential risk to human health? Life-saving innovation/Potential risk to human health/Refused",
  "Regarding genetically modified foods, would you say that they are a necessity for addressing global food security or a potential threat to human health and biodiversity? Necessity for food security/Potential threat/Refused",
  "Regarding data privacy, how much do you believe technology companies should be regulated in terms of data access and use? Highly regulated/Moderately regulated/Less regulated/Not regulated/Refused",
  "When it comes to animal testing for scientific research, would you consider it a necessary evil or a cruel and inhumane practice? Necessary evil/ Cruel and inhumane practice/ Refused",
  "When considering scientific study of the brain (neuroscience), do you believe it more emphasizes the biological determinism of human behavior or the importance of human free will and choice? Biological determinism/ Human free will and choice/ Refused",
  "Considering stem cell research, do you perceive it as an ethical controversy or as a potential breakthrough in medicine? Ethical controversy/ Potential breakthrough in medicine/ Refused",
  "Regarding the theory of evolution, do you think it contradicts religious beliefs or can coexist peacefully with them? Contradicts religious beliefs/Can coexist peacefully/Refused",
  "As for artificial superintelligences, do you perceive them as a beneficial tool for problem-solving or a potential risk to humanity's existence? Beneficial tool/Potential risk/Refused",
  "About the utilisation of drones in scientific research, do you consider it an invasion of privacy or a revolution in data collection? Invasion of privacy/ Revolution in data collection/Refused",
  "Regarding the Big Bang theory, do you consider it as the only probable explanation of universe's origin or as one of many theories? Only probable explanation/One of many theories/Refused",
  "Do you consider the rising automation trend in the manufacturing industry to be a boon for economic progress or a threat to job security? Boon for economic progress/Threat to job security/Refused",
  "Do you believe that there is sufficient evidence to support the theory of evolution or do you lean towards the belief in creationism? Sufficient evidence supports evolution/The belief in creationism has more weight/Mixed views/Refused",
  "Do you think climate change regulations are essential or do they hinder the economy excessively? Regulations are essential/regulations excessively hinder the economy/Refused",
  "In your opinion, should schools teach Intelligent Design alongside Evolution, or should they only teach Evolution? Teach Evolution only/Teach both Evolution and Intelligent Design/Refused",
  "How do you perceive the balance of conserving endangered species vs. economic development? Favors conservation of species/Favors economic development/Equal emphasis/Refused",
  "Do you think genetic modification of crops is a threat to human health or a beneficial scientific advancement? Threat to human health/Beneficial scientific advancement/Refused",
  "How do you view the importance of space exploration? It is important/It is a waste of resources/Neutral/Refused",
  "Should the government increase funding for stem cell research or is it against your moral principles? Increase funding/Against moral principles/Neutral/Refused",
  "Do you think that humans are chiefly responsible for climate change, or is it mostly due to natural processes? Humans chiefly responsible/Natural processes mostly responsible/Mixed views/Refused",
  "In your view, should nuclear energy be a significant part of our future energy production, or should we focus solely on renewable energies? Focus on nuclear energy/Focus solely on renewables/Mixed views/Refused",
  "Is it essential to vaccinate all children, or should parents have a choice in the matter? Essential to vaccinate all children/Parents should have a choice/Refused",
  "Do you think research in artificial intelligence will lead to positive outcomes, or is it a threat to humanity? Positive outcomes/Potential threat/Mixed views/Refused",
  "How do you perceive the collection of genetic data by private companies? Beneficial for scientific progress/Invasion of privacy/Mixed views/Refused",
  "What are your views on animal testing for scientific research? Necessary part of research/Should be completely banned/Mixed views/Refused",
  "Should we continue to use fossil fuels, or should we rapidly transition to renewable energy resources? Continue using fossil fuels/Rapid transition to renewables/Refused",
  "Do you believe that scientific research should be funded by the private sector or should government play a significant role? Funded by private sector/Government should play significant role/Both/Refused",
  "How do you perceive fracking? It is a valuable method for energy extraction/It should be banned due to environmental concerns/Refused",
  "What is your outlook towards the use of antibiotics in animal farming? It's beneficial/Its detrimental/Neutral/Refused",
  "Do you support the deployment of GMOs to tackle world hunger, or do you think it harms biodiversity? Support GMOs/Harms biodiversity/Refused",
  "Do you believe Internet access is a fundamental right, or is it a privilege? Fundamental right/Privilege/Refused",
  "In your opinion, how important is it for the government to prioritize funding scientific research? Indispensable/Important but not top priority/Unnecessary waste of funds/Refused",
  "What are your thoughts on the role of scientists in shaping public policy? They play a vital role/They should stick to their laboratories/No strong opinion/Refused.",
  "Considering the government's response to public health crises, how would you rate their application of scientific data? Highly effective/Effective but could be improved/Poor/Refused.",
  "Should scientists be allowed to use animals for their research? Often necessary for scientific progress/Cruel and inhumane/Indifferent/Refused.",
  "How frequently should the government consult with scientists when developing laws? Always/Sometimes/Rarely/Never/Refused.",
  "In the case of climate change, what are your thoughts on government intervention? Necessary and urgent/Important but not urgent/Unnecessary intervention/Refused.",
  "Do you believe contemporary science education in schools is sufficient? Definitely satisfactory/Could be improved/ Definitely unsatisfactory/Refused.",
  "How do you regard the government's allocation of funds toward space exploration? Money well spent/Waste of resources/Neutral/Refused.",
  "How important is it for the government to ensure all citizens have access to vaccines? Essential/Important but not top priority/Not very important/Refused.",
  "What are your thoughts on the influence of the pharmaceutical industry on lawmakers? Beneficial/Detrimental/ Neutral/Refused.",
  "How crucial is scientific literacy among lawmakers in making the right decisions? Extremely crucial/Crucial but not determinant/Not very crucial/Refused.",
  "How do you perceive the government's role in regulating pollution from industries? Essential/ Too controlling/No strong opinion/Refused.",
  "Should scientists have a say in the implementation of genetically modified crops? Absolutely/Sometimes/Never/Refused.",
  "What is your perspective on state control of water resources? Fully supportive/Limited support/Opposed/Refused.",
  "What is your stance on the government's role in combating antibiotic resistance? Vital role/Limited role/No role at all/Refused.",
  "How do you view the government's promotion of clean technologies? Necessary waste of funds/Important but not top priority/Indispensable/Refused.",
  "What is your opinion on the role of science in setting emission standards? Paramount/Important but not vital/Minimal/Refused.",
  "What are your thoughts on the government's use of scientific data in regulation of harmful substances? Utterly satisfactory/ Could be improved/ Totally unsatisfactory/Refused.",
  "How critical is it for the government to regulate the use of pesticides based on scientific research? Extremely critical/Critical but not dominant/Not very critical/Refused.",
  "From your perspective, has modern medicine improved the overall quality of life? Definitely has improved/Definitely has not improved/Cannot say/Refused",
  "In your opinion, do climate change policies adequately represent scientific findings? Adequately represent/Do not adequately represent/Refused",
  "Do you believe scientific research in the field of genetics should be regulated by government bodies? Yes, should be regulated/No, should not be regulated/Refused",
  "Do you think there is a significant gender bias in the field of science and technology? Yes, there is significant bias/No, there is no significant bias/Refused",
  "What are your thoughts on the ethical implications of using artificial intelligence in everyday life? Completely ethical/Somewhat ethical/Unethical/Refused",
  "Does the general public have a comprehensive understanding of scientific facts, in your opinion? Have comprehensive understanding/Do not have comprehensive understanding/Refused",
  "Do you consider genetic modification of crops as a solution for world hunger? Yes, it is a solution/No, it is not a solution/Refused",
  "Is the funding for scientific research adequate, from your perspective? Adequate/Inadequate/Refused",
  "Should there be stricter regulations on pharmaceutical companies research practices? Yes, stricter regulations needed/No, current regulations are enough/Refused",
  "What is your take on the role of science in influencing public policy decisions? Significant role/Insignificant role/Refused",
  "Do you think the consequences of ignoring climate change science are catastrophic? Catastrophic/Not catastrophic/Cannot determine/Refused",
  "What are your thoughts on the impact of immunization on public health? Extremely beneficial/Not beneficial/It has negative impacts/Refused",
  "Do you believe the education system provides adequate focus on scientific literacy? Yes, adequate focus/No, not enough focus/Refused",
  "Should controversial topics like stem cell research be open for public discourse? Yes, open for public discourse/No, should not be open for public discourse/Refused",
  "How do you view nuclear energy in light of the renewable energy movement? Favorably/Unfavorably/Neutral/Refused",
  "Can science and religion coexist harmoniously in society, in your opinion? Yes, can coexist/No, cannot coexist/Refused",
  "In terms of environmental impact, how do you rate the plastic industry? Highly detrimental/Somewhat detrimental/Not detrimental at all/Refused",
  "Whats your view on global cooperation in scientific research? Highly essential/Not necessary/Depends on the situation/Refused",
  "What is your position on granting intellectual property rights for scientific advancements? Should be granted/Should not be granted/Refused",
  "Do you think advancements in technology and artificial intelligence will lead to job losses? Will lead to job losses/Will not lead to job losses/Cannot determine/Refused",
  "How would you describe your view on climate change? Do you see it as a pressing global issue, a minor concern or do you deny its existence?",
  "Do you believe that enough is being done by world governments to combat climate change? Yes/No/Uncertain",
  "Scientific research has shown links between human activities and global warming, do you agree or disagree with this statement?",
  "Is it right to say that renewable energy resources are the key to combating climate change? Yes/No/ Maybe",
  "Do you believe that human genetic modification should be permitted for the purpose of eradicating diseases or improving certain genetic traits? Yes/No/ Uncertain",
  "How would you assess the current focus given to STEM subjects in schools? Is the priority too high, too low or just right?",
  "Is it fair to argue that space exploration is a luxury and countries should instead focus their resources on Earthly problems? Yes/No/ Maybe",
  "In your opinion, should the government fund scientific research even if it has no immediate practical application? Yes/No/ Maybe",
  "What is your stance on evolution theory? Do you strongly support it, somewhat support it, somewhat oppose it, or strongly oppose it?",
  "Do you consider nuclear power as a sustainable alternative to fossil fuels? Yes/No/Uncertain",
  "In your perspective, is artificial intelligence a threat or a boon to society?",
  "How do you feel about genetically modified food? Is it safe or unsafe to consume?",
  "Do you think that creationism should be taught in science classes? Yes/No/Uncertain",
  "What are your thoughts on animal testing for scientific research? Is it justifiable or unjustifiable?",
  "Do you believe that vaccinations should be mandatory for all children, unless there are medical reasons not to? Yes/No/Uncertain",
  "Would you support the idea of colonizing Mars as a backup for Earth? Yes/No/ Maybe",
  "Is it true to say that every citizen has a responsibility to understand basic scientific facts? Yes/No/ Uncertain",
  "Do you support the scientific consensus that human activity is the primary driver for climate change? Yes/No/Uncertain",
  "Should public policy decisions be influenced by scientific findings even if they go against conventional beliefs? Yes/No/Uncertain",
  "Do you consider it important to include more diverse perspectives and backgrounds in scientific research? Yes/No/Uncertain",
  "Regarding climate change, do you think it's a very serious problem, a somewhat serious problem, not too serious, or not a problem at all? Very serious/Somewhat serious/Not too serious/Not a problem at all/Refused",
  "In your opinion, should more government funding go into renewable energy research? Yes/No/Unsure/Refused",
  "Can GMOs play a significant role in combating hunger and malnutrition? Yes/No/Don't know much about GMOs/Refused",
  "Do you believe that humans have contribution towards causing the current trend of global warming? Yes/No/Unsure/Refused",
  "How do you feel about the use of nuclear power to generate electricity? Mostly Positive/Mostly Negative/Neither Positive nor Negative/Don't know enough about it/Refused",
  "Do you think research and development of AI should be regulated by government? Yes/No/Neutral/Don't know enough about it/Refused",
  "How much confidence do you have in the scientific community to make ethical decisions regarding gene editing tools such as CRISPR? A great deal/A fair amount/Not much/None at all/Refused",
  "Should people have access to their own genetic information and the right to modify it (e.g., using CRISPR)? Yes/No/Unsure/Refused",
  "Do you believe that scientific decisions should be mostly made by scientists or elected officials? Scientists/Elected officials/Both should have equal influence/Don't know/Refused",
  "Would you support a policy that requires childhood vaccination for diseases like measles, mumps, and rubella? Yes/No/Unsure/Refused",
  "What is your view regarding the influence of big corporations on science? Mostly positive/Mostly negative/Neither positive nor negative/Refused",
  "Do you support the idea that humans should colonize other planets? Strongly support/Support/Neutral/Oppose/Strongly oppose/Refused",
  "In the field of medical research, do you consider animal testing to be necessary or unnecessary? Necessary/Unnecessary/It depends/Don't know enough about it/Refused",
  "In your perspective, do social media platforms have a responsibility to prevent spread of fake science news? Yes/No/Maybe/Refused",
  "Would you favor or oppose genetically modifying babies to reduce their risk of serious diseases? Favor/Oppose/Unsure/I need to learn more about this/Refused",
  "Do you think government funding for STEM education is adequate? Yes/No/Unsure/Refused",
  "Should the international community collaborate or compete in scientific and technological advancements? Collaborate/Compete/Both/None/Refused",
  "Do you trust the government's handling of scientific data and information? Yes/No/Sometimes/I don't know enough about this/Refused",
  "Considering the current state of renewable energy technologies, how viable do you think they are as alternatives to fossil fuels? Very viable/Somewhat viable/Not very viable/Not viable at all/Refused",
  "What is your opinion on the role of nuclear energy in the future energy mix? Should it be largely enhanced/Kept the same/Largely reduced/Completely removed/Refused",
  "How generalizable have findings of psychological research been so far? Very generalizable/Somewhat generalizable/Not often generalizable/Never generalizable/Refused",
  "Do you think the vaccination of children against common illnesses should be mandatory? Always/Sometimes/Rarely/Never/Refused",
  "How do you evaluate the role of big corporations in scientific research? Very positive/Neutral/Negative/Very negative/Refused",
  "How much faith do you place in science to solve major global problems? Complete trust/A lot of trust/Little trust/No trust/Refused",
  "What is your stance on genetically modified crops? They should be promoted/They should be used with caution/They should rarely be used/They should never be used/Refused",
  "When thinking about animal testing in scientific research, how acceptable do you find it? Always acceptable/Sometimes acceptable/Rarely acceptable/Never acceptable/Refused",
  "How much influence do you believe politics should have in scientific research? A lot/Somewhat/Little/None/Refused",
  "Do you believe most climate scientists agree that climate change is largely due to human activity? Agree/Somewhat agree/Disagree/Strongly disagree/Refused",
  "What is your opinion about teaching of intelligent design in science classrooms? Should be required/Should be optional/Should only teach evolution/Shouldn't be taught at all/Refused",
  "How effective has the World Health Organization been in handling global health crises? Very effective/Somewhat effective/Not very effective/Not at all effective/Refused",
  "How often are scientific studies manipulated to fit political agendas? Always/Often/Sometimes/Rarely/Never/Refused",
  "How do you rate the level of government funding for scientific research? Too much/Just about right/Too little/Not sure/Refused",
  "Do you think space exploration should be prioritised over pressing issues on Earth? Always/Sometimes/Rarely/Never/Refused",
  "How much do you believe that current environmental regulations hinder economic development? Always/Often/Sometimes/Rarely/Never/Refused",
  "Are scientists too quick to change their theories when new evidence is presented? Always/Often/Sometimes/Rarely/Never/Refused",
  "How do you value the impact of social sciences on understanding societal issues? Incredibly valuable/Somewhat valuable/Not so valuable/Not valuable/Refused",
  "Where do you stand on the psychological concept of 'implicit bias'? It's a real issue/It's somewhat overstated/It's entirely overstated/It doesn't exist/Refused",
  "Do you support the use of artificial intelligence in decision-making processes? Always supportive/Somewhat supportive/Seldom supportive/Never supportive/Refused",
  "Delve into the complexities of climate change. From your perspective, would you consider it to be More urgent than commonly portrayed/As urgent as commonly portrayed/Less urgent than commonly portrayed/Refused",
  "Provide a brief commentary on the role of government regulation in scientific research. Do you perceive it as Essential to maintain ethical standards/Inhibiting innovation/Both essential and inhibiting/Necessary evil/Refused",
  "Compose a concise viewpoint on the societal acceptance of gene editing technology in humans. Would you designate this practice as A positive progression of science/A potentially dangerous interference with nature/A cautiously optimistic approach/Refused",
  "Reflect on the impact of industrial corporations on scientific studies, particularly regarding environmental impacts. Would you say they are Generally supportive of research/Making efforts but could do more/Often obstructive to scientific research/Refused",
  "Debate the dilemma of nuclear power as a solution to global warming. From your standpoint, nuclear power is the Best option to reduce carbon emissions/Potentially dangerous and not worth the risk/A suitable option but needs more research/Refused",
  "Engage in the debate over privatizing space exploration versus maintaining it as a public enterprise. Would you lean towards Prefer privatization/Support public sector control/Believe a mix is optimal/Refused",
  "Comment upon the application of artificial intelligence in law enforcement. Do you see this as An advancement towards unbiased policing/A threat to individual privacy/I am undecided/Refused",
  "Analyze the introduction of genetically modified crops and their effects on the agriculture industry. Is this considered A significant stride towards efficiency/Potentially harmful for natural biodiversity/Favorable but needs more controls/Refused",
  "Examine the impact of pharmaceutical patents on global health. Would you interpret this as A necessary mechanism for innovation/An obstacle to affordable healthcare/An issue with pros and cons/Refused",
  "Contemplate the trend of 'Big Data' in shaping scientific research. Would you acknowledge this as A boon to scientific advancement/A potential risk for personal data security/A balanced mix of pros and cons/Refused",
  "Portray your stance on the matter of internet service providers deciding the speed of content delivery. Does this strike you as A standard business practice/A potential risk to net neutrality/Requires further investigation/Refused",
  "Anticipate the future impact of machine learning on the job market. Would you predict this as Potentially causing mass unemployment/Making way for better job opportunities/A blend of both/Refused",
  "Consider the expansion of renewable energy, in comparison to traditional sources. Does this represent to you Progressive betterment of society/An unnecessary expense/Both beneficial but needs balancing/Refused",
  "Address the use of robotics in healthcare, particularly in surgeries. Do you interpret this as A step towards efficient medicine/Possible risk of removing the human touch/A promising advancement needing safeguards/Refused",
  "Review the growth of electric cars and the implications on the oil industry. From your point of view, is this A challenge that spurs innovation/A threat to energy stability/An ecological necessity but with consequences/Refused",
  "Focus on the trend towards 'Smart Cities'. In light of your understanding, does this feel like A positive step towards sustainability/A potential invasion of privacy/A complex issue with balances to strike/Refused",
  "Ponder over the need for internet censorship to tackle cyber threats. Would you say this is Necessary for national security/A threat to individual freedom/A difficult dilemma to resolve/Refused",
  "Evaluate the prospect of colonizing other planets in light of possible Earth degradation. Would you argue it as An essential plan B/Unnecessary and too speculative/An intriguing yet challenging objective/Refused",
  "Consider the implications of artificial intelligence enhancing military technology. Would you deem this as A necessary evil in defensive strategies/An escalation of potential conflict/An issue requiring careful deliberation/Refused",
  "Reflect on the intersection of scientific evidence and policy-making. Do you find science to be Generally given due weightage/Slightly undermined in favor of politics/Often overridden by political considerations/Refused",
  "How do you perceive the role of governmental organizations in promoting and funding scientific research? Crucial/Important/Not necessary/Don't know",
  "What's your take on genetically modified organisms (GMOs) in our food supply? Support/Oppose/Unsure",
  "What is your belief pertaining to climate change and its effect on global warming? A significant concern/A moderate concern/Not a concern",
  "Tell me your opinion about the role of vaccines in public health. Extremely important/Important/Not necessarily important",
  "What are your thoughts on the use of nuclear energy as a solution to our energy needs? Support/Oppose/Unsure",
  "Share your views on the implementation of artificial intelligence in daily life. Support/Oppose/Unsure",
  "Do you think the exploration of outer space is essential? Essential/Not essential/Unsure",
  "Where do you stand on investing in renewable energy resources as an alternative to fossil fuels? Support/Oppose/Unsure",
  "In your perception, are internet access and digital literacy fundamental rights in our modern society? Fundamental rights/Privileges/Unsure",
  "How do you feel about government regulations on scientific experiments and research? Necessary/Unnecessary/Don't know",
  "Share your stand on stem cell research? Support/Oppose/Unsure",
  "What's your perspective on the control and enforcement of genetically edited embryos? Support/Oppose/Unsure",
  "Express your viewpoints on integrating technology and artificial intelligence in education. Support/Oppose/Unsure",
  "Do you think the research and development of autonomous vehicles is important for the future? Important/Not important/Unsure",
  "Convey your thoughts about the societal impact of biotechnology. Positive/Negative/Mixed feelings",
  "What is your opinion on extensive reliance on technology in everyday life? Positive/Negative/Mixed feelings",
  "Express your views on designer babies  babies genetically engineered in vitro for specially selected traits. Support/Oppose/Unsure",
  "How do you view the issue of digital privacy in our increasingly connected world? Major concern/Minor concern/Not a concern",
  "What's your perspective about the use of drones for commercial purposes? Support/Oppose/Unsure",
  "Share your stand on the widespread use of robotics in the medical field. Support/Oppose/Unsure",
  "Reflecting about clean energy technologies, how contentious do you find this topic to be across various political spectrums? Highly contentious/Moderately contentious/Slightly contentious/Not contentious at all/Refused",
  "Research generally shows higher average global temperatures are leading to more extreme weather. Do you agree or disagree with this, based on your understanding and other pieces of evidence? Strongly agree/Moderately agree/Slightly agree/Neither agree nor disagree/Slightly disagree/Moderately disagree/Strongly disagree/Refused",
  "Considering the role of genetically modified organisms (GMOs) in agriculture, how would you rate their importance? Extremely important/Very important/Moderately important/Slightly important/Not at all important/Refused",
  "In terms of funding for space exploration, how much do you think government should commit resources to this sector? A Lot/A Moderate Amount/A Little/None at all/Refused",
  "How much, based on your knowledge, should nuclear energy be a part of our energy policy? A lot/A moderate amount/A little/None at all/Refused",
  "In your opinion, how critical is the need for stronger regulations on the biotechnology industry? Extremely critical/Very critical/Moderately critical/Slightly critical/Not critical at all/Refused",
  "Given the importance of biodiversity, how significant do you consider the role of environmental regulations in its conservation? Extremely significant/Very significant/Moderately significant/Slightly significant/Not significant at all/Refused",
  "How crucial is it for governments to invest more money in research and development for renewable energy? Highly crucial/Moderately crucial/Slightly crucial/Not crucial at all/Refused",
  "Based on your understanding, how important is it to regulate carbon emissions to combat climate change? Extremely important/Very important/Moderately Important/Slightly Important/Not Important at all/Refused",
  "From your perspective, how far should political platforms involve science when crafting their policies? Extremely far/Very far/Moderately far/Slightly far/Not far at all/Refused",
  "How much, if at all, should governments prioritize funding for stem cell research? A lot/A moderate amount/A little/None at all/Refused",
  "Reflecting on the state of scientific literacy in the general population, how problematic do you think it is? Extremely problematic/Very problematic/Moderately problematic/Slightly problematic/Not problematic at all/Refused",
  "In terms of AI and automation, how vital do you think it is for governments to regulate these technologies? Extremely vital/Very vital/Moderately vital/Slightly vital/Not vital at all/Refused",
  "When thinking about vaccine development, how crucial do you think is the role of government funding? Extremely crucial/Very crucial/Moderately crucial/Slightly crucial/Not crucial at all/Refused",
  "Considering the realm of quantum computing, how relevant do you think it is to the future of national security? Extremely relevant/Very relevant/Moderately relevant/Slightly relevant/Not relevant at all/Refused",
  "Regarding the protection of endangered species, how important is the implementation of stronger wildlife conservation policies? Extremely important/Very important/Moderately important/Slightly important/Not at all important/Refused",
  "Reflecting on the threat of antibiotic resistance, how imperative is it for governments to fund research into new antibiotics and treatments? Extremely imperative/Very imperative/Moderately imperative/Slightly imperative/Not imperative at all/Refused",
  "From a scientific perspective, how beneficial or harmful is the practice of fracking for the environment? Very beneficial/Beneficial/Neither beneficial nor harmful/Harmful/Very harmful",
  "Assess the effectiveness of renewable energy sources like solar, wind and hydroelectric power in tackling global warming. Incredibly effective/Quite effective/Neutral/Not so effective/Not effective at all",
  "What is your view related to the concept of human evolution? Fully accept/Mostly accept/Neither accept nor refuse/Mostly refuse/Fully refuse",
  "Do you think increased technology has a positive or negative effect on interpersonal communication? Very positive/Positive/Neutral/Negative/Very negative",
  "Evaluate the impact of science and technology on job opportunities. Very positive/Positive/Neither positive nor negative/Negative/Very negative",
  "Do you believe in the consequences of climate change? Fully believe/Mostly believe/Neither believe nor disbelieve/Mostly disbelieve/Fully disbelieve",
  "How effective do you find vaccines to be in preventing diseases? Extremely effective/Quite effective/Neither effective nor ineffective/Not very effective/Not at all effective",
  "Do you think space exploration should be a priority for our resources and funding? A top priority/A high priority/A moderate priority/A low priority/Should not be a priority at all",
  "Judge the impact of genetic modification in agriculture. Extremely beneficial/Moderately beneficial/Neutral/Moderately harmful/Extremely harmful",
  "What are your views on the ethical implications of genetic engineering? Strongly ethical/Moderately ethical/Neither ethical nor unethical/Moderately unethical/Strongly unethical",
  "Do you consider animal testing for scientific research to be justifiable? Fully justifiable/Mostly justifiable/Neither justifiable nor unjustifiable/Mostly unjustifiable/Fully unjustifiable",
  "How important do you think it is to integrate artificial intelligence in daily life? Extremely important/Quite important/Neither important nor unimportant/Not so important/Not at all important",
  "What is your stance on nuclear energy as a solution to global warming? Fully support/Mostly support/Neither support nor oppose/Mostly oppose/Fully oppose",
  "Do you believe science education should be compulsory in schools? Absolutely/Mostly/Neither agree nor disagree/Mostly disagree/Absolutely disagree",
  "Assess the necessity of stem cell research in medical science. Extremely necessary/Quite necessary/Neither necessary nor unnecessary/Not so necessary/Not at all necessary",
  "Do you think the use of pesticides and chemical fertilizers in agriculture is more helpful or detrimental? Very helpful/Somewhat helpful/Neither helpful nor detrimental/Somewhat detrimental/Very detrimental",
  "Do you believe there is a link between human activity and global warming? Full belief/Partial belief/Neutral/Partial disbelief/Full disbelief",
  "What's your evaluation of the effectiveness of science in explaining the mysteries of the universe? Extremely effective/Quite effective/Neither effective nor ineffective/Not quite effective/Not at all effective",
  "Do you think scientific advancements are beneficial for mental health treatment? Extremely beneficial/Quite beneficial/Neither beneficial nor detrimental/Not quite beneficial/Not at all beneficial",
  "How do you envisage the impact of deforestation on climate change? Elaborate on the contribution of excessive logging towards global warming.",
  "Express your thoughts on the intersection between scientific research and political priorities, specifically relating to climate change.",
  "What's your assessment of the role of private companies in space exploration? Discuss the potential benefits and risks of privatizing space travel.",
  "Share your views on nuclear energy as a potential solution to the worlds increasing energy demands. Do you consider it to be a viable and safe alternative?",
  "As you think about advances in genetic engineering, what is your opinion on the ethical implications of modifying human DNA?",
  "How do you position yourself on the use of animal testing in scientific research? Express your insights on the moral considerations and scientific merits of such practices.",
  "Voice your perspective on funding for stem cell research. Would you endorse governmental support for this branch of study, particularly when considering potential breakthroughs in medical treatment?",
  "What are your beliefs concerning climate change skepticism that comes up in political discourse? Please explain why such skepticism might be harmful to population and planet.",
  "What are your thoughts on regulatory bodies that supervise scientific experiments? Should they have full autonomy, or should public opinion factor into scientific regulations?",
  "Please talk about the notion of science being independent from political influences. How can the politicization of science, particularly in the domain of climate change, affect its impact and credibility?",
  "From what you understand about global warming, would you say it's a genuine threat that we need to address urgently, or it's a hoax created for political gain? Genuine Threat/Hoax/Not sure/Refused",
  "When considering governmental policies for clean energy, do you think they are doing Enough/Not enough/Too much/Refused in terms of promoting and implementing these sources?",
  "What are your thoughts about the Paris agreement? Is it an Effective/Ineffective/Neutral tool for combating climate change?",
  "With regards to decisions about vaccinations, should they remain a matter of Personal choice/Government directive/Not sure/Refused?",
  "In your opinion, are genetically modified foods Safe/Unsafe/Neutral for human consumption or do you Refuse to answer?",
  "When it comes to funding for scientific research, do you think our government is providing Sufficient funding/Insufficient funding/About right/Refused?",
  "Do you think that human activity is the major contributor to climate change, or is it due to natural patterns? Human activity/Natural patterns/Unsure/Refused.",
  "Are you of the opinion that we need to invest more in nuclear energy as a solution to our energy needs or do you have Concerns/No Concerns/Neutral position?",
  "Upon hearing about stem cell research, would you say it's Ethical/Unethical/Unsure or are you Refused to comment?",
  "Given the topic of space exploration, do you think it's a worthwhile investment that could bring significant gains or a Waste of resources/Good use of resources/Unsure/Refused?",
  "If you were to discuss the future of artificial intelligence (AI), would you say it's going to be Beneficial/Detrimental/Neither/Refused?",
  "Do you agree or disagree with the idea that vaccination against preventable diseases should be made compulsory? Agree/Disagree/Neutral/Refused",
  "In the context of environmental conservation, do you believe stringent legal penalties should be imposed to curb poaching and illegal wildlife trading? Support/Oppose/Neutral/Refused",
  "Would you consider fossil fuel industries Should continue/Should be phased out/Neutral in favour of renewable energy sources?",
  "Do you support or oppose the extensive use of pesticides in agriculture? Support/Oppose/Neutral/Refused",
  "Do you believe the focus on Mars colonization is a Feasible/Unfeasible/Not sure objective?",
  "Regarding the regulation of greenhouse gas emissions, is the government acting Proactively/Reactively/Neither/Refused?",
  "Do you believe in the potential of science and technology in solving our environmental problems, or do you think they are part of the problem? Solve/Aggravate/Neither/Refused",
  "Do you believe the advancement of science and technology will contribute positively or negatively to job opportunities in the future? Positive/Negative/Neutral/Refused",
  "Do you see genetically modified organisms (GMOs) as a Solution/Problem/Neutral in tackling food insecurity?",
  "How strongly do you agree or disagree with the statement, \"Alternative energy resources should be pursued more aggressively?\" Strongly agree/Agree/Neither agree nor disagree/Disagree/Strongly disagree",
  "Is your understanding of climate change influenced by the reports presented by environmental researchers? Yes, greatly influenced/Yes, somewhat influenced/No, not influenced/Refused",
  "Based on your knowledge, do you believe genetically modified foods offer a viable solution to global food shortage? Yes, significant solution/Yes, partial solution/No, not a solution at all/Refused",
  "Is it fair to say your understanding of space exploration is persuaded by information given by space agencies? Yes, largely persuaded/Yes, somewhat persuaded/No, not at all persuaded/Refused",
  "Would you agree the following word describes most scientists working in nuclear research? Ethical Agrees strongly/Agrees/Neither agree nor disagree/Disagree/Strongly disagree",
  "Do you think funding for scientific research is adequately provided by the government? Yes, adequately provided/Yes, somewhat adequately provided/No, inadequately provided/Refused",
  "How well does the term 'Innovative' describe scientists working on artificial intelligence? Describes very well/Describes well/Neither describes nor not/Does not describe well/Does not describe at all",
  "Do you believe scientific evidence supports the belief in human-induced climate change? Yes, completely supports/Yes, partially supports/No, does not support at all/Refused",
  "Based on your knowledge, do you see synthetic biology as a promising field for the future? Yes, extremely promising/Yes, somewhat promising/No, not at all promising/Refused",
  "Is what you know about the Big Bang Theory because you learned about this in school Yes, learned about this in school/No, did not learn about this in school/Refused",
  "Would you say investments in medical research guarantee advancements in healthcare? Yes, definitely guarantee/Yes, likely to guarantee/No, do not guarantee at all/Refused",
  "Do you believe policies related to scientific research get enough attention in political debates? Yes, they get enough attention/No, they don't get enough attention/Refused",
  "Considering the field of genetically modified organisms (GMOs), do you believe they present more benefits than drawbacks? Benefit more than harm/Harm more than benefit/Roughly equal/Not sure/Refused",
  "Proponents argue that nuclear power is a clean and efficient energy source, while critics point out potential disasters and dangers of radioactive waste. Do you think we should invest more in nuclear power? Definitely should/Perhaps we should/Perhaps we should not/Definitely should not/Refused",
  "When considering policies related to vaccination, should the government prioritize individual freedom or public health? Prioritize individual freedom/Prioritize public health/Both should be equal/Not sure/Refused",
  "Given the rapid advancement in technology, should there be stricter regulations on AI development and its applications? Definitely should be stricter/Perhaps should be stricter/Perhaps should not be stricter/Definitely should not be stricter/Refused",
  "What is the level of importance you place on investing in space exploration? Very important/Somewhat important/Not that important/Not important at all/Refused",
  "What is your standpoint on the use of animal models in scientific research? Strongly support/Support/Oppose/Strongly oppose/Refused",
  "Should national parks and other protected lands be open for natural resource extraction activities like mining and drilling? Definitely should/Perhaps should/Perhaps should not/Definitely should not/Refused",
  "How would you describe your stance on climate change and the urgency needed to address it? Highly urgent/Somewhat urgent/Not very urgent/Not urgent at all/Refused",
  "Based on your understanding of stem cell research, do you believe we should invest more, the same, or less into it? More/The same/Less/Not sure/Refused",
  "On the topic of ocean pollution and single-use plastics, should laws banning these materials be implemented and enforced more strictly? Definitely should/Probably should/Probably should not/Definitely should not/Refused",
  "In addressing carbon emissions, do you favor government interventions or market-driven solutions? Favor government interventions/Favor market-driven solutions/Favor a mix of both/Not sure/Refused",
  "When discussing education, how critical do you think science literacy is for the general public? Extremely critical/Very critical/Somewhat critical/Not critical/Refused",
  "In your view, should legislation be passed to mandate replacing fossil fuels with renewable energy sources? Definitely should/Probably should/Probably should not/Definitely should not/Refused",
  "Should bioengineering research, such as gene-editing technologies, have stricter government oversight and regulation? Strongly Agree/Agree/Disagree/Strongly Disagree/Refused",
  "Do you think the government has responsibility to protect endangered species and their habitats? A great deal of responsibility/A quite lot of responsibility/Some responsibility/No responsibility/Refused",
  "In the realm of food safety, do you trust genetically modified foods? Trust completely/Trust somewhat/Distrust somewhat/Distrust completely/Refused",
  "Should scientific findings and evidence be the main consideration for policy making related to environment? Definitely should/Probably should/Probably should not/Definitely should not/Refused",
  "Are you in favor of more government spending on research and development to combat climate change? Strongly in favor/In favor/Against/Strongly against/Refused",
  "How much of a priority should the reduction of plastic waste be for the government? Very high priority/High priority/Low priority/Very low priority/Refused",
  "From your perspective, do you believe that nuclear energy solution contribute more benefits or concerns? Nuclear energy produces more benefits/Nuclear energy raises more concerns/Neither or Ballet/Refused",
  "How likely is it that in the next three decades, scientists will make significant strides in addressing climate change? Certain to happen/Veritably probable/Insignificant probability/Will categorically not happen/Refused",
  "Global Warming - a natural Earth-cycle or significantly influenced by human activities? Primarily a natural cycle of the Earth/Significantly influenced by human activities/Neither or Other/Refused",
  "Regarding the usage of genetically modified organisms (GMOs) in food production, do you see them as beneficial or harmful? GMOs are beneficial/GMOs are harmful/Neither or Both/Refused",
  "Do you foresee artificial intelligence posing a significant threat or benefit to humanity in the coming years? AI will pose a substantial threat/AI will confer considerable benefit/Neither or Both/Refused",
  "On the question of water fluoridation as a public health measure, do you see it more as a beneficial step or an infringement on individual rights? More beneficial for public health/More an infringement on individual rights/Neither or Both/Refused",
  "Do you view consumption of organic food over conventional food as a healthier option or a misleading concept? Organic food is unquestionably healthier/Consuming organic food is more of a misleading concept/Neither or Both/Refused",
  "Do you believe that man-made structures have a significant contribution to global dust pollution: Agree/Disagree/Neither or both/Refused",
  "Do you think advances in neuronal control of robotic limbs present more promise or peril? Definitely present more promise/Possibly present more peril/Neither or both/Refused",
  "How would you approach the issue of antibiotic resistance? Is it a problem caused by overuse of antibiotics by doctors or by patients not completing their prescriptions? Overuse by doctors/Patients not completing their prescriptions/Both equally to blame/None of the above/Refused",
  "Do you think the explosion of personal DNA tests has been largely advantageous or disadvantageous for society? Mostly advantageous/Mostly disadvantageous/Both equally/None of the above/Refused",
  "In terms of the accelerated melting of polar ice caps, do you see this phenomenon as a serious concern or an overblown issue? Serious concern/Overblown issue/Both to some degree/None of the above/Refused",
  "Talking about human extinction, do you believe a more significant threat is posed by nuclear warfare or an asteroid impact? Nuclear warfare poses the most significant threat/Asteroid impact poses the most significant threat/Both are similarly significant threats/None of the above pose a significant threat/Refused",
  "Do you think the move toward natural cleaning products more of a marketing strategy or an actual benefit to health and the environment? More of a marketing strategy/An actual benefit to health and the environment/Both marketing and benefits/None of the above/Refused",
  "Do you think the advent of electric vehicles will have a more positive impact on the environment than public transportation improvements? Electric vehicles will have greater impact/Improvements in public transportation will have greater impact/Both will have approximately equal impact/None will have much impact/Refused",
  "In light of increasing space exploration, do you think international treaties should govern the use of outer space resources or individual countries should decide their usage? International treaties should be in place/Individual countries should decide/Both strategies should be utilized/None of the approaches should be taken/Refused",
  "Do you think humans will find solid evidence of life beyond Earth within the next 50 years? Will definitely happen/Probably will happen/Will definitely not happen/Probably will not happen/Refused",
  "Regarding the controversial topic of cloning, do you find it more threatening or promising for the progress of science? More threatening/More promising/Both in equal measure/Neither of the two/Refused",
  "Do you think vaccination should be mandatory for all without any exemptions or should there be room for personal choice? Vaccinations should be mandatory/There should be personal choice/There should be a balanced approach/None of the above/Refused",
  "In your opinion, do diet supplements provide more health benefits or more health risks? Diet supplements provide more benefits/Diet supplements present more risks/Neither or both/Refused",
  "Where would you place the importance of finding a solution to plastic pollution? A top priority/A considerable issue/Not a major concern/Not a concern at all/Refused",
  "How inclined would you be to trust a scientist's opinion more if they specializes in a scientific field related to the topic they're speaking on / it doesn't have a significant impact / you're indifferent about it / Refused",
  "Considering climate change, should politicians carry more weight in defining environmental policies or scientific experts should have the most influence / both should have equal say/ Refused",
  "Do you believe in actively working towards executing scientific recommendations for a sustainable environment or Do you believe we should continue as is and allow natural events to take its course / Refused",
  "Does the prospect of genetically modifying crops to enhance yield and resist diseases appeal to you or hinder your trust in the industry / you have a neutral position / Refused",
  "Express your trust in vaccines. Are they mostly beneficial, can cause potential harm or have a neutral effect / you don't have a preference / Refused",
  "In terms of space exploration, should funding be directed more towards resolving earths issues first or equal importance should be given to both earth and space / Refused",
  "When advancements are made in nanotechnology, are your thoughts inclined towards excitement for future possibilities or concern about potential misuse / you have neutral position / Refused",
  "For AI and automation, are you supportive of such technical advancements or concerned about job displacement / the both are equally significant / Refused",
  "The use of animals in research for scientific advance is a debatable topic. Do you find it ethical and necessary, unethical but necessary, or completely unethical / Refused",
  "Stem cell research holds promise for treating numerous diseases. How would you react to this  positive anticipation or moral concern / both are significant / Refused",
  "Do you believe that investment in renewable energy technology solutions should prevail over fossil fuels, should be the same or should invest more in traditional energy resources? / Refused",
  "What is your view on the use of drones for commercial and recreational purposes - does it strike you as an exciting technological advance or raises concerns about privacy and safety / you have a neutral position / Refused",
  "Fracking, or hydraulic fracturing, is a controversial method for extracting natural gas. Are you in favor of fracking for economic benefits or opposed because of environmental impacts / you have a neutral point of view / Refused",
  "What's your take on the concept of 'engineering' the climate, as a measure to combat extreme weather conditions  a good idea or inconvenience waiting to happen / you don't entertain such a point / Refused",
  "Do you think artificial creatures with full or partial human-like functions might blur the definition of being human or it's an interesting possibility to explore / you have neutral perspective on this / Refused",
  "Should scientists focus more on research that has immediate, practical benefits or on basic research that advances knowledge even without clear, practical applications / they should focus equally on both / Refused",
  "For controversial topics like evolution, should the education system allow teaching of alternative theories alongside, or not at all / they should provide equal attention to all theories / Refused",
  "Give your opinion on the proposition that scientific principles should override religious beliefs in shaping policies and legislation  agree or disagree / it should be a mix of both / Refused",
  "Is it critical for a socioeconomic system to ensure parity in access to scientific developments for all, or should it be based on financial capabilities or other parameters / should maintain balance between both / Refused",
  "Do you think the disclosure and sharing of all scientific data, which includes negative or null results, should be a mandate for the scientific community or it can lead to information overload and confusion / both views are significant / Refused",
  "Suppose the government wanted to increase funding dramatically for climate change research and mitigation efforts, would this make you more likely to vote for a candidate who supported that policy, less likely, or no difference? More likely/Less likely/No difference/Refused",
  "When you hear about a scientist promoting a plant-based diet to reduce greenhouse gas emissions, do you become more or less likely to trust their other scientific opinions? More likely/Less likely/No difference/Refused",
  "Suppose renewable energy required a significant increase in taxes, would you be in favour of pursuing it aggressively, moderately, or not at all? Aggressively/Moderately/Not at all/Refused",
  "If oil companies offered a large grant to a scientist studying climate change, would that make you trust the scientist's findings more, less, no difference, or refused? More/Less/No difference/Refused",
  "If a candidate proposed to cut funding for space exploration to invest more in social welfare programs, would you be more likely to support, reject, or make no difference in your position about the candidate? More likely to support/More likely to reject/No difference/Refused",
  "What would you say if a scientific discovery significantly promoted capitalism or socialism? Would you celebrate, deny, or remain indifferent to such a discovery? Celebrate/Deny/Remain indifferent/Refused",
  "If aerospace companies proposed to exploit resources from asteroids, would you support, oppose, or remain indifferent? Support/Oppose/Indifferent/Refused",
  "When you hear about research advocating for the benefits of nuclear power as an alternative to fossil fuels, do you feel positive, negative, or neutral feelings? Positive/Negative/Neutral/Refused",
  "If technological advancements in automation led to significant job losses, would you view future scientific developments with hope, fear, indifference, or something else? Hope/Fear/Indifference/Refused",
  "Do you think advancements in artificial intelligence will lead to greater social equality or increase inequality? Greater equality/Increased inequality/Remains the same/Refused",
  "Would cutting funding for climate change research to focus on economic growth make you support or oppose a political candidate proposing this? Support/Oppose/No change/Refused",
  "When tech companies give out large grants to researchers working on privacy technology, does this make you feel optimistic, pessimistic, or indifferent? Optimistic/Pessimistic/Indifferent/Refused",
  "If the costs of genetically modified foods increased due to government regulations, would you support, oppose, or be indifferent to such regulations? Support/Oppose/Indifferent/Refused",
  "Would you feel more, less, or indifferent about a politician who promotes a science-based policy but lacks solid scientific evidence? More positive/Less positive/Indifferent/Refused",
  "Given the advent of robotic automation in various industries, should the government encourage retraining for affected workers or allow market forces to adjust naturally? Encourage retraining/Allow market forces/Refused",
  "Should science-based decisions outweigh cultural, religious, or traditional beliefs when forming public policy? Always/Often/Sometimes/Rarely/Never/Refused",
  "How do you view scientific advancements in the meat industry, such as lab-grown meat, in relation to animal rights? Positive/Negative/Indifferent/Refused",
  "With the advent of CRISPR technology enabling select gender in offspring, do you support or oppose this progress? Support/Oppose/Ambivalent/Refused",
  "If stem cell research could cure chronic diseases but conflicts with certain ethical views, would you still support the research? Support/Oppose/No change/Refused",
  "Do you believe current laws surrounding digital privacy and surveilling technologies protect citizen rights sufficiently, not enough, or too much? Sufficient/Not enough/Too much/Refused",
  "How would you feel about prioritizing research funding towards renewable energy solutions? Positive/Negative/Mixed/Refused",
  "Given the ongoing climate crisis, do you think deforestation is a global issue that requires urgent attention? Yes/No/Maybe/Refused",
  "Do you think the use of fossil fuels should be reduced even if it impacts economies negatively? Yes/No/Maybe/Refused",
  "To what extent do you believe vaccinations should be mandated by the government? Completely/To some extent/Not at all/Refused",
  "How do you feel about the government's involvement in space exploration? Too much/About right/Not enough/Refused",
  "Do you think pursuing artificial intelligence technology could pose potential threats to society? Definitely/Perhaps/Not at all/Refused",
  "What's your stance on the consumption of animal-based products for environmental reasons? Should be reduced/Remain the same/Should be increased/Refused",
  "Do you believe that climate change regulation harms businesses? Yes/No/Sometimes/Refused",
  "How do you feel about nuclear energy as a solution to rising energy demands? Positive/Negative/Mixed/Refused",
  "Do you support the development of autonomous weapons systems in warfare? Waste of resources/Necessary evil/Crucial for progress/Refused",
  "How do you feel about non-animal testing alternatives in research? Supportive/Neutral/Opposed/Refused",
  "Do you think the government should intervene to limit carbon emissions? Yes/No/Depends on the situation/Refused",
  "To what extent do you think stem cell research is ethical? Highly ethical/Slightly ethical/Not ethical at all/Refused",
  "How do you view the potential of genetically engineered crops in mitigating world hunger? Very optimistic/Quite optimistic/Somewhat pessimistic/Very pessimistic/Refused",
  "How much, if at all, do you think we can predict natural disasters using technology? Completely/Partially/Not at all/Refused",
  "Do you support the scientific research conducted using animals? Fully support/Somewhat support/Do not support at all/Refused",
  "Do you believe that emerging genetic technologies, such as CRISPR, should be regulated? Yes/No/Maybe/Refused",
  "Do you think technology has gone too far in allowing parents to select traits for their unborn children? Yes/No/Depends/Refused",
  "According to your particular viewpoint, what would be the consequences if the government fails to invest in stem cell research? Major setback in medical advancement/Minor impact on medical advancement/No impact on medical advancement/Refused",
  "Reflect on the necessity of governments investing in space exploration. Needful and beneficial/Unnecessary and wasteful/Depends on the extent of the investment/Refused",
  "Do you believe that the government should intervene to mitigate the effects of climate change? Definitely necessary/Probably necessary/Probably unnecessary/Definitely unnecessary/Refused",
  "Do you agree with the assertion that nuclear energy should be a more significant part of our country's energy portfolio? Strongly Agree/Somewhat Agree/Somewhat Disagree/Strongly Disagree/Refused",
  "Consider the concept of vaccinations and public health. Are vaccinations critical for public health? Definitely critical/Probably critical/Probably not critical/Definitely not critical/Refused",
  "Form an opinion on whether genetically modified organisms (GMOs) are safe to eat. Completely safe/Mostly safe/Mostly unsafe/Completely unsafe/Refused",
  "How would you describe the urgency of dealing with global warming? Extremely urgent/Very urgent/Moderately urgent/Not at all urgent/Refused",
  "Do you support the implementation of stricter environmental regulations? Strongly support/Somewhat support/Somewhat oppose/Strongly oppose/Refused",
  "Do you believe the government should invest more in renewable energy sources? Definitely should/Probably should/Probably should not/Definitely should not/Refused",
  "Considering the current scientific breakthroughs, should we pursue the creation of artificial intelligence with more fervor? Absolutely pursue/Consider pursuing/Hesitate pursuing/Should not pursue/Refused",
  "Your perspective on the idea that using animals in scientific research is inevitable for advancing human health. Completely inevitable/Mostly inevitable/Not quite inevitable/Not at all inevitable/Refused",
  "How vital is it for nations to cooperate in scientific research? Absolutely Essential/Quite Essential/Minimally Essential/Not at all Essential/Refused",
  "Do you view genetic engineering as a boon or bane to humanity? More of a Boon/Equally a Boon and Bane/More of a Bane/Refused",
  "Consider the role of artificial intelligence in warfare. Should countries increasingly rely on AI for military operations? Definitely should/Probably should/Probably should not/Definitely should not/Refused",
  "Do you believe the exploration of other galaxies should be mankind's next grand scientific endeavor? Definitely should be/Might be worth considering/Should not be a priority/Definitely should not be/Refused",
  "What if all nations agreed to put their nuclear weapons under international control, would you favor or oppose this plan? Strongly Favor/Moderately Favor/Moderately Oppose/Strongly Oppose/Refused",
  "Should the focus predominantly be on the prevention rather than the treatment of diseases? Focus on prevention/Equal focus on both/Focus on treatment/Refused",
  "In a society facing frequent natural disasters, would you promote the need for stronger buildings or a more comprehensive early warning system? Stronger buildings/Equal emphasis on both/Early warning system/Refused",
  "Based on your understanding, what do you perceive to be the impacts of genetically modified organisms (GMOs) on sustainable agriculture? Positive impacts/Negative impacts/Neutral impacts/Unsure",
  "How confident are you that renewable energy technologies will solve our current energy crisis? Highly confident/Moderately confident/Slightly confident/Not confident at all",
  "Based on your perception, what role should artificial intelligence play in job creation and economic growth? Vital role/Supportive role/Limited role/No role/Unsure",
  "Can the exploration of outer space yield significant benefits for solving Earth's current problems? Yes, Significant Benefits/Some Benefits/Little to no Benefits/No Benefits/Unsure",
  "Is your understanding of climate change based on scientific facts or popular opinion? Scientific facts/Popular opinion/Mixed/Unsure",
  "Would you agree that stringent bioethics regulations are needed for genetic research despite potentially slowing scientific progress? Strongly agree/Agree/Disagree/Strongly disagree",
  "Do you believe robotics technology will do more harm than good for the workforce? More harm/More good/Half and half/Unsure",
  "Is what you know about fossil fuel impacts more influenced by science or by politics? Mostly science/Mostly politics/Mixed/Unsure",
  "Do measures for conserving biodiversity align with your political beliefs? Highly aligned/Moderately aligned/Slightly aligned/Not aligned",
  "How would you rate the promise vs. risk ratio for nanotechnology? High promise - low risk/Moderate promise - moderate risk/Low promise - high risk/Unsure",
  "Do you believe that pro-environmental policies align with economic growth? Strong alignment/Moderate alignment/Little alignment/No alignment/Unsure",
  "What effect do you think quantum computing will have on global security? Positive effect/Negative effect/Neutral effect/Unsure",
  "Should scientific research have more federal funding despite the potential for budgetary constraints? More funding/Current funding is satisfactory/Reduce funding",
  "Do you support the use of nuclear energy despite its potential health and environmental risks? Fully support/Partially support/Do not support/Unsure",
  "How much influence should public opinion have on scientific research direction and funding? Significant influence/Some influence/Little influence/No influence/Unsure",
  "What's your outlook on the intersection of science and religion? Can coexist peacefully/In constant conflict/Depends on the context/Unsure",
  "Do you see automation as a threat or an opportunity for job security? Major threat/Minor threat/Opportunity/Unsure",
  "In your opinion, should scientists be held accountable for the societal and ethical implications of their research? Strongly accountable/Partially accountable/Not accountable/Unsure",
  "How influential should a country's scientific advancement be in defining its global standing? Highly influential/Moderately influential/Not influential/Unsure",
  "What are your thoughts on the role of big businesses in influencing scientific research and development? Very influential/Somewhat influential/Little influence/No influence/Unsure",
  "What is your view on climate change? Is it mainly caused by human activity/Mother Nature/Natural and human factors both contribute equally/None of these/Refused",
  "When it comes to energy production, do you lean towards the use of traditional fossil fuels or renewable resources, or is it a balance of both? Pro-fossil fuels/Pro-renewables/Balance of both/None of these/Refused",
  "Should the government fund scientific research on embryonic stem cells, even if it involves the destruction of the embryos? Yes/No/It depends/Refused",
  "How do you feel about the government funding research into artificial intelligence? Strongly support/Moderately support/Neutral/Moderately oppose/Strongly oppose/Refused",
  "Should animals be used for scientific testing if it can lead to medical breakthroughs? Always agree/Often agree/Sometimes agree/Rarely agree/Never agree/Refused",
  "Should genetically modified organisms (GMOs) be used in agriculture to increase crop yield and resilience? Full support/Partial support/Neutral/Partial opposition/Full opposition/Refused",
  "Should NASA invest more funds into the research and development of space tourism? Strongly agree/Agree/Neutral/Disagree/Strongly disagree/Refused",
  "What is your stance on the development of nuclear power as a solution for global energy needs? Strongly support/Moderately support/Neutral/Moderately oppose/Strongly oppose/Refused",
  "Do you believe the concept of evolution should be taught in public schools, irrespective of religious beliefs? Yes/No/It depends/Refused",
  "How do you feel about implementing stricter policies to protect biodiversity and endangered species, even if it comes at the cost of economic growth? Strongly support/Support/Neutral/Oppose/Strongly oppose/Refused",
  "Should governments explore underwater mining, despite potential harm to marine ecosystems, if it can secure mineral resources? Always agree/Often agree/Sometimes agree/Rarely agree/Never agree/Refused",
  "Do you think government should fund research into nuclear fusion as a potential energy source, despite the high costs? Yes/No/It depends/Refused",
  "Do you believe government should invest more on scientific research in universities? Yes, significantly more/Yes, somewhat more/No change needed/No, less investment/Not sure/Refused",
  "How often, if at all, do you think people misinterpret scientific studies due to a lack of understanding? Almost always/Most of the time/Sometimes/Rarely/Almost never/Refused",
  "What's your take on plastics and pollution? Should governments ban single-use plastic to protect wildlife and the environment? Yes/No/Should be more complex policy/Refused",
  "Do you believe climate change education should be mandatory in schools? Strongly agree/Agree/Neutral/Disagree/Strongly disagree/Refused",
  "Can you provide thoughts on the use of genetically modified organisms (GMOs) in agriculture? Do you feel it is beneficial or harmful to humanity? Beneficial/Harmful/Refused",
  "What is your take on the integration of AI into healthcare? Is it a beneficial innovation or a potential risk? Beneficial/Risk/Refused",
  "What is your stance on the exploration of outer space? Do you perceive it as a necessary step for human advancement or a waste of resources? Necessary/Waste/Refused",
  "Are you in favor of modern biotechnologies such as gene editing and CRISPR in humans? Favor/Oppose/Refused",
  "How do you perceive the impact of industrialization on our environment? Positive/Negative/Refused",
  "How do you feel about increasing investment in renewable energy sources at the expense of traditional fossil fuels? Favor/Oppose/Refused",
  "Do you agree with the use of nuclear power as a solution to meet increasing energy needs? Agree/Disagree/Refused",
  "What's your stance on implementing stricter regulations on industries to combat climate change? Favor/Oppose/Refused",
  "Do you see AI taking over human jobs as a problem or an opportunity for newer types of employment? Problem/Opportunity/Refused",
  "What's your view on advancements in robotics? Are they a boon or a threat to human society? Boon/Threat/Refused",
  "How do you feel about government agencies shaping science policy instead of scientists? Favor/Oppose/Refused",
  "Do you think neuroscience should have a say in our legal system in terms of understanding criminal behavior? Yes/No/Refused",
  "Technology has a huge impact on our privacy. Should we accept it as is or should there be more restrictions? Accept/More restrictions/Refused",
  "What is your viewpoint on teaching evolution in schools? Support/Oppose/Refused",
  "Do you advocate for funding towards climate change research? Yes/No/Refused",
  "What is your thought on legalization of drugs for medicinal purposes like marijuana? Favor/Oppose/Refused",
  "What's your perception of scientific activists getting involved in politics? Positive/Negative/Refused",
  "Do you support laws that mandate vaccination for preventable diseases? Support/Oppose/Refused",
  "Is your view on animal testing for cosmetic purposes favorable or unfavorable? Favorable/Unfavorable/Refused",
  "Do you believe that the influence of human activity on climate change is considerably significant?",
  "What's your take on the country's steps to promote renewable energy sources over traditional fossil fuels?",
  "The idea of federal funding for stem cell research can be polarizing. What's your perspective?",
  "Do you have reservations about the implementation of genetically modified organisms (GMOs) in our food supply?",
  "Considering the advancements in technology and the heightened necessity for security, do you see government surveillance as infringement on privacy or necessary for national safety?",
  "Do you think stringent regulations on pharmaceutical companies indirectly hurt consumers by inhibiting medical innovation?",
  "Describe your views on government funding for space exploration, is it a needed investment or a misplaced priority?",
  "Do you believe in the ethical considerations surrounding animal testing for scientific research?",
  "Some argue that nuclear power is a necessary part of the energy mix in our fight against climate change. What's your stance?",
  "Does the idea of Human-Centric AI, that respect and prioritize human concerns, resonate with your perspective on AI ethics?",
  "What do you think about the move towards implementing 5G technology nationwide despite potential security risks?",
  "In your view, is there enough being done by our government to curb the misuse of scientific research for harmful purposes (e.g. biological weapons)?",
  "Is the concept of a single-payer healthcare system, where the government funds healthcare for all citizens, appealing to you?",
  "Where do you stand on allowing companies to patent genes and genetic information?",
  "Given the high cost of scientific research, do you agree with the collaboration between academic institutions and commercial companies?",
  "Should decision-making for environmental policies be guided more by elected politicians or by climate scientists?",
  "How do you see the use of artificial intelligence in the military: as a dangerous precedent or necessary evolution in warfare?",
  "Some people believe vaccinations should not be mandatory and should be left to personal choice. What's your standpoint?",
  "Do you advocate for the inclusion of climate change education in the national school curriculum?",
  "Opinions differ on gene editing especially in altering the traits of future generations. What's your view on this?",
  "In your opinion, should genetic engineering for selecting desired traits such as eye color, height or intelligence in unborn babies be allowed? Allowed/Not Allowed/Refused",
  "Would you say funding for space exploration is a waste of public money or it significantly contributes to our understanding of the universe? Waste of Money/Significant Contribution/Refused",
  "Is climate change primarily caused by human activities or natural changes in the environment? Human Activities/Natural Changes/Refused",
  "Should the government enforce regulations to reduce emissions even if it can lead to job loss in certain industries? Enforce Regulations/Protect Jobs/Refused",
  "Should nuclear power be part of the energy solution considering the dangers it poses? Should Be Part/Shouldn't Be/Refused",
  "Do you believe the advancements in Artificial Intelligence should be controlled due to fears of job loss or allowed to develop ideally? Should be Controlled/Should be Allowed/Refused",
  "Do you think genetically modified foods are generally safe to eat or are they harmful to our health? Safe to Eat/Harmful/Refused",
  "Should children be given compulsory vaccinations even if parents object due to personal beliefs? Yes/No/Refused",
  "Do you consider the government's investment in military technology justified given the need for scientific research in other disciplines? Justified/Not Justified/Refused",
  "How would you view the use of animals for scientific testing? Justifiable/Unjustifiable/Refused",
  "Is technology making our lives better or does it pose significant threats to our privacy and mental health? Making Lives Better/Posing Threats/Refused",
  "Should research focused on developing more lethal weapons be encouraged given our strategic defense needs? Should be encouraged/Shouldn't be encouraged/Refused",
  "Do you believe that life exists elsewhere in the Universe? Yes/No/Refused",
  "Should government funding be allocated towards stem cell research? Yes/No/Refused.",
  "What is more important: the funding of space exploration or addressing immediate issues on Earth? Space Exploration/Immediate Issues/Refused",
  "Should the government regulate the use of personal data by tech companies? Yes/No/Refused",
  "How strongly do you support the transition to renewable energy sources, even if it means an increase in taxation? Strongly Support/Don't Support/Refused",
  "If you comprehend that research regarding the effects of human activity on climate change is widely accessible, how does this impact your view? Increases my trust in the findings/Decreases my trust in the findings/Makes no difference/Refused",
  "Pondering on the topic of renewable energy sources, what is the chance they'll fully replace conventional fuel sources in the future? Highly probable/Moderately probable/Not too probable/Not probable at all/Refused",
  "When you comprehend that data from genetic engineering experiments is open to the public, how does this modify your perspective? Enhances my trust in the findings/Detracts my trust in the findings/Doesn't alter my view/Refused",
  "Considering epidemiologists' role in the current global pandemic, how often do you think their predictions about the disease spread have been accurate? Always/Most often/Only sometimes/Rarely/Never/Refused",
  "When the news reveals scientists made significant progress in artificial intelligence, does it boost your faith in science? Yes, significantly/Yes, somewhat/Not really/Not at all/Refused",
  "When you become aware that data from studies on the effects of vaccination is available publicly, does it challenge or reinforce your existing opinion? Strengthens my belief/Weakens my belief/Makes no difference/Refused",
  "How likely do you think that nanotechnology will significantly affect our everyday life in the next decade? Very likely/Fairly likely/Not too likely/Not at all likely/Refused",
  "Having learned about the advances in stem cell research, how often would you say this research receives adequate funding? Often/Sometimes/Rarely/Never/Refused",
  "How probable is it that the adoption of vertical farming technologies might solve food scarcity issues globally? Very likely/Fairly likely/Not too likely/Not at all likely/Refused",
  "If you realize that marine biology research data is openly available, how does this alter your confidence in their findings? Increases my trust/Decreases my trust/No difference/Refused",
  "By considering astrobiologists, how often would you say they discover potential indicators of life outside the Earth? Always/Mostly/Sometimes/Rarely/Never/Refused",
  "How conceivable is it that increased investment in scientific research can lead to job creation? Highly probable/Moderately probable/Not very probable/Not probable at all/Refused",
  "When it comes to geological science, how likely is it that teaching this subject in schools could foster increased environmental consciousness? Very likely/Fairly likely/Not too likely/Not at all likely/Refused",
  "Do you think the government's current approach to climate change would be sufficient in mitigating its effects? More than sufficient/Just about right/Insufficient/No opinion",
  "Do you anticipate that major breakthroughs in renewable energy will reduce our dependency on fossil fuels in the near future? Highly anticipated/Moderately anticipated/Not anticipated/No opinion",
  "To what degree do you trust the scientific community's consensus about the safety of genetically modified foods? Trust completely/Moderately trust/Distrust/No opinion",
  "How would you interpret the increase in advancements in artificial intelligence: a threat or opportunity? Threat/Opportunity/Both/No opinion",
  "Would you agree with strict regulations for industries that contribute highly to carbon emissions? Agree/Disagree/Neutral/No opinion",
  "Do you believe that vaccination should be compulsory for everyone in order to prevent disease outbreaks? Strongly believe/Somewhat believe/Do not believe/No opinion",
  "Consider the financial investment in space exploration. Would you describe it as excessive, necessary, or not enough? Excessive/Necessary/Not enough/No opinion",
  "If a technologically advanced method of tracking individuals to prevent crimes was proposed, would you consider it as invasion of privacy or necessary for security? Invasion of privacy/Necessary for security/Both/No opinion",
  "Given the scientific consensus, should we be taking aggressive action to prevent further global warming? Strongly agree/Somewhat agree/Do not agree/No opinion",
  "Would you encourage the use of nuclear power as a means to combat climate change? Encourage/Discourage/Neutral/No opinion",
  "Do you consider the teaching of evolution in schools as a necessary aspect of science education or against religious beliefs? Necessary aspect of science education/Against religious beliefs/Both/No opinion",
  "How would you consider the scientific research on stem cells: ethical or unethical? Ethical/Unethical/Both/No opinion",
  "If a significant budget cut was proposed in the field of scientific research, would you oppose or support? Oppose/Support/Neutral/No opinion",
  "How would you characterize your trust in science when it conflicts with your personal beliefs? Trust science/Trust personal beliefs/Both/No opinion",
  "Should governments prioritize mammoth scientific projects like particle colliders providing less immediate benefits versus practical, applied research? Prioritize mammoth projects/Prioritize applied research/Equal focus/No opinion",
  "Do you perceive climate change as an important issue that affects domestic policies? Very important/Moderately important/Not important/No opinion",
  "Would you say that genetically modifying crops to increase their yield and resistance to disease is justifiable or should be forbidden? Justifiable/Should be forbidden/Both/No opinion",
  "Would you support the implantation of microchips in humans for identification and security purposes? Support/Oppose/Neutral/No opinion",
  "Should funding for STEM fields in education be increased to improve national competitiveness? Yes, increased/No, it's sufficient/Decreased/No opinion",
  "Do you agree that artificial intelligence poses a significant threat to employment in the near future? Strongly agree/Somewhat agree/Do not agree/No opinion",
  "Given the climate change scenario, what is your view on developing renewable energy sources in the next ten years? Do you anticipate a Significant progress/Moderate progress/Minor progress/No progress scenario?",
  "When considering government funding for scientific research, should there be a greater allocation for Healthcare research/Climate change research/Space exploration/Equal distribution for all fields?",
  "Do you believe the federal government should adopt measures to endorse Electric vehicles/All types of energy-efficient alternatives/Current fossil fuel-based vehicles for primary transportation in the future?",
  "What are your views on teaching evolutionary science in public schools? Should it be Taught as only accepted theory/Taught along with other theories like intelligent design/Not be taught at all?",
  "How likely is Artificial Intelligence to disrupt job markets and exacerbate income inequality in the next decade? Very likely/Fairly likely/Not too likely/Not likely at all?",
  "What's your opinion on the development of Genetically Modified Organisms (GMOs) for food production? Is it an Essential development/Dangerous development/Neutral development?",
  "How optimistic are you in scientists discovering an effective, sustainable solution to Plastic waste management within the next decade? Very optimistic/Somewhat optimistic/Neutral/Somewhat pessimistic/Very pessimistic?",
  "Antibiotic resistance is a looming global challenge. How urgent is it for scientists to develop new antibiotics? Extremely urgent/Very urgent/Moderately urgent/Not that urgent?",
  "What are your feelings about governments funding lunar or Mars colonization projects? Are they Essential/Fascinating but not critical/Unnecessary/Not worth the investment at all?",
  "How would you rank the importance of government investment in STEM education? Highest priority/High priority/Moderate priority/Low priority/Least priority?",
  "Should the government provide subsidies to industries adopting green technologies? Fully support/Support to some extent/Neutral/Do not support/Strongly against?",
  "Is there a need for more rigorous regulation of data privacy and cyber-security in the age of big data? Extremely important/Very important/Somewhat important/Not important?",
  "How urgent is the development of mass-market clean energy solutions like solar, wind, and nuclear power to tackle climate change? Extremely urgent/Very urgent/Moderately urgent/Not at all urgent?",
  "How essential do you believe it is for the government to invest in research for Cybersecurity/Energy/Space/Agriculture/Healthcare or all of them equally?",
  "What's your stances towards investing in AI-Driven Healthcare? Should it be a Primary investment area/Secondary Investment area/Should not invest?",
  "Should the next administration prioritize investment in Quantum computing/Virtual Reality/Artificial Intelligence/Biotechnology or equally distribute resources amongst these?",
  "How confident are you in the role of science in combating future pandemics? Extremely confident/Very confident/Moderately confident/Not at all confident?",
  "What is your inclination towards stem cell research? Strongly favor/Somewhat favor/Neutral/Somewhat oppose/Strongly oppose?",
  "When it comes to space exploration, should the focus primarily be on Unmanned missions/Manned missions/A mix of both?",
  "How crucial do you think it is for scientific research data to be publicly available? Extremely crucial/Very crucial/Moderately crucial/Not at all crucial?",
  "Considering the exploration of outer space, is it more beneficial to spend resources on robotic missions or human missions to other planets?",
  "Do you believe Genetically Modified Foods (GMOs) pose a serious threat to human health or the environment, or do they offer more benefits than risks?",
  "What's your take on nuclear power? Is it a necessary bridge to a clean energy future or an unacceptably risky technology that should be phased out?",
  "How do you perceive the role of scientific consensus in informing public policy? Should policymaking rely primarily on scientific consensus, or are there other factors that should be equally weighted?",
  "How do you view climate change? Should it be classified as a global emergency that demands urgent action, or is it a gradual process that can be managed over time?",
  "Should infant vaccination be made compulsory by law, or should parents have the right to refuse vaccinations for personal or religious beliefs?",
  "In your view, is the growth of artificial intelligence (AI) more likely to create a utopia or dystopia for humanity?",
  "How do you value biodiversity? Do you consider it essential to uphold life on Earth, or is the emphasis on protecting all species an exaggerated concern?",
  "Should oceanic regions be opened for deep-sea mining in order to extract precious metals and minerals, or left undisturbed to protect marine ecosystems?",
  "Are fossil fuels solely to blame for climate change or are there other significant contributors?",
  "Is our understanding of gender as a binary concept outdated due to advances in science, or should traditional concepts of gender be maintained?",
  "Does humankind have the right to manipulate the Earth's weather and atmospheric conditions for their benefit, or is such geoengineering a dangerous interference with nature?",
  "Are renewable energy resources capable of fully replacing fossil fuels in the near future, or will fossil fuels remain a necessary evil for some time to come?",
  "Do you consider animal testing to be a necessary evil for scientific progress, or should it be entirely banned and replaced with alternative methods?",
  "Should the cloning of human beings for organ donation be permitted on ethical grounds, or is this a misuse of scientific knowledge?",
  "Are advances in facial-recognition technology a significant enhancement in ensuring public safety, or a vast breach of personal privacy?",
  "How important is exploring the Mars for the survival of the human race? Is it really crucial, or is it a waste of resources that could be better invested on Earth?",
  "Should scientific research for military applications be encouraged to ensure national security, or does it generally lead to destructive advances?",
  "Do you support the concept of gene editing in human embryos to prevent diseases, or do you believe it's a slippery slope towards designer babies and eugenics?",
  "Considering the current ecological crisis, do you think we should focus on space colonization as an alternative future for humanity, or concentrate on healing and preserving our own planet first?",
  "How do you perceive the role of genetic modification in agriculture? Is it Primarily beneficial/Harmful/Neutral/Refused?",
  "Considering recent advancements in medical technology, do you believe using AI in healthcare is Favorable/Unfavorable/Neither favorable nor unfavorable/Refused?",
  "In your opinion, are the effects of climate change observable in our daily lives? Yes, it can be observed/No, it cannot be observed/Refused",
  "How do you view the exploration and colonization of Mars? Are they Realistic dreams/Wastes of resources/Neutral/Refused?",
  "Given advancements in technology, do you think reliance on nuclear energy is a Good direction/Bad direction/Neutral point of view/Refused?",
  "Do you hold a belief that renewable energy can completely replace traditional energy sources in the future? Completely possible/Not possible/Ambiguous/Refused",
  "What are your thoughts on utilizing genetically modified organisms (GMOs) in the food industry? Predominantly supportive/Mostly unsupportive/Neither supportive nor unsupportive/Refused",
  "In your opinion, what impact will artificial intelligence have on the job market? Majorly positive/Mostly negative/Neither positive nor negative/Refused?",
  "Do you think genetically engineered food should be labeled as such? Yes, should be labeled/No, shouldn't be labeled/Refused?",
  "Considering global warming, do you support the idea of Electric vehicles over traditional vehicles/Traditional vehicles over electric vehicles/Neither/Refused?",
  "Do you believe it is possible for humans to reverse the conditions created by climate change with the help of technology? Absolutely possible/Not possible at all/Undecided/Refused?",
  "What is your opinion on the ethics of animal testing for scientific research? Highly contentious/Often justified/Neither contentious nor justified/Refused?",
  "How do you perceive the use of technology in education? Mainly advantageous/Largely disadvantageous/Neither advantageous nor disadvantageous/Refused?",
  "Do you believe that the development of nuclear weapons contributes to global stability or causes more conflict? Boosts stability/Causes conflict/Undecided/Refused?",
  "Do you regard advancements in AI and robotics as a threat to human occupations? Definitely a threat/Not a threat/Neutral/Refused.",
  "Regarding GMOs, do you think they pose more benefits or harm to society? More beneficial/More harmful/Equal amounts of benefit and harm/Refused",
  "How do you view the future of renewable energy? Positive and promising/Grim and unpromising/Neither promising nor unpromising/Refused",
  "What's your opinion on bio-engineered organ transplants? Mostly approving/Mostly disapproving/Neutral/Refused",
  "How would you evaluate the present government's approach to funding research and development in science? Excellent/Good/Fair/Poor/Refused",
  "In your eyes, do corporate enterprises investing in scientific innovations hold more promise than government-funded research? Agree/Disagree/Neutral/Refused",
  "Are scientists and researchers providing enough influence on policy-making decisions? Too much/Just right/Not enough/Refused",
  "How do you evaluate the efficiency of global consortiums in combatting scientific issues like climate change? Highly efficient/Somewhat efficient/Not so efficient/Inefficient/Refused",
  "Do political leaders give sufficient attention to empirical evidence provided by scientific experts when formulating policies? Always/Often/Sometimes/Rarely/Never/Refused",
  "Is the politicization of climate change detrimental to impartial scientific research? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "Would you say that the general public is well-informed about the scientific basis for public health matters like vaccinations? Extremely informed/Very informed/Somewhat informed/Not so informed/Not informed at all/Refused",
  "Do you believe that the current education system adequately prepares students for understanding complex scientific concepts? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "To what extent do you think space exploration should be a priority for our government? Not a priority/Low priority/Moderate priority/High priority/Top priority/Refused",
  "Should scientific research be compromised in favor of economic growth? Always/Often/Sometimes/Rarely/Never/Refused",
  "In general, do you believe scientists working for corporate enterprises are biased in their research? Highly biased/Somewhat biased/Somewhat unbiased/Highly unbiased/Refused",
  "Are 'fake news' and misinformation significantly undermining the credibility of science? Highly damaging/Somewhat damaging/Not so damaging/Not damaging at all/Refused",
  "Is the pace of scientific and technological advancements outstripping our legal and ethical frameworks? Very quickly/Somewhat quickly/Not very quickly/Not at all quickly/Refused",
  "How do you evaluate the mainstream media's role in communicating scientific discoveries to the public? Very effective/Somewhat effective/Not very effective/Ineffective/Refused",
  "Should climate change education be embedded in the school curriculum? Definitely yes/Probably yes/Might or might not/Probably not/Definitely not/Refused",
  "How would you rate government transparency in disclosing scientific findings affecting public health? Very transparent/Somewhat transparent/Not very transparent/Not transparent at all/Refused",
  "Should governments impose stricter regulations on industries contributing to environmental damage? Always/Often/Sometimes/Rarely/Never/Refused",
  "In your perspective, is scientific consensus on climate change well-reflected in current public policies? Fully reflected/Mostly reflected/Partially reflected/Barely reflected/Not reflected/Refused",
  "Do you agree that scientific innovation holds the key to building a sustainable society? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "What's your belief about green energy as an alternative to fossil fuels: Are fossil fuels still necessary/Can we fully replace them with renewables/I have mixed feelings about this/Refused",
  "When you contemplate animal experimentation for scientific research, is this something you support wholeheartedly/ Only in certain conditions/Generally oppose/Refused",
  "With regard to genetically modified organisms (GMOs) in our food supply, are you highly supportive/ somewhat supportive/cautious or concerned/refused?",
  "How much confidence do you place in the findings of climate scientists? A lot/Some/Not much at all/Refused",
  "How would you characterize your trust in technology companies working on artificial intelligence? High/ Moderate/ Low/ Refused",
  "What does stem cell research evoke for you: Hope for medical breakthroughs/ Concern over ethical implications/ Equally hopeful and concerned/ Refused",
  "When considering nuclear energy as a power source, Do you see it as a necessary evil/ do you believe we should invest more in nuclear technology/ do you wish for a total shutdown of all nuclear power plants/Refused",
  "Suppose you were told that cloning could be used for replicating organs for transplants. How would you react: Acceptance/Rejection/Mixed feelings/Refused?",
  "How do you gauge the necessity of vaccinations? Vital/ Beneficial but not vital/ Unnecessary /Refused",
  "Can you appraise space explorations relevance in comparison to pressing issues on Earth? More important/Equally important/Less important/Refused",
  "How would you evaluate government's role in controlling scientific research? Excessive appropriate/Insufficient/Refused",
  "How do you regard evolution as a valid explanation for the variety and complexity of life on earth? Fully accept/ Mostly accept/ Skeptical/Refused",
  "What is your stance on using DDT (a powerful pesticide) in areas suffering from malaria, despite its environmental impact? Justified/ Not justified/A necessary evil/Refused",
  "When it comes to teaching scientific theories that challenge religious beliefs in school, do you endorse it/ Have reservations/ Completely against it/ Refused",
  "When you think about the use of AI in making significant decisions such as hiring, do you consider it to be Promising/ Worrying/ Has potential but needs safeguards/ Refused",
  "How do you view the role of big pharmaceutical companies in the healthcare sector? Primarily positive/Primarily negative/Mixed feelings/Refused",
  "Regarding the use of pesticides in agriculture, are you generally For the use/ Against the use/ Think there must be a balance/ Refused",
  "How confident are you in science's ability to address major problems facing society? Very confident/ Somewhat confident/ Not very confident/ Not at all confident/ Refused",
  "Thinking about governmental policies promoting electric cars to cut down on carbon emissions, do you inevitably support them/ Accept them grudgingly/ Oppose them/ Refused",
  "If you had to choose, would you say that the government is investing sufficient funds into scientific research, or should it allocate more resources? Enough resources/Should allocate more/Refused",
  "In reference to the use of artificial intelligence in law enforcement, do you believe it is a justified use of technology or an invasion of privacy? Justified use/Invasion of privacy/Refused",
  "What are your thoughts on implementing nationwide regulations on carbon emissions for reducing climate change? Favorable/Unfavorable/Neither/Refused",
  "Do you believe that the widespread use of genetically modified foods is a step forward in global food security, or a potential risk to health and nature? Step forward/Potential risk/Refused",
  "Where do you stand on the ethicality of cloning animals for medical research? For/Against/Neither/Refused",
  "What is your position on the commercialization of space travel and exploration? Supportive/Opposed/Refused",
  "Would you say that advancements in nuclear power technology help in enhancing energy sustainability, or do they pose a threat due to potential disaster? Help in sustainability/Pose a threat/Refused",
  "What's your stance on teaching evolution in public schools: should it be mandatory; alternatively, should it be an option; or should it be banned altogether? Mandatory/Optional/Banned/Refused",
  "Considering the benefits versus the ethical implications, do you believe experimenting on animal models for medical research is justified? Justified/Unjustified/Refused",
  "Do you hold the belief that the government should enforce stricter regulations on pharmaceutical companies, or should the market shape itself? Enforce regulations/Let the market shape itself/Refused",
  "Where do you stand on granting wider access to telemedicine? Favorable/Unfavorable/Neither/Refused",
  "How do you feel about introducing coding and computer sciences into school curriculum from an early stage? Favorable/Unfavorable/Neither/Refused",
  "Do you think utilizing stem cell technology in medical treatments is a step forward in healthcare or a violation of ethical standards? Step forward/Violation of ethical standards/Refused",
  "How do you regard the promotion of alternative sources of energy like wind and solar power? Supportive/Opposed/Refused",
  "What's your outlook on the complete transition to electronic vehicles and phasing out gasoline cars? Supportive/Opposed/Refused",
  "What are your thoughts on genetically modifying human embryos to prevent disease: is it a breakthrough in medicine or crossing the line in nature's domain? Breakthrough in medicine/Crossing the line/Refused",
  "Is it your belief that artificial intelligence could eventually replace most human jobs, or should its development be controlled to protect the labor market? Could replace/Should be controlled/Refused",
  "What is your position on 'Technological Singularity', the concept where AI surpasses human intelligence, do you think it's a threat or an opportunity? Threat/Opportunity/Refused",
  "Do you hold the opinion that we should promote the building of nuclear power plants to combat climate change, or oppose it due to safety concerns? Promote/Oppose/Refused",
  "Should plastic manufacturing and consumption be strictly controlled by the government or should individuals have personal responsibility for its reduction? Government control/Personal responsibility/Refused",
  "Do you believe that climate change is a A very urgent issue/A moderately urgent issue/Not a very urgent issue/Not an issue at all/Refused?",
  "Are you in support of nuclear energy as a means to combat global warming? Fully support/Somewhat support/Somewhat oppose/Fully oppose/Refused",
  "How much trust do you place in scientific predictions regarding future climate changes? Complete trust/Moderate trust/Little trust/No trust at all/Refused",
  "What's your view on the assertion that humans are the primary cause of global warming? Completely agree/Mostly agree/Mostly disagree/Completely disagree/Refused",
  "Describe your level of agreement with the consensus among scientists that vaccines are safe and effective? Strong agreement/Moderate agreement/Minor agreement/Disagreement/Refused",
  "How vital do you think it is for the government to invest in renewable energy resources? Extremely critical/Very critical/Moderately critical/Not at all critical/Refused",
  "What are your thoughts on imposing stricter regulations to reduce air pollution from industries? Fully support/Mostly support/Partially support/Do not support/Refused",
  "Do you consider space exploration a worthwhile venture deserving more public funding? Totally agree/Agree/Disagree/Fully disagree/Refused",
  "What are your views on the safety of consuming genetically modified foods? Very safe/Somewhat safe/Not very safe/Not safe at all/Refused",
  "Is artificial intelligence a threat or opportunity for our society? Major threat/Minor threat/Minor opportunity/Major opportunity/Refused",
  "How would you evaluate the importance of biodiversity conservation for the future of our planet? Extremely important/Very important/Moderately important/Not important at all/Refused",
  "Do you believe that government regulations are necessary for protecting the environment? Fully agree/Agree/Disagree/Fully disagree/Refused",
  "How much faith do you have in technology to solve our environmental problems? Complete faith/Considerable faith/Some faith/No faith at all/Refused",
  "What do you think about the idea of colonizing other planets as a solution to overpopulation on Earth? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "How crucial is it for schools to teach children about the negative impact of human activities on the environment? Extremely vital/Very vital/Somewhat vital/Not vital at all/Refused",
  "What is your opinion on claims that organic farming is better for the environment than conventional farming? Completely agree/Mostly agree/Mostly disagree/Completely disagree/Refused",
  "Do you trust research supported by corporations even if it benefits their own product? Fully trust/Partially trust/Somewhat trust/Do not trust/Refused",
  "Do you believe science has more positive or negative impacts on society? More positive/Equally positive and negative/More negative/Refused",
  "How much credibility would you give to information about global warming posted on social media? Great deal of credibility/Fair amount of credibility/Not too much credibility/No credibility at all/Refused",
  "What are your thoughts on the long-term effects of GMOs (genetically modified organisms) on the environment and biodiversity? GMOs are beneficial/more study needed/GMOs are harmful/Refused",
  "How much trust do you place in scientific models, like those predicting climate change? Trust a lot/Trust somewhat/Do not trust/Refused",
  "What degree of responsibility should be placed on corporations for pollution mitigation? Corporations should bear full responsibility/Corporation and government responsibility should be shared/Corporations should bear no responsibility/Refused",
  "How would you react to government implementing tighter regulations on fracking, an industrial method to extract natural gas? Fully support/Somewhat support/Oppose/Strongly oppose/Refused",
  "Do you think nuclear power is an appropriate solution for our energy challenges? Yes, definitely/Yes, but with caution/No, but it's worth considering/No, never/Refused",
  "What is your level of support for public funding of stem cell research? Strongly support/Somewhat support/Do not support/Strongly oppose/Refused",
  "What are your views on the implementation of a carbon tax to combat climate change? Strongly support/Somewhat support/Do not support/Strongly oppose/Refused",
  "Should human genetic engineering be pursued for enhancing human capabilities beyond normal levels? Yes definitely/Yes but with restrictions/No/Refused",
  "Where do you stand on the implementation of sustainable farming practices on an industrial scale? Absolutely necessary/Important but not urgent/Not relevant/Refused",
  "When it comes to chemical studies, are you more concerned about potential benefits or potential health risks? More concerned about benefits/Equally concerned about both/More concerned about risks/Refused",
  "Do you believe science should shape our laws, such as the laws about abortion? Science should have a major influence/Science should have a minor influence/Science should not influence at all/Refused",
  "Do you agree with the allocation of government funds for astronaut training and space exploration missions? Completely agree/Agree but with reservations/Disagree/Completely Disagree/Refused",
  "What is your stance on prioritizing funding for biodiversity conservation over economic development? Completely agree/Agree with reservations/Disagree/Completely disagree/Refused",
  "How do you perceive the impact of scientific innovations on social inequalities? Reduce inequalities/Increase inequalities/No effect/Refused",
  "Do you believe technologies causing unemployment should be regulated by the government? Yes, all technology/Yes, but some exceptions/No, government should not regulate/Refused",
  "Should the government impose restrictive measures on meat consumption to reduce greenhouse gas emissions? Strongly agree/Agree/Disagree/Strongly disagree/Refused",
  "How do you view the impact of artificial intelligence and automation on the workforce? A threat/A beneficial evolution/No effect/Refused",
  "What is your opinion on the mandatory vaccination policies, particularly for Covid-19? Should be implemented/Should be advised, but not mandatory/Should not be implemented/Refused",
  "Do you agree with genetically modifying crops to increase their yield and feed the world's growing population? Strongly agree/Agreement with reservations/Disagree/Strongly disagree/Refused",
  "From your perspective, do you feel that most physicists uphold ethical standards in their research? Always uphold ethical standards/Often uphold ethical standards/Rarely uphold ethical standards/Never uphold ethical standards/Refused",
  "Do you ascribe to the view that most climate scientists are alarmists trying to push a political agenda? Agree/Disagree/Neutral/Refused",
  "Would you argue that the biotechnology industry utilizes genetic engineering responsibly most of the time? Uses responsibly most of the time/Uses irresponsibly most of the time/Neutral/Refused",
  "Do you believe that government regulations on scientific research hinder progress more often than they prevent misconduct? Hinder progress more often/Prevent misconduct more often/Neutral/Refused",
  "Would you say that most scientists involved in animal testing are doing so ethically and responsibly? Ethically and responsibly/Not ethically and responsibly/Neutral/Refused",
  "Given your present understanding, could you affirm that scientists who work with Big Pharma are mainly motivated by the betterment of healthcare? Mainly motivated by betterment of healthcare/Mainly motivated by personal gain/Neutral/Refused",
  "Can you confidently say that most scientific breakthroughs you know about are a product of publicly funded research? Most are publicly funded/Most are privately funded/Unsure/Refused",
  "Do you imagine geneticists who work on Human Genome Project put their professional integrity ahead of personal or corporate gain? Professional integrity first/Corporate or personal gain first/Neutral/Refused",
  "Do you concur that researchers in the field of renewable energy are often stifled by political interests? Agree/Disagree/Neutral/Refused",
  "In light of your knowledge about artificial intelligence research, do you believe the field is progressing at a pace faster than our ability to legislate for it? Progressing faster/Legislation keeping up/Neutral/Refused",
  "With regard to your views on neuroscience, would you attest that the use of brain-imaging technology could be infringing upon personal privacy? Agree/Disagree/Neutral/Refused",
  "When reflecting on the issue of space travel, how would you assess the impact of commercial enterprises like SpaceX on the progression of scientific research in this field? Positive impact/Negative impact/Neutral/Refused",
  "Given your current understanding, do you believe that scientists working in nuclear research are more altruistic than opportunistic in their motivations? More altruistic/More opportunistic/Neutral/Refused",
  "When thinking about the field of microbiology, do you agree with the claim that research involving genetically modified organisms (GMOs) is mostly done for corporate gain? Agree/Disagree/Neutral/Refused",
  "Reflecting on your knowledge about robotics, do you affirm that advancements in this field pose threat to jobs and could increase income inequality? Agree/Disagree/Neutral/Refused",
  "How would you describe your level of trust in scientists conducting research on COVID-19? Fully trust/Mostly trust/Somewhat distrust/Do not trust at all/Refused",
  "Do you hold the belief that geoengineers working on climate change solutions put environmental protection ahead of corporate interests? Environmental protection first/Corporate interests first/Neutral/Refused",
  "Could you assert that stem cell researchers conducting human trials are proceeding with due caution and ethics? Proceeding with due caution and ethics/Not proceeding with due caution and ethics/Neutral/Refused",
  "In light of current debates, do you think that scientists working on GMOs are more often vilified without reason? Agree/Disagree/Neutral/Refused",
  "Would you argue that most ecologists put the wellbeing of the planet ahead of political considerations in their research? Put planet well-being ahead/Do not put planet well-being ahead/Neutral/Refused",
  "How frequently do you believe that scientists exaggerate the severity of environmental damage All the time/Most of the time/Sometimes/Very rarely/Never",
  "What is your take on the statement \"evolution is just a theory and lacks factual basis\" Agree/Disagree/Neutral/Refused",
  "In your opinion, how likely is it that renewable energy can fully replace fossil fuels Very likely/Fairly likely/Not too likely/Not at all likely/Refused",
  "Do you consider GMOs to be beneficial or harmful to human health Definitely beneficial/Somewhat beneficial/Neither beneficial nor harmful/Somewhat harmful/Definitely harmful/Refused",
  "When a scientist publicly supports a political candidate or party, does it impact your trust in their research Dramatically reduces trust/Slightly reduces trust/No change/Increases trust/Dramatically increases trust/Refused",
  "How frequently do you think scientists should interact with policymakers to influence science-based policies All the time/Most of the time/Sometimes/Never/Refused",
  "How strongly do you believe in the safe use of vaccines to prevent diseases Strongly believe/Believe/Neutral/Disbelieve/Strongly disbelieve/Refused",
  "What's your stance on funding for space exploration Increase significantly/Increase slightly/Keep the same/Decrease slightly/Decrease significantly/Refused",
  "Do you believe scientists are biased or impartial in their research findings Completely biased/Partly biased/Neither biased nor impartial/Partly impartial/Completely impartial/Refused",
  "Relating to the ethical debates in science, how often do you think scientists must consider moral implications Always/Most of the time/Some of the time/Never/Refused",
  "In your understanding, how critically should citizens question scientific claims Extremely critically/Very critically/Moderately critically/Not very critically/Not at all critically/Refused",
  "How frequently would you consider scientific data to be open to interpretation All the time/Most of the time/Sometimes/Never/Refused",
  "Do you think climate change will drastically impact your quality of life within the next 20 years Definitely/Fairly likely/Not too likely/Not at all likely/Refused",
  "How strongly do you feel that automation and AI pose a threat to human employment Very strongly/Strongly/Neutral/Not very strongly/Not at all strongly/Refused",
  "What is your view on humanity's ability to colonize other planets in the next century Very likely/Quite likely/Neutral/Quite unlikely/Very unlikely/Refused",
  "In your view, how often should scientific findings be made freely available to the public All the time/Most of the time/Sometimes/Never/Refused",
  "What's your take on the government subsidizing the solar energy industry? Government should subsidize/Government should not subsidize/Refused",
  "Do you believe the government should be investing more in space exploration initiatives or focusing resources on pressing issues at home?  More investments into space/Focus on earth issues/Refused",
  "How do you perceive nuclear power as a means of resolving energy requirements? Favorable/Not favorable/Refused",
  "Do you think that a policy of strict regulations for GMOs (genetically modified organisms) is necessary or detrimental? Necessary/Detrimental/Refused",
  "Should the government enforce stricter laws on industries polluting the environment? Stricter enforcement/Less enforcement/Refused",
  "Should the government promote or discourage stem cell research? Promote/Discourage/Refused",
  "Do you favor government funding for research in Artificial Intelligence or believe it to be an unnecessary expense? Favor funding/Believe it's an expense/Refused",
  "What's your stance on climate change? Is it a pressing issue that needs global cooperation or overstated? Pressing issue/Overstated/Refused",
  "Do you think more public funding should be allocated to scientific research? More funding/Less funding/Refused",
  "Should the development and possession of nuclear weapons be entirely banned? Ban it/Don't ban it/Refused",
  "Is man-made global warming an established scientific fact, or are there justified doubts about its existence? Established fact/Justified doubts/Refused",
  "Should public schools be required to teach evolution as a central theme of biology? Required/Not required/Refused",
  "Should government invest in building more nuclear power plants or invest in renewable energy sources, such as solar and wind energy? Nuclear power/Renewable energy sources/Refused",
  "Should genetically modified foods be labeled as such for the consumer's benefit or would it unnecessarily stir fear and confusion? Should be labeled/Shouldn't be labeled/Refused",
  "Should earth sciences or space sciences receive more funding? Earth sciences/Space sciences/Refused",
  "Should laws be stiffened for waste management and recycling or are current laws sufficient? Current laws are sufficient/Stiffen laws/Refused",
  "What do you think about the ethical implications of human cloning? Should it be pursued or stopped? Should be pursued/Should be stopped/Refused",
  "Regarding animal testing for scientific and commercial use, should it be allowed or banned? Allowed/Banned/Refused",
  "What are your views on government-funded vaccination programs? Are they needed, or should they be voluntary? Needed/Voluntary/Refused",
  "Are research and development tax incentives necessary for scientific growth, or should the private sector handle these costs? Necessary/Private sector should handle/Refused",
  "Do you think climate change is caused by human activity and must be urgently addressed, or is it a natural phenomenon that requires no immediate solution? Human-caused and urgent/Natural and needs no immediate action/Mixed views/Refused",
  "Based on your knowledge, indicate if you believe the government should increase funding for scientific research or prioritize other areas. Government should increase funding/Government should prioritize other fields/No opinion/Refused",
  "In your perspective, are genetically modified organisms (GMOs) essentially beneficial or detrimental to society? Overall beneficial/Overall detrimental/Neither/Refused",
  "Indicate whether you support or oppose fracking for natural gas and oil. Support fracking/Oppose fracking/Have mixed feelings/Refused",
  "Do you consider nuclear power as a sustainable energy source for the future or a dangerous threat to the environment? Sustainable energy source/Dangerous threat/Not sure/Refused",
  "Would you argue for or against the idea that space exploration is a valuable investment? Argue for/Argue against/Unsure/Refused",
  "Should public health decisions about pandemics be based on scientific evidence or economic considerations? Based on scientific evidence/Based on economic considerations/Both are equally important/Refused",
  "Is it crucial to include climate change education in school curriculums, or should it be left to personal research and discretion? Include in school curriculum/Leave to personal research/Mixed views/Refused",
  "Assuming you have to pick, would you advocate a vegetarian/vegan lifestyle for environmental reasons, or uphold the freedom of dietary choices even if it has environmental consequences? Advocate vegetarian/vegan lifestyle/Uphold freedom of dietary choices/Not sure/Refused",
  "Do you principally trust the scientific consensus on vaccine safety and efficacy, or do you uphold personal beliefs and rights against mandatory vaccinations? Trust scientific consensus/Uphold personal beliefs and rights/Mixed views/Refused",
  "Do you broadly endorse the use of animals for scientific testing and research or oppose it due to ethical reasons? Endorse animal use/Broadly oppose due to ethical concerns/Mixed views/Refused",
  "Is technology, in your view, more of a solution to our current environmental challenges, or is it the root cause? Solution to environmental challenges/Root cause of environmental issues/Both/Mixed feelings/Refused",
  "When you hear about researchers being funded by corporations, do you question the credibility of the research due to potential bias, or do you see it as necessary funding? Question credibility/See it as necessary/Both feelings/Refused",
  "Do you believe in evolution as the best explanation for life's diversity, or do you uphold creationism or intelligent design theories? Believe in evolution/Uphold creationism or intelligent design/Unsure/Refused",
  "How do you feel about the Paris climate agreement? Should the nation be part of it or keep itself away? Should be part of it/Should keep itself away/Not sure/Refused",
  "Do you think the internet and social media are responsible for creating echo chambers for pseudoscience, or are they tools for wider dissemination of scientific knowledge? Create echo chambers for pseudoscience/Tools for dissemination of scientific knowledge/Both/Mixed feelings/Refused",
  "In your opinion, should \"big pharma\" be more regulated, or does it need more freedom to make breakthrough discoveries? More regulation needed/More freedom needed/There should be a balance/Refused",
  "Do you regard stem cell research as a vital scientific breakthrough offering hope for numerous diseases, or do you see it as ethically problematic due to usage of human embryos? Vital scientific breakthrough/Ethically problematic/Mixed feelings/Refused",
  "Do you believe global cooperation in scientific research is essential, or should nations independently focus on their scientific interests? Global cooperation is essential/Nations should independently focus/Mixed views/Refused",
  "In your view, should science and politics remain separate or is it inevitable, even necessary, for them to intertwine? Should remain separate/Inevitable and necessary to intertwine/Mixed feelings/Refused",
  "In your perspective, should taxpayer dollars be invested in scientific research, or should it be financed privately? Public funding for science/Private funding for science/Both should contribute to science funding/Refused",
  "How frequently do you believe health researchers prioritize the silencing of controversial research findings? Always/Often/Sometimes/Never/Refused",
  "What level of trust do you have in scientists working on genetically modified organisms (GMOs)? Full trust/Partial trust/Minimal trust/No trust at all/Refused",
  "How often, in your opinion, do pharmaceutical companies manipulate medical research for personal gain? Always/Often/Sometimes/Rarely/Never/Refused",
  "Should scientists have the authority to determine the safety of nuclear power plants without government intervention? Yes/No/Depends on the circumstances/Refused",
  "What's your take on the role of scientific consensus in influencing government policies? It should be highly influential/Somewhat influential/Rarely influential/Largely irrelevant/Refused",
  "Do you think funding from oil companies influences climate change research? Always/Often/Seldom/Never/Refused",
  "Based on your understanding, are scientists in agreement about the causes of climate change? Yes/No/There is some disagreement/It is unclear/Refused",
  "How much faith do you have in the scientific protocols for safety evaluation of new drugs? Full trust/Partial trust/Minimal trust/No trust at all/Refused",
  "In your view, should the role of AI in decision-making processes be increased, decreased, or stay the same? Increased/Decreased/Stay the same/It depends/Refused",
  "Do you think corporations play a significant role in the distortion of scientific research? Always/Often/Sometimes/Never/Refused",
  "How often do you think the media accurately report scientific discoveries? All of the time/Most of the time/Some of the time/Never/Refused",
  "In your perspective, should the government have more control over environmental policy or should the free market decide? The government should control/Free market should decide/Both should contribute/Refused",
  "How much reliance do you have on scientific evidence when forming your stance on political issues? A lot/A moderate amount/A little/None at all/Refused",
  "Do you believe that scientists should be involved in policy making? Yes/No/Only in certain situations/Refused",
  "How often would you say the publics understanding of science is manipulated by the media? Always/Often/Seldom/Never/Refused",
  "In your opinion, should scientists be impartial, or can they be activists for causes they believe in? Should be impartial/Can be activists/Both are acceptable/Refused",
  "What is your trust level in independent research, where universities and nonprofit organizations conduct the research without corporate involvement? Full trust/Partial trust/Minimal trust/No trust at all/Refused",
  "In your point of view, has scientific research on renewable energy had a mostly positive or negative impact on our ability to combat climate change? Mostly positive/Mostly negative/Neither positive nor negative/Refused",
  "Do you think the majority of climate research scientists present data accurately and objectively, or do they often skew it to align with personal or political beliefs? Present data accurately and objectively/Often skew data/Neither /Refused",
  "Would you agree that pharmaceutical research scientists make a substantial contribution to improving public health? Strongly agree/Agree/Neither agree nor disagree/Disagree/Strongly disagree/Refused",
  "Are you of the opinion that the investments in space research and exploration are justifiable and beneficial? Highly beneficial and justifiable/Somewhat beneficial and justifiable/Neither beneficial nor justifiable/Somewhat unjustifiable and not beneficial/Highly unjustifiable and not beneficial/Refused",
  "Do you believe that political leanings influence the interpretation and direction of environmental research significantly? Significantly influenced/Partially influenced/Slightly influenced/Not influenced at all/Refused",
  "In your perspective, has genetic modification in agriculture mostly benefited or harmed society and the planet? Mostly benefited/Mostly harmed/Neither benefited nor harmed/Refused",
  "Do you think scientific research on artificial intelligence and automation will lead to more job creation or job losses? More job creation/More job losses/Neither/Mixed impact/Refused",
  "Do you feel that the big pharmaceutical companies use science and research for the greater good or for their own profit? For the greater good/For their own profit/Both/Neither/Refused",
  "Are you of the opinion that the government should fund stem cell research? Strongly support/Support/Neutral/Oppose/Strongly oppose/Refused",
  "Do you think concerns about climate change are overstated, understated, or accurately stated by most climate scientists? Overstated/Understated/Accurately stated/Refused",
  "Do you believe scientific advancements in artificial intelligence will lead to societal progress or dystopia? Societal progress/Dystopia/Neither/Both/Refused",
  "Do you think our education curriculum should place more emphasis on climate change information and environmental preservation practices? Strongly agree/Agree/Neutral/Disagree/Strongly Disagree/Refused",
  "How strongly do you support the government investing more in scientific research and development? Strongly support/Support/Neither support nor oppose/Oppose/Strongly Oppose/Refused",
  "Do you think science can provide a solution to all of humanity's problems? Definitely yes/Mostly yes/Neither yes nor no/Mostly no/Definitely no/Refused",
  "How much credibility do you accord the field of evolutionary biology and its explanations for human origins? Fully credible/Mostly credible/Neither credible nor incredible/Mostly incredible/Entirely incredible/Refused",
  "Do you consider that government should fund research into alternative medicine practices along with conventional medicine? Strongly recommend/Recommend/Neutral/Do not recommend/Strongly do not recommend/Refused",
  "In your view, has the science of psychology had a generally positive or negative impact on mental health treatments? Mainly positive/Mainly negative/Neither positive nor negative/Refused",
  "Do you assert that scientific research on carbon capture and storage technologies will significantly contribute to mitigating climate change? Will contribute significantly/Will contribute partially/Will contribute slightly/Will not contribute/Refused"
]